app/Http/Controllers/homepage/HomeController.php

SELECT `title`, `id` FROM `category_slides` WHERE (`alanguage` = 'vi' and `keyword` = 'bannerHome') LIMIT 1
SELECT `id`, `title`, `slug`, `description` FROM `category_articles` WHERE (`alanguage` = 'vi' and `publish` = 0 and `ishome` = 1) LIMIT 1
SELECT `title`, `id` FROM `category_slides` WHERE (`alanguage` = 'vi' and `keyword` = 'health') LIMIT 1
---
    public function index()
    {
        $fcSystem = $this->system->fcSystem();
        $slideHome = \App\Models\CategorySlide::select('title', 'id')->where(['alanguage' => config('app.locale'), 'keyword' => 'bannerHome'])->with('slides')->first();
        $features = \App\Models\CategorySlide::select('title', 'id')->where(['alanguage' => config('app.locale'), 'keyword' => 'features'])->with('slides')->first();

        $services =
            \App\Models\CategoryArticle::select('id', 'title', 'slug', 'description')
            ->where(['alanguage' => config('app.locale'), 'publish' => 0, 'id' => 9])
            ->with(['posts' => function ($query) {
                $query->limit(6)->get();
            }])
            ->first();
        $serviceLists =
            \App\Models\CategoryArticle::select('id', 'title', 'slug', 'description')
            ->where(['alanguage' => config('app.locale'), 'publish' => 0, 'id' => 9])
            ->with(['posts'])
            ->first();

SELECT `id`, `title`, `image`, `meta_title`, `meta_description` FROM `pages` WHERE (`alanguage` = 'vi' and `page` = 'index' and `publish` = 0) LIMIT 1
---
    public function search(Request $request)
    {

        $fcSystem = $this->system->fcSystem();
        $page = Page::with('fields')->where(['alanguage' => config('app.locale'), 'page' => 'index', 'publish' => 0])->select('id', 'title', 'image', 'meta_title', 'meta_description')->first();

SELECT `slug`, `created_at` FROM `router`
---
    public function sitemap()
    {
        /*
        $Tags = \App\Models\Tag::select('id', 'slug', 'created_at')->where('alanguage', config('app.locale'))->where('publish', 0)->get();
        $Brands = \App\Models\Brand::select('id', 'slug', 'created_at')->where('alanguage', config('app.locale'))->where('publish', 0)->get(); */
        $router = DB::table('router')->select('slug', 'created_at')->get();