app/Http/Controllers/customer/frontend/CustomerController.php

    public function login()
    {
        $page = Cache::remember('pageLogin', 60, function () {
            return Page::where(['alanguage' => config('app.locale'), 'page' => 'login', 'publish' => 0])->select('meta_title', 'meta_description', 'image', 'title', 'description')->first();
---
SELECT `meta_title`, `meta_description`, `image`, `title`, `description` FROM `pages` WHERE (`alanguage` = 'vi' and `page` = 'login' and `publish` = 0) LIMIT 1

    public function register()
    {
        $page = Page::where(['alanguage' => config('app.locale'), 'page' => 'register', 'publish' => 0])->select('meta_title', 'description', 'meta_description', 'image', 'title')->first();
---
SELECT `meta_title`, `description`, `meta_description`, `image`, `title` FROM `pages` WHERE (`alanguage` = 'vi' and `page` = 'register' and `publish` = 0) LIMIT 1