app/Http/Controllers/customer/frontend/ManagerController.php

SELECT * FROM `customers` WHERE `customers`.`id` = 29 LIMIT 1
SELECT * FROM `customer_categories` ORDER BY `title` ASC
SELECT * FROM `customer_levels` ORDER BY `order` ASC
---
    public function dashboard()
    {
        $fcSystem = $this->system->fcSystem();
        $detail =  Customer::find(Auth::guard('customer')->user()->id);
        $category = dropdown(CustomerCategory::orderBy('title', 'asc')->get(), 'Chọn lớp học', 'id', 'title');
        $customer_levels = dropdown(CustomerLevel::orderBy('order', 'asc')->get(), 'Chọn cấp bậc', 'title', 'title');