app/Http/Controllers/orderOnline/backend/OrderOnlineController.php

SELECT * FROM `order_onlines` ORDER BY `id` DESC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `order_onlines`
---
    public function index(Request $request)
    {
        $data =  OrderOnline::orderBy('id', 'DESC');
        $keyword = $request->keyword;
        if (!empty($keyword)) {
            $data =  $data->where('name', 'like', '%' . $keyword . '%');
        }
        $data =  $data->paginate(env('APP_paginate'));