app/Http/Controllers/ship/backend/ShipController.php

SELECT * FROM `ships` ORDER BY `id` DESC
---
    public function index(Request $request)
    {
        $data =  Ship::orderBy('id', 'DESC');
        if (env('APP_ENV') != "local") {
            $data = $data->where('id', '!=', 1)->where('id', '!=', 2);
        }
        $data = $data->get();