app/Components/backend_global_helper.php

SELECT * FROM `products` ORDER BY `id` DESC LIMIT 1
---
    function CodeRender($module = '')
    {
        switch ($module) {
            case "products":
                $lastRow = \App\Models\Product::orderBy('id', 'DESC')->first();

SELECT `keyword`, `type`, `id` FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'products')
---
    function fieldsInsert($module = '', $id = 0, $request = '')
    {
        $field = \App\Models\ConfigColum::select('keyword', 'type', 'id')->where(['trash' => 0, 'publish' => 0, 'module' => $module])->get();

INSERT INTO `config_postmetas` (`module_id`, `module`, `config_colums_id`, `meta_key`, `meta_value`, `created_at`, `alanguage`) VALUES ('54', 'products', 10, 'config_colums_json_description', '{\"title\":[\"Quy c\\u00e1ch \\u0111\\u00f3ng g\\u00f3i\",\"Nh\\u00e0 s\\u1ea3n xu\\u1ea5t\"],\"content\":[\"T\\u00fai 10 mi\\u1ebfng\",\"Cty TNHH \\u0111\\u1ea7u t\\u01b0 v\\u00e0 th\\u01b0\\u01a1ng m\\u1ea1i An l\\u00e0nh Vi\\u1ec7t Nam\"]}', '2024-05-27 10:28:36', 'vi')
---
                        $meta_value = $request[$meta_key];
                }
                if (!empty($meta_value) && $meta_value != 'null') {
                    DB::table('config_postmetas')->insert([
                        'module_id' => $id,
                        'module' => $module,
                        'config_colums_id' => $item->id,
                        'meta_key' => $meta_key,
                        'meta_value' => $meta_value,
                        'created_at' => Carbon::now(),
                        'alanguage' => config('app.locale'),
                    ]);