app/Components/Comment.php

	public function statistical_rating($param = [], $module)
	{
		/*tính tổng số bản ghi có trong chi tiết module*/
		$totalRows =  ModelsComment::select('id', 'module_id', 'rating')->where('module', $module)->where('module_id', $param['module_id'])->where('parentid', 0)->where('publish', 0)->get();
---
SELECT `id`, `module_id`, `rating` FROM `comments` WHERE `module` = 'products' and `module_id` = 5 and `parentid` = 0 and `publish` = 0

	public function comment_render($module_id = 0, $sort = 'id', $module)
	{
		/*lấy toàn bộ comment*/
		$listComment = ModelsComment::select('comments.*')->where('module', $module)->where('module_id', $module_id)->where('parentid', 0)->where('comments.publish', 0);
		$listComment = $listComment->orderBy('comments.id', 'desc');

		if ($sort == 'gallery') {
			$listComment = $listComment->where('images', '!=', '');
		}
		if ($sort == '5') {
			$listComment = $listComment->where('rating', 5);
		}
		if ($sort == '4') {
			$listComment = $listComment->where('rating', 4);
		}
		if ($sort == '3') {
			$listComment = $listComment->where('rating', 3);
		}
		if ($sort == '2') {
			$listComment = $listComment->where('rating', 2);
		}
		if ($sort == '1') {
			$listComment = $listComment->where('rating', 1);
		}
		if ($sort == 'payment') {
			$listComment = $listComment->join('orders', 'orders.customerid', '=', 'comments.customerid')
				->join('orders_item', 'orders_item.order_id', '=', 'orders.id')
				->groupBy('comments.id')
				->where('product_id', $module_id);
		}
		$listComment = $listComment->paginate(20);
---
SELECT count(*) as aggregate FROM `comments` WHERE `module` = 'products' and `module_id` = 5 and `parentid` = 0 and `comments`.`publish` = 0