app/Components/Helper.php

    function catalogue_relation_ship($productid = 0, $catalogueid = 0, $tmp_catalogue = [], $module = '')
    {
        /*$_catalogue_relation_ship[] = array(
            'module' => $module,
            'moduleid' => $productid,
            'catalogueid' => $catalogueid,
            'created_at' => Carbon::now(),
        ); */
        $_catalogue_relation_ship = [];
        if (isset($tmp_catalogue)) {
            foreach ($tmp_catalogue as $v) {
                $_catalogue_relation_ship[] = array(
                    'module' => $module,
                    'moduleid' => $productid,
                    'catalogueid' => $v,
                    'created_at' => Carbon::now(),
                );
            }
        }
        DB::table('catalogues_relationships')->insert($_catalogue_relation_ship);
---
INSERT INTO `catalogues_relationships` (`catalogueid`, `created_at`, `module`, `moduleid`) VALUES (42, '2024-05-24 11:41:21', 'articles', '112'), (38, '2024-05-24 11:41:21', 'articles', '112'), (59, '2024-05-24 11:41:21', 'articles', '112')

    function attributes_relationships($productid = 0, $attribute = [], $tmp_catalogue = [])
    {
        $_insert_attribute = [];
        if (isset($attribute) && is_array($attribute) && count($attribute) && $attribute != array('0' => 0)) {
            foreach ($attribute as $key => $val) {
                if (isset($val) && is_array($val) && count($val) && $val != array('0' => 0)) {
                    foreach ($val as $sub => $subs) {
                        if (isset($tmp_catalogue)) {
                            foreach ($tmp_catalogue as $v) {
                                $_insert_attribute[] = array(
                                    'product_id' => $productid,
                                    'attribute_id' => $subs,
                                    'created_at' => Carbon::now(),
                                    'category_product_id' => $v
                                );
                            }
                        }
                    }
                }
            }
            if (check_array($_insert_attribute)) {
                DB::table('attributes_relationships')->insert($_insert_attribute);
---
INSERT INTO `attributes_relationships` (`attribute_id`, `category_product_id`, `created_at`, `product_id`) VALUES ('48', '34', '2024-05-27 10:28:36', '54'), ('48', 41, '2024-05-27 10:28:36', '54'), ('3', '34', '2024-05-27 10:28:36', '54'), ('3', 41, '2024-05-27 10:28:36', '54'), ('16', '34', '2024-05-27 10:28:36', '54'), ('16', 41, '2024-05-27 10:28:36', '54')

    function brands_relationships($id = 0, $brand_id = 0, $tmp_catalogue = [])
    {
        //lấy danh mục cha của brand
        $detailBrand = \App\Models\Brand::select('id', 'title', 'slug', 'lft')->where('id', $brand_id)->first();
---
SELECT `id`, `title`, `slug`, `lft` FROM `brands` WHERE `id` = '0' LIMIT 1

    function price_attributes($price = 0, $productid = 0, $tmp_catalogue = [])
    {
        $category_attributes = DB::table('category_attributes')->where(['ishome' => 1, 'alanguage' => config('app.locale')])->first();
---
SELECT * FROM `category_attributes` WHERE (`ishome` = 1 and `alanguage` = 'vi') LIMIT 1