app/Components/Polylang.php

    public function insert($module = '', $request = [], $id = 0)

    {

        foreach (config('language') as $key => $item) {

            if (config('app.locale') == $key) {

                DB::table('polylangs')->where(['module' => $module, $key => $id])->delete();
            }
        }

        DB::table('polylangs')->insert([

            'module' => $module,

            'vi' => !empty($request['vi']) ? $request['vi'] : "",

            'en' => !empty($request['en']) ? $request['en'] : "",

            'tl' => !empty($request['tl']) ? $request['tl'] : '',

            'gm' => !empty($request['gm']) ? $request['gm'] : "",

        ]);
---
INSERT INTO `polylangs` (`module`, `vi`, `en`, `tl`, `gm`) VALUES ('products', '54', '', '', '')