app/Components/System.php

SELECT `keyword`, `content`, `content_en` FROM `generals`
---
    function fcSystem()
    {
        $fcSystem = [];
        if (!empty(Auth::user())) {
            $system = \App\Models\General::select('keyword', 'content', 'content_en')->get();
        } else {
            $system = Cache::remember('system', 600000, function () {
                $system = \App\Models\General::select('keyword', 'content', 'content_en')->get();