app/Libs/Cart.php

SELECT `inventory`, `inventoryPolicy`, `inventoryQuantity` FROM `products` WHERE `products`.`id` = 86 LIMIT 1
---
    function getStockProduct($item = [])
    {
        $stock = 1000;
        $id_version = !empty($item['options']['id_version']) ? $item['options']['id_version'] : '';
        if (!empty($id_version)) {
            $getVersionproduct = \App\Models\ProductVersion::select(
                'id',
                '_stock_status',
                '_stock',
                '_outstock_status'
            )->where('product_id', $item['id'])->where('id_version', $id_version)->first();
            if ($getVersionproduct) {
                if ($getVersionproduct['_stock_status'] == 1 && $getVersionproduct['_outstock_status'] == 0) {
                    $stock = $getVersionproduct['_stock'];
                }
            }
        } else {
            $product = \App\Models\Product::select('inventory', 'inventoryPolicy', 'inventoryQuantity')->find($item['id']);

SELECT * FROM `ships` WHERE (`publish` = 0)
SELECT `cityid`, `districtid` FROM `addresses` WHERE (`active` = 1) LIMIT 1
SELECT `name`, `ProvinceID` FROM `vn_district` WHERE `id` = 1893 LIMIT 1
---
    function getFeeShip($cityID = '', $districtID = '')
    {
        $html = '';
        $html_ghn = [];
        $ships = \App\Models\Ship::where(['publish' => 0])->get();
        if (!$ships->isEmpty()) {

            $shipsAddress = \App\Models\Address::select('cityid', 'districtid')->with('city_name')->with('district_name')->where(['active' => 1])->first();
            $district_name =  \App\Models\VNDistrict::select('name', 'ProvinceID')->where('id', (int)$districtID)->with('city')->first();