app/Libs/Html.php

SELECT `title` FROM `permissions` WHERE `publish` = 0 and `parent_id` = 0
---
    function getFunctions()
    {
        $data = [];
        $getFunctions = \App\Models\Permission::select('title')->where('publish', 0)->where('parent_id', 0)->get()->pluck('title');