app/Libs/Lib.php

SELECT `id`, `title` FROM `menus` WHERE (`slug` = 'menu-header') LIMIT 1
SELECT `menu_items`.`id`, `menu_items`.`menu_id`, `menu_items`.`parentid`, `menu_items`.`title`, `menu_items`.`image`, `menu_items`.`slug`, `menu_items`.`target`, `menu_items`.`type`, `menu_items`.`module_id` FROM `menu_items` WHERE `menu_items`.`parentid` in (211, 212, 213, 214, 215, 240) and `alanguage` = 'vi' ORDER BY `order` ASC, `menu_items`.`order` ASC, `menu_items`.`id` DESC
---
    function getMenus($keyword = "")
    {
        $data = Cache::remember($keyword, 600, function () use ($keyword) {
            $data = \App\Models\Menu::select('id', 'title')->where(['slug' => $keyword])->with(['menu_items' => function ($query) {
                $query->select('menu_items.id', 'menu_items.menu_id', 'menu_items.parentid', 'menu_items.title', 'menu_items.image', 'menu_items.slug', 'menu_items.target', 'menu_items.type', 'menu_items.module_id')
                    ->where(['alanguage' => config('app.locale'), 'parentid' => 0])
                    ->with(['children' => function ($query) {
                        $query->select('menu_items.id', 'menu_items.menu_id', 'menu_items.parentid', 'menu_items.title', 'menu_items.image', 'menu_items.slug', 'menu_items.target', 'menu_items.type', 'menu_items.module_id')->where('alanguage', config('app.locale'))
                            ->orderBy('menu_items.order', 'asc')->orderBy('menu_items.id', 'desc');
                    }])
                    ->orderBy('menu_items.order', 'asc')->orderBy('menu_items.id', 'desc');
            }])->first();