app/Http/Controllers/address/backend/AddressController.php

    public function index(Request $request)
    {
        $data =  Address::where('alanguage', config('app.locale'))->orderBy('order', 'ASC')->orderBy('id', 'DESC');
        $keyword = $request->keyword;
        if (!empty($keyword)) {
            $data =  $data->where($this->table . '.title', 'like', '%' . $keyword . '%');
        }
        $data =  $data->paginate(env('APP_paginate'));
---
SELECT * FROM `addresses` WHERE `alanguage` = 'vi' ORDER BY `order` ASC, `id` DESC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `addresses` WHERE `alanguage` = 'vi'

    public function create()
    {
        $listCity = dropdown(\App\Models\VNCity::orderBy('id', 'asc')->get(), 'Tỉnh/Thành Phố', 'id', 'name');
        $listDistrict = dropdown(\App\Models\VNDistrict::where('ProvinceID', old('cityid'))->orderBy('name', 'asc')->get(), 'Quận/Huyện', 'id', 'name');
        $listWard = dropdown(\App\Models\VNWard::where('DistrictID', old('districtid'))->orderBy('name', 'asc')->get(), 'Phường/Xã', 'id', 'name');
---
SELECT * FROM `vn_district` WHERE `ProvinceID` IS NULL ORDER BY `name` ASC
SELECT * FROM `vn_ward` WHERE `DistrictID` IS NULL ORDER BY `name` ASC

            $image_url = $request->image_old;
        }
        //end
        Address::find($id)->update([
            'title' => $request->title,
            'image' => $image_url,
            'email' => $request->email,
            'hotline' => $request->hotline,
            'address' => $request->address,
            'cityid' => $request->cityid,
            'districtid' => $request->districtid,
            'wardid' => $request->wardid,
            'time' => $request->time,
            'publish' => $request->publish,
            'link' => $request->link,
            'iframe' => $request->iframe,
            'image_json' => !empty($request->album) ? json_encode($request->album) : null,
            'userid_updated' => Auth::user()->id,
            'updated_at' => Carbon::now(),
        ]);
---
SELECT * FROM `addresses` WHERE `addresses`.`id` = '19' LIMIT 1