app/Http/Controllers/page/frontend/PageController.php

SELECT `id`, `image`, `title`, `description`, `meta_title`, `meta_description` FROM `pages` WHERE (`alanguage` = 'vi' and `page` = 'address' and `publish` = 0) LIMIT 1
---
    public function order()
    {
        //page: HOME
        $page = Page::where(['alanguage' => config('app.locale'), 'page' => 'order', 'publish' => 0])
            ->select('id', 'image', 'title', 'description', 'meta_title', 'meta_description')
            ->with('fields')
            ->first();

SELECT `id`, `image`, `title`, `description`, `meta_title`, `meta_description` FROM `pages` WHERE (`alanguage` = 'vi' and `page` = 'category' and `publish` = 0) LIMIT 1
---
    public function teams()
    {
        //page: HOME
        $page = Page::where(['alanguage' => config('app.locale'), 'page' => 'teams', 'publish' => 0])
            ->select('id', 'image', 'title', 'description', 'meta_title', 'meta_description')
            ->with('fields')
            ->first();