app/Http/Controllers/general/GeneralController.php

SELECT * FROM `generals` ORDER BY `created_at` DESC
---
    public function general()
    {
        $tab = config('system');
        $general = General::latest()->get();

UPDATE `generals` SET `keyword` = 'homepage_brandname', `content` = 'Đại Cát Lộc', `userid_created` = 7, `created_at` = '2024-05-21 16:21:21' WHERE `keyword` = 'homepage_brandname'
---
    public function store(Request $request)
    {
        $config = $request->config;
        $_create = [];
        // General::truncate();
        if (isset($config) && is_array($config) && count($config)) {
            foreach ($config as $key => $val) {

                if (config('app.locale') == 'en') {
                    $language = 'content_en';
                } else  if (config('app.locale') == 'tl') {
                    $language = 'content_tl';
                } else if (config('app.locale') == 'gm') {
                    $language = 'content_gm';
                } else {
                    $language = 'content';
                }
                $_create = array(
                    'keyword' => $key,
                    $language =>  !empty($val) ? $val : '',
                    'userid_created' => Auth::user()->id,
                    'created_at' => gmdate('Y-m-d H:i:s', time() + 7 * 3600),
                );
                $flag = $this->_Check($key);

                if ($flag == FALSE) {
                    $slide = DB::table('generals')->insert($_create);
                } else {
                    $slide = DB::table('generals')->where("keyword", $key)->update($_create);

SELECT * FROM `generals` WHERE `keyword` = 'homepage_brandname'
---
    public function _Check($keyword = '')
    {
        $result = General::where('keyword', $keyword)->get()->count();