app/Http/Controllers/page/backend/PageController.php

    public function index(Request $request)
    {
        $dropdown = getFunctions();
        $data =  Page::where('alanguage', config('app.locale'))->orderBy('id', 'DESC');
        if (!in_array('orders', $dropdown)) {
            $data =  $data->whereNotIn('page', ['cart_index', 'cart_checkout', 'cart_success']);
        }
        if (!in_array('customers', $dropdown)) {
            $data =  $data->whereNotIn('page', ['login', 'register']);
        }
        $keyword = $request->keyword;
        if (!empty($keyword)) {
            $data =  $data->where('title', 'like', '%' . $keyword . '%');
        }
        $data =  $data->paginate(env('APP_paginate'));
---
SELECT * FROM `pages` WHERE `alanguage` = 'vi' ORDER BY `id` DESC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `pages` WHERE `alanguage` = 'vi'