{"id":"1716276283-2720-317720077","version":1,"type":"request","time":1716276283.161414,"method":"POST","url":"https:\/\/daicatloc.nhathuocdaicatloc.vn\/tp-admin\/articles\/store","uri":"\/tp-admin\/articles\/store","headers":{"host":["daicatloc.nhathuocdaicatloc.vn"],"priority":["u=0, i"],"cookie":["authImagesManager=%7B%22domain%22%3Anull%2C%22email%22%3A%22admin%40gmail.com%22%2C%22permission%22%3A%5B%22all%22%2C%22upload%22%2C%22delete%22%2C%22rename%22%2C%22create_dirs%22%2C%22delete_dirs%22%2C%22rename_dirs%22%5D%2C%22folder_upload%22%3A%22all%22%7D; remember_web_59ba36addc2b2f9401580f014c7f58ea4e30989d=eyJpdiI6IjNkL0tZUVVWZnczQ0JObTl6TUJKblE9PSIsInZhbHVlIjoiRjNUaGw0cWhJSG9OaFRvUUhaK1dKSlZDOVc0YmlSRVRRZU5GS2N2c3k1TFovN2pJbXVPeXUzT1EwOTNmWnhiUzhsZ3YxYUdGcUVENXpKUU5CbUQ3Vi9KMTR0cUl1SXl6cnBEM2lQTngreDJIbm50TmEvQnBsb253bmZHUWdkQVVpK3oxK3F1aUtNOExOSTVXYW5ZM2NWZHNVMjVWSm1LZjRJVnVVNGFBOFRKVzlCclhycE9kWFpxTGg5dWMwZ1kwOE5UUFlWTjRtSjV4NGxuVjduSFI3anAwME5XNVFua0hFeXhRV2FYTlArOD0iLCJtYWMiOiI1ZTc0YTY3NmZkYzE3ZTg1N2Q2N2RjOWE2MDViODcyOTRlMDJkMDhiMWU1MjJkYmEyYWE0MDFhOTJmYTU2ZWMzIiwidGFnIjoiIn0%3D; wishlist=%5B%223%22%5D; ckCsrfToken=5OJNmVNKJ7qhA71528mytRPDk828vk6Ev97WtdGs; XSRF-TOKEN=eyJpdiI6ImpHTG9lRFZsRFhhWE1OejdkVFFFNUE9PSIsInZhbHVlIjoiUHJlMWdUS01xRnVxWVdJSnNOV2EwdlJJakk1TXJSb0RYWWsrcFJEaDFGaFpLUGp1MGM3dUo0eEZEMXYrQldNVnBjS1FHNjJhTEVQcitZa0U1Y0FxZ1N2SnZVdXI4SW5BNEI1OWZoZDIrQUk5TEJXVDJjOWt2UDRFOElra2o3MU4iLCJtYWMiOiI5OWIxNjkxNDJiYjE3MDU5MThkNmNkMzgxODM1YzMyY2UzODMyZjM1Y2Q3MDk4Y2RhNzI3M2NkZWEzZWM4Yjc3IiwidGFnIjoiIn0%3D; daicatloc_session=eyJpdiI6IlhlSUd5SGNFNVE4allRQWE0Yiswb2c9PSIsInZhbHVlIjoiamV2TnFWcGZnbURDY1J5b3lwcyt3d0ZqRUh6NG5hVzlEOVA5RUlycVF6NjlSVVZqNDB1SUVKbDNtd3JsZXg4V29DRHBKYloxZzY1ZytlbWRVUUZodzJGQVowUXVwSUdiaW44RWFVK0dxcUxoWjZSSDdTT2hrL2JYMHZxWThNTDUiLCJtYWMiOiI4MzkxNTBkYmQ2NGUzMWRjNTIyMzY4NGRlM2Q0Y2U5NmRmYzBlYTVjZjJjMzNlNDM3MGQ2YTc4YmQxYmU2NWIwIiwidGFnIjoiIn0%3D"],"accept-language":["vi,vi-VN;q=0.9,fr-FR;q=0.8,fr;q=0.7,en-US;q=0.6,en;q=0.5,zh-CN;q=0.4,zh;q=0.3"],"accept-encoding":["gzip, deflate, br, zstd"],"referer":["https:\/\/daicatloc.nhathuocdaicatloc.vn\/tp-admin\/articles\/create"],"sec-fetch-dest":["document"],"sec-fetch-user":["?1"],"sec-fetch-mode":["navigate"],"sec-fetch-site":["same-origin"],"accept":["text\/html,application\/xhtml+xml,application\/xml;q=0.9,image\/avif,image\/webp,image\/apng,*\/*;q=0.8,application\/signed-exchange;v=b3;q=0.7"],"user-agent":["Mozilla\/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit\/537.36 (KHTML, like Gecko) Chrome\/124.0.0.0 Safari\/537.36"],"content-type":["multipart\/form-data; boundary=----WebKitFormBoundarylHAogJxqNKi8vta1"],"origin":["https:\/\/daicatloc.nhathuocdaicatloc.vn"],"upgrade-insecure-requests":["1"],"sec-ch-ua-platform":["\"Windows\""],"sec-ch-ua-mobile":["?0"],"sec-ch-ua":["\"Chromium\";v=\"124\", \"Google Chrome\";v=\"124\", \"Not-A.Brand\";v=\"99\""],"cache-control":["max-age=0"],"content-length":["15034"]},"controller":"App\\Http\\Controllers\\article\\backend\\ArticleController@store","getData":[],"postData":{"_token":"zQEWqgxhvNhnLsAcdWGcKXw91EKZyvJcHyusZw3A","title":"Rối loạn trầm cảm dai dẳng là gì? Nguyên nhân, triệu chứng và cách điều trị","slug":"roi-loan-tram-cam-dai-dang-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri","description":"<p>Rối loạn trầm cảm dai dẳng (Persistent depressive disorder) là chứng trầm cảm mãn tính ở mức độ nhẹ đến trung bình. Nó liên quan đến tâm trạng buồn bã hoặc u ám hầu hết thời gian trong ngày, trong hầu hết các ngày, trong hai năm hoặc hơn. Rối loạn trầm cảm dai dẳng là bệnh phổ biến và có thể xảy ra với bất kỳ ai ở mọi lứa tuổi.<\/p>\r\n","content":"<blockquote>\r\n<p>Rối loạn trầm cảm dai dẳng (Persistent depressive disorder) là chứng trầm cảm mãn tính ở mức độ nhẹ đến trung bình. Nó liên quan đến tâm trạng buồn bã hoặc u ám hầu hết thời gian trong ngày, trong hầu hết các ngày, trong hai năm hoặc hơn. Rối loạn trầm cảm dai dẳng là bệnh phổ biến và có thể xảy ra với bất kỳ ai ở mọi lứa tuổi.<\/p>\r\n<\/blockquote>\r\n\r\n<h2><strong>Tìm hiểu chung<\/strong><\/h2>\r\n\r\n<h3><strong>Rối loạn trầm cảm dai dẳng là gì?<\/strong><\/h3>\r\n\r\n<p>Rối loạn trầm cảm dai dẳng (Persistent depressive disorder) là một dạng&nbsp;trầm cảm&nbsp;kéo dài và liên tục. Bạn có thể cảm thấy buồn bã và trống rỗng, mất hứng thú với các hoạt động hàng ngày và gặp khó khăn trong việc hoàn thành công việc. Bạn cũng có thể có lòng tự trọng thấp, cảm thấy mình là kẻ thất bại và vô vọng. Những cảm giác này kéo dài hơn 2 năm và có thể cản trở các mối quan hệ, trường học, công việc và hoạt động hàng ngày của bạn.<\/p>\r\n\r\n<p>Nếu bạn mắc chứng rối loạn trầm cảm dai dẳng, bạn có thể khó có thể lạc quan ngay cả trong những dịp vui vẻ. Bạn có thể được miêu tả là người có tính cách u ám, thường xuyên phàn nàn hoặc không thể vui vẻ.<\/p>\r\n\r\n<p>Vì chứng rối loạn trầm cảm dai dẳng có tính chất lâu dài nên việc đối phó với các triệu chứng trầm cảm có thể là một thách thức. Sự kết hợp giữa liệu pháp tư vấn tâm lý và thuốc chống trầm có thể có hiệu quả trong điều trị tình trạng này.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2><strong>Triệu chứng<\/strong><\/h2>\r\n\r\n<h3><strong>Những dấu hiệu và triệu chứng của rối loạn trầm cảm dai dẳng<\/strong><\/h3>\r\n\r\n<p>Triệu chứng chính của rối loạn trầm cảm dai dẳng là tâm trạng buồn, chán nản hoặc u ám. Các dấu hiệu khác có thể bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Mệt mỏi;<\/li>\r\n\t<li>Cảm giác tuyệt vọng, vô giá trị hoặc bị cô lập;<\/li>\r\n\t<li>Thiếu thèm ăn hoặc ăn quá nhiều;<\/li>\r\n\t<li>Thiếu tập trung;<\/li>\r\n\t<li>Không có năng lượng;<\/li>\r\n\t<li>Lòng tự trọng thấp;<\/li>\r\n\t<li>Rắc rối ở nơi làm việc hoặc trường học;<\/li>\r\n\t<li>Mất ngủ&nbsp;hoặc ngủ quá nhiều.<\/li>\r\n<\/ul>\r\n\r\n<p>Hầu hết những người mắc rối loạn trầm cảm dai dẳng cũng từng trải qua giai đoạn trầm cảm nặng ít nhất một lần tại một thời điểm nào đó, đôi khi được gọi là “trầm cảm kép”.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><em>Thiếu tập trung là triệu chứng thường gặp của rối loạn trầm cảm dai dẳng<\/em><\/p>\r\n\r\n<h3><strong>Khi nào cần gặp bác sĩ?<\/strong><\/h3>\r\n\r\n<p>Nếu bạn có bất kỳ triệu chứng rối loạn trầm cảm dai dẳng nào, đặc biệt là có ý định tự tử hay làm hại người khác, hãy liên hệ ngay với bác sĩ tâm lý để được chẩn đoán và điều trị kịp thời.<\/p>\r\n\r\n<h2><strong>Nguyên nhân<\/strong><\/h2>\r\n\r\n<h3><strong>Nguyên nhân dẫn đến rối loạn trầm cảm dai dẳng<\/strong><\/h3>\r\n\r\n<p>Các nhà khoa học chưa tìm ra nguyên nhân rõ ràng gây ra rối loạn trầm cảm dai dẳng. Nhưng nó có thể liên quan đến mức Serotonin thấp. Serotonin là một loại hormone tự nhiên kiểm soát cảm xúc và cảm giác hạnh phúc của chúng ta. Nó cũng ảnh hưởng đến các chức năng khác của cơ thể.<\/p>\r\n\r\n<p>Giống như trầm cảm nặng, các sự kiện đau thương như mất người thân, vấn đề tài chính hoặc mức độ căng thẳng cao có thể gây ra bệnh này ở một số người.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><em>Nồng độ Hormone Serotonin thấp có thể là nguyên nhân gây rối loạn trầm cảm dai dẳng<\/em><\/p>\r\n\r\n<h2><strong>Nguy cơ<\/strong><\/h2>\r\n\r\n<h3><strong>Những ai có nguy cơ mắc phải rối loạn trầm cảm dai dẳng?<\/strong><\/h3>\r\n\r\n<p>Rối loạn trầm cảm dai dẳng có thể xảy ra với bất cứ ai ở mọi lứa tuổi. Bệnh này phổ biến hơn ở phụ nữ và những người có người thân mắc bệnh tương tự.<\/p>\r\n\r\n<h3><strong>Yếu tố làm tăng nguy cơ mắc phải rối loạn trầm cảm dai dẳng<\/strong><\/h3>\r\n\r\n<p>Rối loạn trầm cảm dai dẳng thường bắt đầu sớm ở thời thơ ấu, tuổi thiếu niên hoặc thanh niên và tiếp tục trong một thời gian dài. Một số yếu tố dường như làm tăng nguy cơ phát triển chứng rối loạn trầm cảm dai dẳng, bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Có người thân ruột thịt cấp một, chẳng hạn như cha mẹ hoặc anh chị em ruột, mắc chứng rối loạn trầm cảm nặng hoặc các chứng rối loạn trầm cảm khác.<\/li>\r\n\t<li>Những sự kiện đau thương hoặc căng thẳng trong cuộc sống, chẳng hạn như mất đi người thân hoặc các vấn đề tài chính lớn.<\/li>\r\n\t<li>Bản thân có những đặc điểm tính cách bao gồm tiêu cực, lòng tự trọng thấp, tự phê phán bản thân hoặc luôn nghĩ điều tồi tệ nhất sẽ xảy ra.<\/li>\r\n\t<li>Mắc các rối loạn sức khỏe tâm thần khác, chẳng hạn như&nbsp;rối loạn nhân cách.<\/li>\r\n<\/ul>\r\n\r\n<h2><strong>Phương Pháp Chẩn Đoán &amp; Điều Trị<\/strong><\/h2>\r\n\r\n<h3><strong>Phương pháp chẩn đoán và xét nghiệm rối loạn trầm cảm dai dẳng<\/strong><\/h3>\r\n\r\n<p>Nếu bạn nghĩ mình mắc rối loạn trầm cảm dai dẳng, hãy nói chuyện với bác sĩ. Không có xét nghiệm nào cho bệnh trầm cảm nên chẩn đoán chỉ dựa vào hỏi bệnh và khám bệnh với bác sĩ. Bác sĩ có thể hỏi:<\/p>\r\n\r\n<ul>\r\n\t<li>Bạn có cảm thấy buồn nhiều không?<\/li>\r\n\t<li>Có lý do cụ thể nào khiến bạn cảm thấy chán nản không?<\/li>\r\n\t<li>Bạn có mất ngủ không?<\/li>\r\n\t<li>Bạn có khó tập trung không?<\/li>\r\n\t<li>Bạn có uống bất kỳ loại thuốc nào không?<\/li>\r\n\t<li>Bạn đã có những triệu chứng này bao lâu rồi?<\/li>\r\n\t<li>Các triệu chứng có xuất hiện liên tục hay đến rồi đi?<\/li>\r\n<\/ul>\r\n\r\n<p>Bác sĩ có thể yêu cầu xét nghiệm máu hoặc nước tiểu để loại trừ các nguyên nhân khác. Bác sĩ cũng có thể giới thiệu bạn đến nhà tâm lý học hoặc bác sĩ tâm thần để điều trị bệnh cho bạn.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><em>Bác sĩ sẽ khám và hỏi bệnh để chẩn đoán bạn có mắc rối loạn trầm cảm dai dẳng không<\/em><\/p>\r\n\r\n<h3><strong>Điều trị rối loạn trầm cảm dai dẳng<\/strong><\/h3>\r\n\r\n<p><strong>Nội khoa<\/strong><\/p>\r\n\r\n<p>Phương pháp điều trị hiệu quả nhất cho rối loạn trầm cảm dai dẳng là kết hợp thuốc và liệu pháp trò chuyện hoặc tư vấn.<\/p>\r\n\r\n<p>Thuốc chống trầm cảm là thuốc theo có thể làm giảm triệu chứng trầm cảm của bạn. Có nhiều loại thuốc khác nhau để điều trị trầm cảm trong đó có 2 nhóm thuốc thường được dùng phổ biến nhất bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li><strong>Thuốc ức chế tái hấp thu Serotonin có chọn lọc (SSRI):<\/strong>&nbsp;Fluoxetine, Sertraline.<\/li>\r\n\t<li><strong>Thuốc ức chế tái hấp thu Serotonin-Norepinephrine (SNRI):<\/strong>&nbsp;Duloxetine, Venlafaxine.<\/li>\r\n<\/ul>\r\n\r\n<p>Liệu pháp nhận thức hành vi cũng có thể giúp điều trị rối loạn trầm cảm dai dẳng. Bác sĩ tâm lý sẽ giúp bạn kiểm tra suy nghĩ và cảm xúc của mình cũng như cách chúng ảnh hưởng đến hành động của bạn. Liệu pháp nhận thức hành vi có thể giúp bạn loại bỏ những suy nghĩ tiêu cực và phát triển suy nghĩ tích cực hơn.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><em>Thuốc chống trầm cảm là phương pháp giúp điều trị rối loạn trầm cảm dai dẳng hiệu quả<\/em><\/p>\r\n\r\n<p><strong>Ngoại khoa<\/strong><\/p>\r\n\r\n<p>Rối loạn trầm cảm dai dẳng thường không được điều trị ngoại khoa mà chỉ được điều trị nội khoa như thuốc và liệu pháp tâm lý.&nbsp;<\/p>\r\n\r\n<h2><strong>Chế Độ Sinh Hoạt &amp; Phòng Ngừa<\/strong><\/h2>\r\n\r\n<h3><strong>Những thói quen sinh hoạt giúp hạn chế diễn tiến của rối loạn trầm cảm dai dẳng<\/strong><\/h3>\r\n\r\n<p><i>Chế độ sinh hoạt:<\/i><\/p>\r\n\r\n<p>Để hạn chế diễn tiến của rối loạn trầm cảm dai dẳng, bạn có thể tham khảo các việc làm sau:<\/p>\r\n\r\n<ul>\r\n\t<li>Tập thể dục mỗi ngày;<\/li>\r\n\t<li>Quản lý căng thẳng bằng các bài tập thư giãn, yoga, khí công, dưỡng sinh;<\/li>\r\n\t<li>Tái khám đầy đủ và tuân thủ điều trị của bác sĩ;<\/li>\r\n\t<li>Tự theo dõi các triệu chứng, nếu có bất kỳ triệu chứng mới hoặc nặng lên của các triệu chứng cũ cần liên hệ ngay với bác sĩ điều trị.<\/li>\r\n<\/ul>\r\n\r\n<p><i>Chế độ dinh dưỡng:<\/i><\/p>\r\n\r\n<p>Không có chế độ dinh dưỡng cụ thể nào cho tình trạng rối loạn trầm cảm dai dẳng, việc duy trì một chế độ dinh dưỡng cân bằng và đầy đủ là cần thiết cho sức khỏe chung của bạn.<\/p>\r\n\r\n<h3><strong>Phòng ngừa rối loạn trầm cảm dai dẳng<\/strong><\/h3>\r\n\r\n<p>Không có cách nào chắc chắn để ngăn ngừa chứng rối loạn trầm cảm dai dẳng. Bởi vì nó thường bắt đầu từ thời thơ ấu hoặc trong những năm thiếu niên, việc xác định trẻ có nguy cơ mắc bệnh này có thể giúp chúng được điều trị sớm.<\/p>\r\n\r\n<p>Các chiến lược có thể giúp giảm hoặc ngăn ngừa các triệu chứng bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Ăn một chế độ ăn uống cân bằng các loại thực phẩm bổ dưỡng.<\/li>\r\n\t<li>Tập thể dục.<\/li>\r\n\t<li>Hãy nói chuyện với gia đình và bạn bè, đặc biệt là trong thời điểm khủng hoảng, để giúp bạn vượt qua giai đoạn khó khăn.<\/li>\r\n\t<li>Điều trị ngay khi có dấu hiệu sớm nhất của vấn đề để giúp ngăn ngừa các triệu chứng trở nên trầm trọng hơn.<\/li>\r\n\t<li>Cân nhắc việc điều trị lâu dài để giúp ngăn ngừa các triệu chứng tái phát.<\/li>\r\n<\/ul>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><em>Ăn một chế độ ăn uống cân bằng các loại thực phẩm bổ dưỡng giúp giảm nguy cơ mắc rối loạn trầm cảm dai dẳng<\/em><\/p>\r\n\r\n<h3><strong>Các câu hỏi thường gặp về rối loạn trầm cảm dai dẳng<\/strong><\/h3>\r\n\r\n<p><strong>Rối loạn trầm cảm dai dẳng có di truyền không?<\/strong><\/p>\r\n\r\n<p>Có. Nếu người thân trong gia đình mắc trầm cảm hoặc các bệnh lý tâm thần khác thì bạn có nguy cơ mắc rối loạn trầm cảm dai dẳng.<\/p>\r\n\r\n<p><strong>Nguyên nhân gây ra bệnh rối loạn trầm cảm dai dẳng?<\/strong><\/p>\r\n\r\n<p>Nguyên nhân của rối loạn trầm cảm dai dẳng vẫn chưa được biết rõ, nhưng nó có thể liên quan đến các sự kiện đau thương như mất người thân, vấn đề tài chính hoặc mức độ căng thẳng cao.<\/p>\r\n\r\n<p><strong>Rối loạn trầm cảm dai dẳng có thể điều trị khỏi hoàn toàn không?<\/strong><\/p>\r\n\r\n<p>Với thuốc, liệu pháp nhận thức hành vi và thay đổi lối sống, bạn có thể kiểm soát rối loạn trầm cảm dai dẳng và cảm thấy tâm trạng tốt hơn. Nhưng một số người có triệu chứng trầm cảm trong suốt cuộc đời của họ.<\/p>\r\n\r\n<p>Hầu hết những người bị rối loạn trầm cảm dai dẳng sẽ trải qua một hoặc nhiều giai đoạn trầm cảm nặng. Nếu trầm cảm trở nên tồi tệ hơn, hãy nói chuyện với bác sĩ tâm lý để được điều trị phù hợp.<\/p>\r\n\r\n<p><strong>Rối loạn trầm cảm dai dẳng được điều trị như thế nào?<\/strong><\/p>\r\n\r\n<p>Phương pháp điều trị hiệu quả nhất cho rối loạn trầm cảm dai dẳng là kết hợp thuốc và liệu pháp nhận thức hành vi.<\/p>\r\n\r\n<p><strong>Rối loạn trầm cảm dai dẳng có thể phòng ngừa được không?<\/strong><\/p>\r\n\r\n<p>Không có cách nào để ngăn ngừa rối loạn trầm cảm dai dẳng do vẫn chưa tìm được nguyên nhân rõ ràng. Tuy nhiên, có thể giảm tình trạng này bằng các thực hiện lối sống lành mạnh, giảm căng thẳng và nói chuyện với bác sĩ tâm lý khi bạn có bất kỳ triệu chứng nào của rối loạn trầm cảm dai dẳng.<\/p>\r\n","meta_title":"","meta_description":"","catalogue_id":"37","image_old":"","publish":"0"},"requestData":null,"sessionData":{"_token":"zQEWqgxhvNhnLsAcdWGcKXw91EKZyvJcHyusZw3A","login_web_59ba36addc2b2f9401580f014c7f58ea4e30989d":7,"_previous":{"__type__":"array","url":"https:\/\/daicatloc.nhathuocdaicatloc.vn\/tp-admin\/articles\/create"},"_flash":{"__type__":"array","old":{"__type__":"array","0":"success"},"new":{"__type__":"array"}},"success":"Thêm mới bài viết thành công"},"authenticatedUser":{"id":7,"username":"admin@gmail.com","email":"admin@gmail.com","name":"ADMIN TP"},"cookies":{"authImagesManager":"{\"domain\":null,\"email\":\"admin@gmail.com\",\"permission\":[\"all\",\"upload\",\"delete\",\"rename\",\"create_dirs\",\"delete_dirs\",\"rename_dirs\"],\"folder_upload\":\"all\"}","remember_web_59ba36addc2b2f9401580f014c7f58ea4e30989d":"eyJpdiI6IjNkL0tZUVVWZnczQ0JObTl6TUJKblE9PSIsInZhbHVlIjoiRjNUaGw0cWhJSG9OaFRvUUhaK1dKSlZDOVc0YmlSRVRRZU5GS2N2c3k1TFovN2pJbXVPeXUzT1EwOTNmWnhiUzhsZ3YxYUdGcUVENXpKUU5CbUQ3Vi9KMTR0cUl1SXl6cnBEM2lQTngreDJIbm50TmEvQnBsb253bmZHUWdkQVVpK3oxK3F1aUtNOExOSTVXYW5ZM2NWZHNVMjVWSm1LZjRJVnVVNGFBOFRKVzlCclhycE9kWFpxTGg5dWMwZ1kwOE5UUFlWTjRtSjV4NGxuVjduSFI3anAwME5XNVFua0hFeXhRV2FYTlArOD0iLCJtYWMiOiI1ZTc0YTY3NmZkYzE3ZTg1N2Q2N2RjOWE2MDViODcyOTRlMDJkMDhiMWU1MjJkYmEyYWE0MDFhOTJmYTU2ZWMzIiwidGFnIjoiIn0=","wishlist":"[\"3\"]","ckCsrfToken":"5OJNmVNKJ7qhA71528mytRPDk828vk6Ev97WtdGs","XSRF-TOKEN":"eyJpdiI6ImpHTG9lRFZsRFhhWE1OejdkVFFFNUE9PSIsInZhbHVlIjoiUHJlMWdUS01xRnVxWVdJSnNOV2EwdlJJakk1TXJSb0RYWWsrcFJEaDFGaFpLUGp1MGM3dUo0eEZEMXYrQldNVnBjS1FHNjJhTEVQcitZa0U1Y0FxZ1N2SnZVdXI4SW5BNEI1OWZoZDIrQUk5TEJXVDJjOWt2UDRFOElra2o3MU4iLCJtYWMiOiI5OWIxNjkxNDJiYjE3MDU5MThkNmNkMzgxODM1YzMyY2UzODMyZjM1Y2Q3MDk4Y2RhNzI3M2NkZWEzZWM4Yjc3IiwidGFnIjoiIn0=","daicatloc_session":"eyJpdiI6IlhlSUd5SGNFNVE4allRQWE0Yiswb2c9PSIsInZhbHVlIjoiamV2TnFWcGZnbURDY1J5b3lwcyt3d0ZqRUh6NG5hVzlEOVA5RUlycVF6NjlSVVZqNDB1SUVKbDNtd3JsZXg4V29DRHBKYloxZzY1ZytlbWRVUUZodzJGQVowUXVwSUdiaW44RWFVK0dxcUxoWjZSSDdTT2hrL2JYMHZxWThNTDUiLCJtYWMiOiI4MzkxNTBkYmQ2NGUzMWRjNTIyMzY4NGRlM2Q0Y2U5NmRmYzBlYTVjZjJjMzNlNDM3MGQ2YTc4YmQxYmU2NWIwIiwidGFnIjoiIn0="},"responseTime":1716276283.473927,"responseStatus":302,"responseDuration":312.5131130218506,"memoryUsage":25165824,"middleware":["web","locale","auth:web"],"databaseQueries":[{"query":"SELECT * FROM `users` WHERE `id` = 7 LIMIT 1","duration":2.13,"connection":"mysql","time":1716276283.425606,"trace":[{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/fruitcake\/laravel-cors\/src\/HandleCors.php","line":38,"isVendor":true},{"call":"Fruitcake\\Cors\\HandleCors->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Http\/Middleware\/TrustProxies.php","line":39,"isVendor":true},{"call":"Illuminate\\Http\\Middleware\\TrustProxies->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/itsgoingd\/clockwork\/Clockwork\/Support\/Laravel\/ClockworkMiddleware.php","line":24,"isVendor":true},{"call":"Clockwork\\Support\\Laravel\\ClockworkMiddleware->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":103,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->then()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Http\/Kernel.php","line":142,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->sendRequestThroughRouter()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Http\/Kernel.php","line":111,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/public\/index.php","line":51,"isVendor":false}],"model":"App\\Models\\User","tags":[]},{"query":"SELECT count(*) as aggregate FROM `router` WHERE `slug` = 'roi-loan-tram-cam-dai-dang-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri' and (`alanguage` = 'vi')","duration":0.7,"connection":"mysql","time":1716276283.440804,"trace":[{"call":"Illuminate\\Http\\Request->__call()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":98,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Middleware\/SubstituteBindings.php","line":50,"isVendor":true}],"model":null,"tags":[]},{"query":"SELECT `id`, `title`, `slug`, `lft` FROM `category_articles` WHERE `id` = '37' LIMIT 1","duration":7.57,"connection":"mysql","time":1716276283.442656,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Builder->first()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":193,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":"App\\Models\\CategoryArticle","tags":[]},{"query":"SELECT `id`, `title` FROM `category_articles` WHERE `alanguage` = 'vi' and `lft` <= 13 and `rgt` >= 13 ORDER BY `lft` ASC, `order` ASC","duration":0.51,"connection":"mysql","time":1716276283.451062,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Builder->get()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":194,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":"App\\Models\\CategoryArticle","tags":[]},{"query":"INSERT INTO `articles` (`title`, `slug`, `catalogue_id`, `image`, `description`, `content`, `catalogue`, `products`, `meta_title`, `meta_description`, `publish`, `userid_created`, `created_at`, `alanguage`) VALUES ('Rối loạn trầm cảm dai dẳng là gì? Nguyên nhân, triệu chứng và cách điều trị', 'roi-loan-tram-cam-dai-dang-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri', '37', , '<p>Rối loạn trầm cảm dai dẳng (Persistent depressive disorder) là chứng trầm cảm mãn tính ở mức độ nhẹ đến trung bình. Nó liên quan đến tâm trạng buồn bã hoặc u ám hầu hết thời gian trong ngày, trong hầu hết các ngày, trong hai năm hoặc hơn. Rối loạn trầm cảm dai dẳng là bệnh phổ biến và có thể xảy ra với bất kỳ ai ở mọi lứa tuổi.<\/p>', '<blockquote>\\r\\n<p>Rối loạn trầm cảm dai dẳng (Persistent depressive disorder) là chứng trầm cảm mãn tính ở mức độ nhẹ đến trung bình. Nó liên quan đến tâm trạng buồn bã hoặc u ám hầu hết thời gian trong ngày, trong hầu hết các ngày, trong hai năm hoặc hơn. Rối loạn trầm cảm dai dẳng là bệnh phổ biến và có thể xảy ra với bất kỳ ai ở mọi lứa tuổi.<\/p>\\r\\n<\/blockquote>\\r\\n\\r\\n<h2><strong>Tìm hiểu chung<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Rối loạn trầm cảm dai dẳng là gì?<\/strong><\/h3>\\r\\n\\r\\n<p>Rối loạn trầm cảm dai dẳng (Persistent depressive disorder) là một dạng&nbsp;trầm cảm&nbsp;kéo dài và liên tục. Bạn có thể cảm thấy buồn bã và trống rỗng, mất hứng thú với các hoạt động hàng ngày và gặp khó khăn trong việc hoàn thành công việc. Bạn cũng có thể có lòng tự trọng thấp, cảm thấy mình là kẻ thất bại và vô vọng. Những cảm giác này kéo dài hơn 2 năm và có thể cản trở các mối quan hệ, trường học, công việc và hoạt động hàng ngày của bạn.<\/p>\\r\\n\\r\\n<p>Nếu bạn mắc chứng rối loạn trầm cảm dai dẳng, bạn có thể khó có thể lạc quan ngay cả trong những dịp vui vẻ. Bạn có thể được miêu tả là người có tính cách u ám, thường xuyên phàn nàn hoặc không thể vui vẻ.<\/p>\\r\\n\\r\\n<p>Vì chứng rối loạn trầm cảm dai dẳng có tính chất lâu dài nên việc đối phó với các triệu chứng trầm cảm có thể là một thách thức. Sự kết hợp giữa liệu pháp tư vấn tâm lý và thuốc chống trầm có thể có hiệu quả trong điều trị tình trạng này.<\/p>\\r\\n\\r\\n<p>&nbsp;<\/p>\\r\\n\\r\\n<h2><strong>Triệu chứng<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Những dấu hiệu và triệu chứng của rối loạn trầm cảm dai dẳng<\/strong><\/h3>\\r\\n\\r\\n<p>Triệu chứng chính của rối loạn trầm cảm dai dẳng là tâm trạng buồn, chán nản hoặc u ám. Các dấu hiệu khác có thể bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Mệt mỏi;<\/li>\\r\\n\t<li>Cảm giác tuyệt vọng, vô giá trị hoặc bị cô lập;<\/li>\\r\\n\t<li>Thiếu thèm ăn hoặc ăn quá nhiều;<\/li>\\r\\n\t<li>Thiếu tập trung;<\/li>\\r\\n\t<li>Không có năng lượng;<\/li>\\r\\n\t<li>Lòng tự trọng thấp;<\/li>\\r\\n\t<li>Rắc rối ở nơi làm việc hoặc trường học;<\/li>\\r\\n\t<li>Mất ngủ&nbsp;hoặc ngủ quá nhiều.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p>Hầu hết những người mắc rối loạn trầm cảm dai dẳng cũng từng trải qua giai đoạn trầm cảm nặng ít nhất một lần tại một thời điểm nào đó, đôi khi được gọi là “trầm cảm kép”.<\/p>\\r\\n\\r\\n<p>&nbsp;<\/p>\\r\\n\\r\\n<p><em>Thiếu tập trung là triệu chứng thường gặp của rối loạn trầm cảm dai dẳng<\/em><\/p>\\r\\n\\r\\n<h3><strong>Khi nào cần gặp bác sĩ?<\/strong><\/h3>\\r\\n\\r\\n<p>Nếu bạn có bất kỳ triệu chứng rối loạn trầm cảm dai dẳng nào, đặc biệt là có ý định tự tử hay làm hại người khác, hãy liên hệ ngay với bác sĩ tâm lý để được chẩn đoán và điều trị kịp thời.<\/p>\\r\\n\\r\\n<h2><strong>Nguyên nhân<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Nguyên nhân dẫn đến rối loạn trầm cảm dai dẳng<\/strong><\/h3>\\r\\n\\r\\n<p>Các nhà khoa học chưa tìm ra nguyên nhân rõ ràng gây ra rối loạn trầm cảm dai dẳng. Nhưng nó có thể liên quan đến mức Serotonin thấp. Serotonin là một loại hormone tự nhiên kiểm soát cảm xúc và cảm giác hạnh phúc của chúng ta. Nó cũng ảnh hưởng đến các chức năng khác của cơ thể.<\/p>\\r\\n\\r\\n<p>Giống như trầm cảm nặng, các sự kiện đau thương như mất người thân, vấn đề tài chính hoặc mức độ căng thẳng cao có thể gây ra bệnh này ở một số người.<\/p>\\r\\n\\r\\n<p>&nbsp;<\/p>\\r\\n\\r\\n<p><em>Nồng độ Hormone Serotonin thấp có thể là nguyên nhân gây rối loạn trầm cảm dai dẳng<\/em><\/p>\\r\\n\\r\\n<h2><strong>Nguy cơ<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Những ai có nguy cơ mắc phải rối loạn trầm cảm dai dẳng?<\/strong><\/h3>\\r\\n\\r\\n<p>Rối loạn trầm cảm dai dẳng có thể xảy ra với bất cứ ai ở mọi lứa tuổi. Bệnh này phổ biến hơn ở phụ nữ và những người có người thân mắc bệnh tương tự.<\/p>\\r\\n\\r\\n<h3><strong>Yếu tố làm tăng nguy cơ mắc phải rối loạn trầm cảm dai dẳng<\/strong><\/h3>\\r\\n\\r\\n<p>Rối loạn trầm cảm dai dẳng thường bắt đầu sớm ở thời thơ ấu, tuổi thiếu niên hoặc thanh niên và tiếp tục trong một thời gian dài. Một số yếu tố dường như làm tăng nguy cơ phát triển chứng rối loạn trầm cảm dai dẳng, bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Có người thân ruột thịt cấp một, chẳng hạn như cha mẹ hoặc anh chị em ruột, mắc chứng rối loạn trầm cảm nặng hoặc các chứng rối loạn trầm cảm khác.<\/li>\\r\\n\t<li>Những sự kiện đau thương hoặc căng thẳng trong cuộc sống, chẳng hạn như mất đi người thân hoặc các vấn đề tài chính lớn.<\/li>\\r\\n\t<li>Bản thân có những đặc điểm tính cách bao gồm tiêu cực, lòng tự trọng thấp, tự phê phán bản thân hoặc luôn nghĩ điều tồi tệ nhất sẽ xảy ra.<\/li>\\r\\n\t<li>Mắc các rối loạn sức khỏe tâm thần khác, chẳng hạn như&nbsp;rối loạn nhân cách.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<h2><strong>Phương Pháp Chẩn Đoán &amp; Điều Trị<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Phương pháp chẩn đoán và xét nghiệm rối loạn trầm cảm dai dẳng<\/strong><\/h3>\\r\\n\\r\\n<p>Nếu bạn nghĩ mình mắc rối loạn trầm cảm dai dẳng, hãy nói chuyện với bác sĩ. Không có xét nghiệm nào cho bệnh trầm cảm nên chẩn đoán chỉ dựa vào hỏi bệnh và khám bệnh với bác sĩ. Bác sĩ có thể hỏi:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Bạn có cảm thấy buồn nhiều không?<\/li>\\r\\n\t<li>Có lý do cụ thể nào khiến bạn cảm thấy chán nản không?<\/li>\\r\\n\t<li>Bạn có mất ngủ không?<\/li>\\r\\n\t<li>Bạn có khó tập trung không?<\/li>\\r\\n\t<li>Bạn có uống bất kỳ loại thuốc nào không?<\/li>\\r\\n\t<li>Bạn đã có những triệu chứng này bao lâu rồi?<\/li>\\r\\n\t<li>Các triệu chứng có xuất hiện liên tục hay đến rồi đi?<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p>Bác sĩ có thể yêu cầu xét nghiệm máu hoặc nước tiểu để loại trừ các nguyên nhân khác. Bác sĩ cũng có thể giới thiệu bạn đến nhà tâm lý học hoặc bác sĩ tâm thần để điều trị bệnh cho bạn.<\/p>\\r\\n\\r\\n<p>&nbsp;<\/p>\\r\\n\\r\\n<p><em>Bác sĩ sẽ khám và hỏi bệnh để chẩn đoán bạn có mắc rối loạn trầm cảm dai dẳng không<\/em><\/p>\\r\\n\\r\\n<h3><strong>Điều trị rối loạn trầm cảm dai dẳng<\/strong><\/h3>\\r\\n\\r\\n<p><strong>Nội khoa<\/strong><\/p>\\r\\n\\r\\n<p>Phương pháp điều trị hiệu quả nhất cho rối loạn trầm cảm dai dẳng là kết hợp thuốc và liệu pháp trò chuyện hoặc tư vấn.<\/p>\\r\\n\\r\\n<p>Thuốc chống trầm cảm là thuốc theo có thể làm giảm triệu chứng trầm cảm của bạn. Có nhiều loại thuốc khác nhau để điều trị trầm cảm trong đó có 2 nhóm thuốc thường được dùng phổ biến nhất bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li><strong>Thuốc ức chế tái hấp thu Serotonin có chọn lọc (SSRI):<\/strong>&nbsp;Fluoxetine, Sertraline.<\/li>\\r\\n\t<li><strong>Thuốc ức chế tái hấp thu Serotonin-Norepinephrine (SNRI):<\/strong>&nbsp;Duloxetine, Venlafaxine.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p>Liệu pháp nhận thức hành vi cũng có thể giúp điều trị rối loạn trầm cảm dai dẳng. Bác sĩ tâm lý sẽ giúp bạn kiểm tra suy nghĩ và cảm xúc của mình cũng như cách chúng ảnh hưởng đến hành động của bạn. Liệu pháp nhận thức hành vi có thể giúp bạn loại bỏ những suy nghĩ tiêu cực và phát triển suy nghĩ tích cực hơn.<\/p>\\r\\n\\r\\n<p>&nbsp;<\/p>\\r\\n\\r\\n<p><em>Thuốc chống trầm cảm là phương pháp giúp điều trị rối loạn trầm cảm dai dẳng hiệu quả<\/em><\/p>\\r\\n\\r\\n<p><strong>Ngoại khoa<\/strong><\/p>\\r\\n\\r\\n<p>Rối loạn trầm cảm dai dẳng thường không được điều trị ngoại khoa mà chỉ được điều trị nội khoa như thuốc và liệu pháp tâm lý.&nbsp;<\/p>\\r\\n\\r\\n<h2><strong>Chế Độ Sinh Hoạt &amp; Phòng Ngừa<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Những thói quen sinh hoạt giúp hạn chế diễn tiến của rối loạn trầm cảm dai dẳng<\/strong><\/h3>\\r\\n\\r\\n<p><i>Chế độ sinh hoạt:<\/i><\/p>\\r\\n\\r\\n<p>Để hạn chế diễn tiến của rối loạn trầm cảm dai dẳng, bạn có thể tham khảo các việc làm sau:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Tập thể dục mỗi ngày;<\/li>\\r\\n\t<li>Quản lý căng thẳng bằng các bài tập thư giãn, yoga, khí công, dưỡng sinh;<\/li>\\r\\n\t<li>Tái khám đầy đủ và tuân thủ điều trị của bác sĩ;<\/li>\\r\\n\t<li>Tự theo dõi các triệu chứng, nếu có bất kỳ triệu chứng mới hoặc nặng lên của các triệu chứng cũ cần liên hệ ngay với bác sĩ điều trị.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p><i>Chế độ dinh dưỡng:<\/i><\/p>\\r\\n\\r\\n<p>Không có chế độ dinh dưỡng cụ thể nào cho tình trạng rối loạn trầm cảm dai dẳng, việc duy trì một chế độ dinh dưỡng cân bằng và đầy đủ là cần thiết cho sức khỏe chung của bạn.<\/p>\\r\\n\\r\\n<h3><strong>Phòng ngừa rối loạn trầm cảm dai dẳng<\/strong><\/h3>\\r\\n\\r\\n<p>Không có cách nào chắc chắn để ngăn ngừa chứng rối loạn trầm cảm dai dẳng. Bởi vì nó thường bắt đầu từ thời thơ ấu hoặc trong những năm thiếu niên, việc xác định trẻ có nguy cơ mắc bệnh này có thể giúp chúng được điều trị sớm.<\/p>\\r\\n\\r\\n<p>Các chiến lược có thể giúp giảm hoặc ngăn ngừa các triệu chứng bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Ăn một chế độ ăn uống cân bằng các loại thực phẩm bổ dưỡng.<\/li>\\r\\n\t<li>Tập thể dục.<\/li>\\r\\n\t<li>Hãy nói chuyện với gia đình và bạn bè, đặc biệt là trong thời điểm khủng hoảng, để giúp bạn vượt qua giai đoạn khó khăn.<\/li>\\r\\n\t<li>Điều trị ngay khi có dấu hiệu sớm nhất của vấn đề để giúp ngăn ngừa các triệu chứng trở nên trầm trọng hơn.<\/li>\\r\\n\t<li>Cân nhắc việc điều trị lâu dài để giúp ngăn ngừa các triệu chứng tái phát.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p>&nbsp;<\/p>\\r\\n\\r\\n<p><em>Ăn một chế độ ăn uống cân bằng các loại thực phẩm bổ dưỡng giúp giảm nguy cơ mắc rối loạn trầm cảm dai dẳng<\/em><\/p>\\r\\n\\r\\n<h3><strong>Các câu hỏi thường gặp về rối loạn trầm cảm dai dẳng<\/strong><\/h3>\\r\\n\\r\\n<p><strong>Rối loạn trầm cảm dai dẳng có di truyền không?<\/strong><\/p>\\r\\n\\r\\n<p>Có. Nếu người thân trong gia đình mắc trầm cảm hoặc các bệnh lý tâm thần khác thì bạn có nguy cơ mắc rối loạn trầm cảm dai dẳng.<\/p>\\r\\n\\r\\n<p><strong>Nguyên nhân gây ra bệnh rối loạn trầm cảm dai dẳng?<\/strong><\/p>\\r\\n\\r\\n<p>Nguyên nhân của rối loạn trầm cảm dai dẳng vẫn chưa được biết rõ, nhưng nó có thể liên quan đến các sự kiện đau thương như mất người thân, vấn đề tài chính hoặc mức độ căng thẳng cao.<\/p>\\r\\n\\r\\n<p><strong>Rối loạn trầm cảm dai dẳng có thể điều trị khỏi hoàn toàn không?<\/strong><\/p>\\r\\n\\r\\n<p>Với thuốc, liệu pháp nhận thức hành vi và thay đổi lối sống, bạn có thể kiểm soát rối loạn trầm cảm dai dẳng và cảm thấy tâm trạng tốt hơn. Nhưng một số người có triệu chứng trầm cảm trong suốt cuộc đời của họ.<\/p>\\r\\n\\r\\n<p>Hầu hết những người bị rối loạn trầm cảm dai dẳng sẽ trải qua một hoặc nhiều giai đoạn trầm cảm nặng. Nếu trầm cảm trở nên tồi tệ hơn, hãy nói chuyện với bác sĩ tâm lý để được điều trị phù hợp.<\/p>\\r\\n\\r\\n<p><strong>Rối loạn trầm cảm dai dẳng được điều trị như thế nào?<\/strong><\/p>\\r\\n\\r\\n<p>Phương pháp điều trị hiệu quả nhất cho rối loạn trầm cảm dai dẳng là kết hợp thuốc và liệu pháp nhận thức hành vi.<\/p>\\r\\n\\r\\n<p><strong>Rối loạn trầm cảm dai dẳng có thể phòng ngừa được không?<\/strong><\/p>\\r\\n\\r\\n<p>Không có cách nào để ngăn ngừa rối loạn trầm cảm dai dẳng do vẫn chưa tìm được nguyên nhân rõ ràng. Tuy nhiên, có thể giảm tình trạng này bằng các thực hiện lối sống lành mạnh, giảm căng thẳng và nói chuyện với bác sĩ tâm lý khi bạn có bất kỳ triệu chứng nào của rối loạn trầm cảm dai dẳng.<\/p>', '[37,36]', 'NULL', , , '0', 7, '2024-05-21 14:24:43', 'vi')","duration":8.59,"connection":"mysql","time":1716276283.453628,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Model::__callStatic()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":219,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":"App\\Models\\Article","tags":[]},{"query":"INSERT INTO `catalogues_relationships` (`catalogueid`, `created_at`, `module`, `moduleid`) VALUES (37, '2024-05-21 14:24:43', 'articles', 47), (36, '2024-05-21 14:24:43', 'articles', 47)","duration":1.02,"connection":"mysql","time":1716276283.462752,"trace":[{"call":"Illuminate\\Database\\Query\\Builder->insert()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php","line":31,"isVendor":false},{"call":"App\\Components\\Helper->catalogue_relation_ship()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":237,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false}],"model":null,"tags":[]},{"query":"INSERT INTO `router` (`moduleid`, `module`, `slug`, `created_at`, `alanguage`) VALUES (47, 'articles', 'roi-loan-tram-cam-dai-dang-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri', '2024-05-21 14:24:43', 'vi')","duration":0.66,"connection":"mysql","time":1716276283.464169,"trace":[{"call":"Illuminate\\Database\\Query\\Builder->insert()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":246,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":null,"tags":[]},{"query":"SELECT `keyword`, `type`, `id` FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'articles')","duration":1.02,"connection":"mysql","time":1716276283.465748,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Builder->get()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/backend_global_helper.php","line":306,"isVendor":false},{"call":"fieldsInsert()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":249,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false}],"model":"App\\Models\\ConfigColum","tags":[]}],"databaseQueriesCount":8,"databaseSlowQueries":0,"databaseSelects":5,"databaseInserts":3,"databaseUpdates":0,"databaseDeletes":0,"databaseOthers":0,"databaseDuration":22.2,"cacheQueries":[],"cacheReads":0,"cacheHits":0,"cacheWrites":0,"cacheDeletes":0,"cacheTime":null,"modelsActions":[],"modelsRetrieved":{"App\\Models\\User":1,"App\\Models\\CategoryArticle":3},"modelsCreated":[],"modelsUpdated":[],"modelsDeleted":[],"redisCommands":[],"queueJobs":[],"timelineData":[{"description":"Controller","start":1716276283.386473,"end":1716276283.473828,"duration":87.35513687133789,"color":null,"data":null}],"log":[{"message":"Optional parameter $request declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 357","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716276283.401058,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]},{"message":"Optional parameter $taxes_type declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 527","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716276283.401452,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]},{"message":"Optional parameter $taxes_import declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 527","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716276283.401655,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]},{"message":"Optional parameter $taxes_export declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 527","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716276283.401846,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]}],"events":[],"routes":[],"notifications":[],"emailsData":[],"viewsData":[],"userData":[],"subrequests":[],"xdebug":[],"commandName":null,"commandArguments":[],"commandArgumentsDefaults":[],"commandOptions":[],"commandOptionsDefaults":[],"commandExitCode":null,"commandOutput":null,"jobName":null,"jobDescription":null,"jobStatus":null,"jobPayload":[],"jobQueue":null,"jobConnection":null,"jobOptions":[],"testName":null,"testStatus":null,"testStatusMessage":null,"testAsserts":[],"clientMetrics":[],"webVitals":[],"parent":null,"updateToken":"47a48434"}