{"id":"1716369317-8333-1542370445","version":1,"type":"request","time":1716369317.711811,"method":"POST","url":"https:\/\/daicatloc.nhathuocdaicatloc.vn\/tp-admin\/articles\/store","uri":"\/tp-admin\/articles\/store","headers":{"host":["daicatloc.nhathuocdaicatloc.vn"],"priority":["u=0, i"],"cookie":["authImagesManager=%7B%22domain%22%3Anull%2C%22email%22%3A%22admin%40gmail.com%22%2C%22permission%22%3A%5B%22all%22%2C%22upload%22%2C%22delete%22%2C%22rename%22%2C%22create_dirs%22%2C%22delete_dirs%22%2C%22rename_dirs%22%5D%2C%22folder_upload%22%3A%22all%22%7D; remember_web_59ba36addc2b2f9401580f014c7f58ea4e30989d=eyJpdiI6IjNkL0tZUVVWZnczQ0JObTl6TUJKblE9PSIsInZhbHVlIjoiRjNUaGw0cWhJSG9OaFRvUUhaK1dKSlZDOVc0YmlSRVRRZU5GS2N2c3k1TFovN2pJbXVPeXUzT1EwOTNmWnhiUzhsZ3YxYUdGcUVENXpKUU5CbUQ3Vi9KMTR0cUl1SXl6cnBEM2lQTngreDJIbm50TmEvQnBsb253bmZHUWdkQVVpK3oxK3F1aUtNOExOSTVXYW5ZM2NWZHNVMjVWSm1LZjRJVnVVNGFBOFRKVzlCclhycE9kWFpxTGg5dWMwZ1kwOE5UUFlWTjRtSjV4NGxuVjduSFI3anAwME5XNVFua0hFeXhRV2FYTlArOD0iLCJtYWMiOiI1ZTc0YTY3NmZkYzE3ZTg1N2Q2N2RjOWE2MDViODcyOTRlMDJkMDhiMWU1MjJkYmEyYWE0MDFhOTJmYTU2ZWMzIiwidGFnIjoiIn0%3D; wishlist=%5B%223%22%5D; ckCsrfToken=v0soLKq775dVl4RQNjVLdsz3qMcfE7BY94G1Bb3Q; XSRF-TOKEN=eyJpdiI6IngrREg3TTVRZGt4eTE1TW1ZS0l1UVE9PSIsInZhbHVlIjoiZmF0OUF6TStxeVVsVEJCaVZmbUpuU2xoa0lCNzFyNGU0bCtEZ3NZdDd6Tkt4Vm5pdnZ0UzgvSW9OcFh1cCtiSWlta3JRRHM4UUJhY0JNdXVEMDZia3l1L3pVM3M0K1pmK1FkMTFXNjR3bjJXekorUXlvdHN0OUxxTE0wamkvUFciLCJtYWMiOiIxODYzZjljMGQ5YjY5ODA0NzM2NTgzMzlkOWMwNWM0MjI1MjNkYjA1ODI5MGQyZWU4OWY0N2U3YWVlNTQ5ODM5IiwidGFnIjoiIn0%3D; daicatloc_session=eyJpdiI6IjFPQWNlWUtYc1FOSXRTZUUyMXV6V3c9PSIsInZhbHVlIjoiVnhFU2FSM1dWS2VBOUI4UDVER0VWNHhEYk1DL1ZYSk1QSjVKbTR2MzAvUERvZjdpT1FRU2dpZmFNZXh2M3hKU1VBbFFrN2JEYzRFejFQbTZoVWZNbXBHV3JxdUtDUitkaGpIeUV0VHN4TG54R1Fxb1llNC9EeGhWWkY4dzhzcDciLCJtYWMiOiJjZjI5MTc2MzE0NWNmZjIzZTY3NTA3ODlmYmJkN2FhODhmZDA0NjBmMzVlMjgyNzY0ODUzMDNhMDg0OTliZjUyIiwidGFnIjoiIn0%3D"],"accept-language":["vi,vi-VN;q=0.9,fr-FR;q=0.8,fr;q=0.7,en-US;q=0.6,en;q=0.5,zh-CN;q=0.4,zh;q=0.3"],"accept-encoding":["gzip, deflate, br, zstd"],"referer":["https:\/\/daicatloc.nhathuocdaicatloc.vn\/tp-admin\/articles\/create"],"sec-fetch-dest":["document"],"sec-fetch-user":["?1"],"sec-fetch-mode":["navigate"],"sec-fetch-site":["same-origin"],"accept":["text\/html,application\/xhtml+xml,application\/xml;q=0.9,image\/avif,image\/webp,image\/apng,*\/*;q=0.8,application\/signed-exchange;v=b3;q=0.7"],"user-agent":["Mozilla\/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit\/537.36 (KHTML, like Gecko) Chrome\/124.0.0.0 Safari\/537.36"],"content-type":["multipart\/form-data; boundary=----WebKitFormBoundaryMvGZrPTd2NlaiwDn"],"origin":["https:\/\/daicatloc.nhathuocdaicatloc.vn"],"upgrade-insecure-requests":["1"],"sec-ch-ua-platform":["\"Windows\""],"sec-ch-ua-mobile":["?0"],"sec-ch-ua":["\"Chromium\";v=\"124\", \"Google Chrome\";v=\"124\", \"Not-A.Brand\";v=\"99\""],"cache-control":["max-age=0"],"content-length":["15840"]},"controller":"App\\Http\\Controllers\\article\\backend\\ArticleController@store","getData":[],"postData":{"_token":"3dXcG22zsYAT4sekAwWelCgvPO3iihisVKcXUosi","title":"Viêm bờ trên mi mắt là gì? Nguyên nhân, triệu chứng và cách điều trị","slug":"viem-bo-tren-mi-mat-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri","description":"<p>Viêm bờ trên mi mắt là tình trạng viêm ở bờ trên của mép mí mắt. Chẩn đoán viêm bờ trên mi mắt là một chẩn đoán lâm sàng dựa trên sự kích ứng ở mép trên mi mắt, sưng kèm với vảy và bong tróc của lông mi.<\/p>\r\n","content":"<h2><strong>Tìm hiểu chung<\/strong><\/h2>\r\n\r\n<h3><strong>Viêm bờ trên mi mắt là gì?<\/strong><\/h3>\r\n\r\n<p>Viêm bờ trên mi mắt nghĩa là viêm ở bờ của mi mắt trên (phần tiếp xúc của lông mi và mí mắt trên). Cạnh của mí mắt chuyển sang màu đỏ hoặc sẫm màu, sưng lên và có vảy. Viêm bờ trên mi mắt thường ảnh hưởng đến cả hai mắt. Thường xảy ra khi tình trạng da vùng mắt bị kích ứng, khi bị nhiễm trùng hoặc khi tuyến dầu ở mi mắt bị tắc, hoặc tất cả các yếu tố trên xảy ra cùng một lúc.<\/p>\r\n\r\n<p>Viêm bờ trên mi mắt có thể cấp tính hoặc mạn tính, trong đó, viêm bờ mi mạn tính là dạng phổ biến hơn. Viêm bờ trên mi mắt cũng có thể phân bố theo vị trí, phía trước hoặc phía sau của mí mắt. Viêm bờ trên mi mắt thường xuất hiện với các triệu chứng tái phát có thể thay đổi theo thời gian. Việc điều trị chủ yếu bao gồm vệ sinh tốt và loại bỏ các tác nhân làm trầm trọng thêm triệu chứng của viêm bờ mi. Mục tiêu điều trị là làm giảm triệu chứng, và quan trọng hơn hết, hầu hết viêm bờ trên mi mắt là mạn tính và người bệnh cần duy trì chế độ vệ sinh tốt để ngăn ngừa tái phát.<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2><strong>Triệu chứng<\/strong><\/h2>\r\n\r\n<h3><strong>Những dấu hiệu và triệu chứng của viêm bờ trên mi mắt<\/strong><\/h3>\r\n\r\n<p>Một số dấu hiệu và triệu chứng của viêm bờ trên mí mắt bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Sưng mí mắt và\/hoặc mí mắt nhờn.<\/li>\r\n\t<li>Mắt đỏ, khó chịu, ngứa hoặc rát ở mắt.<\/li>\r\n\t<li>Bong tróc lông mi, có thể khiến mí mắt dính vào nhau.<\/li>\r\n\t<li>Các vảy da tích tụ xung quanh mắt và mí mắt.<\/li>\r\n\t<li>Khô mắt hoặc chảy nước mắt quá nhiều.<\/li>\r\n\t<li>Mắt bị chớp liên tục.<\/li>\r\n<\/ul>\r\n\r\n<p>Các dấu hiệu khác có thể có như:<\/p>\r\n\r\n<ul>\r\n\t<li>Sợ ánh sáng (nhạy cảm ánh sáng);<\/li>\r\n\t<li>Nhìn mờ;<\/li>\r\n\t<li>Mất lông mi;<\/li>\r\n\t<li>Lông mi mọc ngược (hướng vào trong mắt).<\/li>\r\n<\/ul>\r\n\r\n<p style=\"text-align: center;\">&nbsp;<\/p>\r\n\r\n<p style=\"text-align: center;\"><i>Viêm bờ trên mi mắt có thể có các triệu chứng như đỏ hoặc khó chịu ở mắt<\/i><\/p>\r\n\r\n<h3><strong>Biến chứng có thể gặp khi mắc bệnh viêm bờ trên mi mắt<\/strong><\/h3>\r\n\r\n<p>Các biến chứng có thể gặp khi mắc viêm bờ trên mí mắt bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li><strong>Lẹo: <\/strong>Vết sưng, đỏ, đau trên mí mắt do tuyến dầu bị tắc.<\/li>\r\n\t<li><strong>Chắp: <\/strong>Chắp là một khối cứng, không đau trên mí mắt do tuyến dầu bị tắc. Thông thường, chắp là tình trạng xảy ra khi lẹo không khỏi.<\/li>\r\n\t<li><strong>Khô mắt:<\/strong> Dầu và vảy có thể tích tụ và có thể khiến mắt bạn cảm thấy khô.<\/li>\r\n\t<li><strong>Tổn thương giác mạc: <\/strong>Trong trường hợp nghiêm trọng, viêm bờ mi có thể làm tổn thương giác mạc của bạn, xảy ra do sưng hoặc kích ứng ở mí mắt hoặc do lông mi mọc sai hướng.<\/li>\r\n<\/ul>\r\n\r\n<h3><strong>Khi nào cần gặp bác sĩ?<\/strong><\/h3>\r\n\r\n<p>Mặc dù hiếm khi đe dọa thị lực, nhưng viêm bờ trên mi mắt có thể dẫn đến sẹo mí mắt, chảy nước mắt, hình thành chắp lẹo và viêm kết mạc mãn tính. Sự phát triển của viêm giác mạc và loét giác mạc có thể dẫn đến mất thị lực. Do đó, mặc dù không phải tình trạng nguy hiểm, nhưng bạn nên đến gặp bác sĩ để được hướng dẫn cách chăm sóc mắt nếu có các triệu chứng của viêm bờ trên mi mắt.<\/p>\r\n\r\n<h2><strong>Nguyên nhân<\/strong><\/h2>\r\n\r\n<h3><strong>Nguyên nhân dẫn đến viêm bờ trên mi mắt<\/strong><\/h3>\r\n\r\n<p>Nguyên nhân dẫn đến viêm bờ trên mi mắt khác nhau tùy thuộc vào đó là quá trình cấp tính hay mãn tính, và phụ thuộc vào vị trí ở phía trước hay phía sau mí mắt. Các nguyên nhân gây viêm bờ trên mi mắt cấp tính thường do nhiễm trùng, có thể do vi khuẩn (thường là tụ cầu trùng) hoặc di virus như Herpes simplex hay Varicella zoster.<\/p>\r\n\r\n<p>Bên cạnh đó, nguyên nhân gây viêm bờ trên mi mắt phía trước thường bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li><strong>Trứng cá đỏ: <\/strong>Trứng cá đỏ gây viêm da vùng mặt, có thể bao gồm cả mí mắt trên.<\/li>\r\n\t<li><strong>Dị ứng: <\/strong>Dị ứng với dung dịch kính áp tròng, thuốc nhỏ mắt hoặc trang điểm có thể gây kích ứng.<\/li>\r\n\t<li><strong>Gàu: <\/strong>Viêm da dầu tiết bã, gàu có thể gây kích ứng mí mắt và gây viêm.<\/li>\r\n\t<li><strong>Khô mắt: <\/strong>Tình trạng khô mắt có thể làm thay đổi kháng khuẩn, dẫn đến nhiễm trùng.<\/li>\r\n\t<li><strong>Chấy hoặc ve: <\/strong>Chấy hoặc ve Demodex có thể chặn các nang và tuyến tại mi mắt.<\/li>\r\n<\/ul>\r\n\r\n<p>Nguyên nhân dẫn đến viêm bờ mi sau bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Rối loạn chức năng tuyến Meibomian;<\/li>\r\n\t<li>Trứng cá đỏ;<\/li>\r\n\t<li>Gàu.<\/li>\r\n<\/ul>\r\n\r\n<p style=\"text-align: center;\">&nbsp;<\/p>\r\n\r\n<p style=\"text-align: center;\"><i>Viêm bờ trên mi mắt cấp tính có thể do nhiễm vi khuẩn như tụ cầu trùng<\/i><\/p>\r\n\r\n<h2><strong>Nguy cơ<\/strong><\/h2>\r\n\r\n<h3><strong>Những ai có nguy cơ mắc phải viêm bờ trên mi mắt?<\/strong><\/h3>\r\n\r\n<p>Viêm bờ trên mi mắt thường ảnh hưởng đến người lớn và trẻ em ở cả hai giới như nhau. Tuy nhiên, có một dạng viêm bờ mi, đó là viêm bờ mi do tụ cầu sẽ chủ yếu ảnh hưởng đến phụ nữ, chiếm đến khoảng 80% trường hợp.<\/p>\r\n\r\n<h3><strong>Yếu tố làm tăng nguy cơ mắc phải viêm bờ trên mi mắt<\/strong><\/h3>\r\n\r\n<p>Các yếu tố nguy cơ có thể làm tăng khả năng mắc viêm bờ trên mi mắt bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Đái tháo đường;<\/li>\r\n\t<li>Đeo kính áp tròng;<\/li>\r\n\t<li>Tiếp xúc với các chất kích thích như bụi và hóa chất;<\/li>\r\n\t<li>Làm việc hoặc sống ở môi trường khô ráo, bao gồm cả việc dành nhiều thời gian ngồi điều hoà (máy lạnh);<\/li>\r\n\t<li>Lượng vi khuẩn trên da nhiều;<\/li>\r\n\t<li>Không tẩy trang kỹ;<\/li>\r\n\t<li>Da dầu;<\/li>\r\n\t<li>Đang sử dụng một số loại thuốc như thuốc điều trị ung thư;<\/li>\r\n\t<li>Tiền mãn kinh, mãn kinh hoặc thay đổi nội tiết tố.<\/li>\r\n<\/ul>\r\n\r\n<p style=\"text-align: center;\">&nbsp;<\/p>\r\n\r\n<p style=\"text-align: center;\"><i>Mang kính áp tròng là một trong những yếu tố nguy cơ của viêm bờ trên mi mắt<\/i><\/p>\r\n\r\n<h2><strong>Phương Pháp Chẩn Đoán &amp; Điều Trị<\/strong><\/h2>\r\n\r\n<h3><strong>Phương pháp chẩn đoán và xét nghiệm viêm bờ trên mi mắt<\/strong><\/h3>\r\n\r\n<p>Chẩn đoán viêm bờ trên mi mắt là một chẩn đoán dựa trên lâm sàng, không có xét nghiệm cụ thể, đặc hiệu cho viêm bờ trên mi mắt. Bác sĩ có thể thực hiện các bước sau để chẩn đoán viêm bờ trên mi mắt, bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li><strong>Khai thác bệnh sử: <\/strong>Bao gồm hỏi về triệu chứng, tình trạng sức khỏe cũng như xác định các yếu tố nguy cơ của bạn.<\/li>\r\n\t<li><strong>Khám mí mắt: <\/strong>Xác định tình trạng sưng, đỏ hay có mủ ở mí mắt, giúp đánh giá mức độ nghiêm trọng của bệnh.<\/li>\r\n\t<li><strong>Lấy mẫu dịch tiết: <\/strong>Nhằm xét nghiệm vi khuẩn.<\/li>\r\n\t<li><strong>Khác: <\/strong>Bác sĩ có thể cho làm xét nghiệm nước mắt, kiểm tra lông mi hoặc thực hiện sinh thiết mí mắt nếu có nghi ngờ ung thư da.<\/li>\r\n<\/ul>\r\n\r\n<h3><strong>Điều trị viêm bờ trên mi mắt<\/strong><\/h3>\r\n\r\n<p>Viêm bờ trên mi mắt có thể được điều trị bằng cách tự chăm sóc tại nhà, phần này sẽ được đề cập ở chế độ sinh hoạt bên dưới.<\/p>\r\n\r\n<p>Ngoài ra, bác sĩ có thể kê đơn thuốc điều trị viêm bờ trên mi mắt của bạn, tuỳ thuộc vào nguyên nhân và mức độ nghiêm trọng của triệu chứng. Các điều trị có thể bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li><strong>Thuốc kháng sinh: <\/strong>Các loại thuốc mỡ kháng sinh có thể được kê đơn như erythromycin, bacitracin hoặc thuốc nhỏ mắt kháng sinh có thể giúp điều trị các tình trạng nhiễm trùng do vi khuẩn. Trong một số trường hợp, bác sĩ có thể kê đơn kháng sinh uống, chẳng hạn như doxycycline hoặc azithromycin.<\/li>\r\n\t<li><strong>Thuốc kháng viêm: <\/strong>Các loại thuốc nhỏ mắt hoặc kem chứa steroid có thể được sử dụng để giúp giảm viêm.<\/li>\r\n\t<li><strong>Thuốc điều hoà miễn dịch: <\/strong>Trong một số trường, hợp, bác sĩ sẽ bổ sung thêm một loại thuốc điều hòa miễn dịch, như thuốc nhỏ mắt cyclosporine được chứng minh có hiệu quả trong viêm bờ mi phía sau.<\/li>\r\n<\/ul>\r\n\r\n<p style=\"text-align: center;\">&nbsp;<\/p>\r\n\r\n<p style=\"text-align: center;\"><i>Bác sĩ có thể các loại thuốc nhỏ mắt có chứa kháng sinh, kháng viêm để giúp điều trị triệu chứng của viêm bờ trên mi mắt<\/i><\/p>\r\n\r\n<h2><strong>Chế Độ Sinh Hoạt &amp; Phòng Ngừa<\/strong><\/h2>\r\n\r\n<h3><strong>Những thói quen sinh hoạt giúp hạn chế diễn tiến của viêm bờ trên mi mắt<\/strong><\/h3>\r\n\r\n<p><i>Chế độ sinh hoạt:<\/i><\/p>\r\n\r\n<p>Bạn có thể hạn chế diễn tiến của viêm bờ trên mi mắt bằng các cách vệ sinh mi mắt bị viêm như sau:<\/p>\r\n\r\n<ul>\r\n\t<li>Rửa tay với xà phòng và nước.<\/li>\r\n\t<li>Trộn nước ấm với loại nước rửa nhẹ nhàng, ví dụ như dầu gội cho trẻ em.<\/li>\r\n\t<li>Nhúng một miếng vải sạch, mềm hoặc tăm bông vào hỗn hợp.<\/li>\r\n\t<li>Đắp miếng vải vào mắt (nhắm mắt trước khi đắp) trong vài phút để làm bong lớp vỏ. Điều này cũng giúp cho tuyến dầu không bị tắc nghẽn.<\/li>\r\n\t<li>Chà xát nhẹ nhàng miếng vải hoặc tăm bông qua lại, tại bờ mi (vị trí lông mi tiếp xúc với mí mắt).<\/li>\r\n\t<li>Rửa mắt lại bằng nước sạch.<\/li>\r\n\t<li>Lặp lại các bước này trên mắt còn lại với miếng vải hoặc tăm bông mới.<\/li>\r\n<\/ul>\r\n\r\n<p><i>Chế độ dinh dưỡng:<\/i><\/p>\r\n\r\n<p>Một số nghiên cứu đã phát hiện ra rằng, việc bổ sung omega-3 (có trong cá hoặc dầu hạt lanh) có thể giúp các tuyến ở mắt hoạt động tốt hơn. Ăn các loại rau lá xanh và tránh các thực phẩm giàu chất béo cũng có thể hữu ích.<\/p>\r\n\r\n<h3><strong>Phòng ngừa viêm bờ trên mi mắt<\/strong><\/h3>\r\n\r\n<p>Để ngăn ngừa cũng như hạn chế diễn tiến của viêm bờ trên mi mắt, bạn nên làm sạch mí mắt của mình 2 lần\/ngày (nếu có triệu chứng), và chuyển sang mỗi ngày một lần khi các triệu chứng đã cải thiện. Tiếp tục làm sạch theo hướng dẫn ở phần thói quen sinh hoạt, dù cho đã không còn triệu chứng.<\/p>\r\n\r\n<p>Bạn không nên đeo kính áp tròng, đặc biệt khi đang có các triệu chứng của viêm bờ trên mi mắt. Không trang điểm ở phần mắt, đặc biệt là chải mascara khi bạn có các triệu chứng của viêm mi mắt.<\/p>\r\n\r\n<p>Bên cạnh đó, một số việc bạn có thể làm để ngăn ngừa viêm bờ trên mi mắt bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Giữ tay, mặt và da đầu sạch sẽ.<\/li>\r\n\t<li>Không dùng tay chạm vào mắt hay mặt của bạn, sử dụng khăn giấy sạch nếu bạn muốn chạm vào mặt.<\/li>\r\n\t<li>Tẩy trang sạch mỗi ngày trước khi đi ngủ.<\/li>\r\n\t<li>Sử dụng nước mắt nhân tạo dưới hướng dẫn của bác sĩ nếu bạn bị khô mắt.<\/li>\r\n<\/ul>\r\n\r\n<h3><strong>Các câu hỏi thường gặp về viêm bờ trên mi mắt<\/strong><\/h3>\r\n\r\n<p><strong>Vệ sinh kém có thể gây viêm bờ trên mi mắt không?<\/strong><\/p>\r\n\r\n<p>Đó có thể là một yếu tố gây viêm bờ trên mi mắt nếu bạn vệ sinh kém. Tuy nhiên, không thể nói những người vệ sinh kém mới bị viêm bờ trên mi mắt, hay những người bị viêm bờ trên mi mắt là người vệ sinh kém. Đây chỉ là một yếu tố nguy cơ, về phần nguyên nhân, có nhiều nguyên nhân khác nhau có thể gây viêm bờ trên mi mắt. Tuy nhiên, hãy vệ sinh mắt của bạn theo hướng dẫn đến có thể ngăn ngừa cũng như hạn chế diễn tiến của viêm bờ trên mi mắt.<\/p>\r\n\r\n<p><strong>Tôi có được trang điểm nếu bị viêm bờ trên mi mắt không?<\/strong><\/p>\r\n\r\n<p>Câu trả lời là không, vì có thể việc kích ứng do trang điểm có thể là nguyên nhân, hoặc làm nặng thêm tình trạng viêm bờ trên mi mắt của bạn. Đặc biệt không nên sử dụng kính áp tròng hay mascara khi bạn đang bị viêm bờ trên mi mắt.<\/p>\r\n\r\n<p><strong>Viêm bờ trên mi mắt có nguy hiểm không?<\/strong><\/p>\r\n\r\n<p>Viêm bờ trên mi mắt thông thường không phải là một tình trạng nguy hiểm và hiếm khi gây đe dọa thị lực. Tuy nhiên, viêm bờ trên mi mắt có thể dẫn đến các biến chứng liên quan, ví dụ như viêm loét giác mạc. Sự phát triển của viêm loét giác mạc có thể dẫn đến mất thị lực.<\/p>\r\n","meta_title":"","meta_description":"","catalogue_id":"37","image_old":"","publish":"0"},"requestData":null,"sessionData":{"_token":"3dXcG22zsYAT4sekAwWelCgvPO3iihisVKcXUosi","login_web_59ba36addc2b2f9401580f014c7f58ea4e30989d":7,"_previous":{"__type__":"array","url":"https:\/\/daicatloc.nhathuocdaicatloc.vn\/tp-admin\/addresses\/create"},"_flash":{"__type__":"array","old":{"__type__":"array","0":"success"},"new":{"__type__":"array"}},"success":"Thêm mới bài viết thành công"},"authenticatedUser":{"id":7,"username":"admin@gmail.com","email":"admin@gmail.com","name":"ADMIN TP"},"cookies":{"authImagesManager":"{\"domain\":null,\"email\":\"admin@gmail.com\",\"permission\":[\"all\",\"upload\",\"delete\",\"rename\",\"create_dirs\",\"delete_dirs\",\"rename_dirs\"],\"folder_upload\":\"all\"}","remember_web_59ba36addc2b2f9401580f014c7f58ea4e30989d":"eyJpdiI6IjNkL0tZUVVWZnczQ0JObTl6TUJKblE9PSIsInZhbHVlIjoiRjNUaGw0cWhJSG9OaFRvUUhaK1dKSlZDOVc0YmlSRVRRZU5GS2N2c3k1TFovN2pJbXVPeXUzT1EwOTNmWnhiUzhsZ3YxYUdGcUVENXpKUU5CbUQ3Vi9KMTR0cUl1SXl6cnBEM2lQTngreDJIbm50TmEvQnBsb253bmZHUWdkQVVpK3oxK3F1aUtNOExOSTVXYW5ZM2NWZHNVMjVWSm1LZjRJVnVVNGFBOFRKVzlCclhycE9kWFpxTGg5dWMwZ1kwOE5UUFlWTjRtSjV4NGxuVjduSFI3anAwME5XNVFua0hFeXhRV2FYTlArOD0iLCJtYWMiOiI1ZTc0YTY3NmZkYzE3ZTg1N2Q2N2RjOWE2MDViODcyOTRlMDJkMDhiMWU1MjJkYmEyYWE0MDFhOTJmYTU2ZWMzIiwidGFnIjoiIn0=","wishlist":"[\"3\"]","ckCsrfToken":"v0soLKq775dVl4RQNjVLdsz3qMcfE7BY94G1Bb3Q","XSRF-TOKEN":"eyJpdiI6IngrREg3TTVRZGt4eTE1TW1ZS0l1UVE9PSIsInZhbHVlIjoiZmF0OUF6TStxeVVsVEJCaVZmbUpuU2xoa0lCNzFyNGU0bCtEZ3NZdDd6Tkt4Vm5pdnZ0UzgvSW9OcFh1cCtiSWlta3JRRHM4UUJhY0JNdXVEMDZia3l1L3pVM3M0K1pmK1FkMTFXNjR3bjJXekorUXlvdHN0OUxxTE0wamkvUFciLCJtYWMiOiIxODYzZjljMGQ5YjY5ODA0NzM2NTgzMzlkOWMwNWM0MjI1MjNkYjA1ODI5MGQyZWU4OWY0N2U3YWVlNTQ5ODM5IiwidGFnIjoiIn0=","daicatloc_session":"eyJpdiI6IjFPQWNlWUtYc1FOSXRTZUUyMXV6V3c9PSIsInZhbHVlIjoiVnhFU2FSM1dWS2VBOUI4UDVER0VWNHhEYk1DL1ZYSk1QSjVKbTR2MzAvUERvZjdpT1FRU2dpZmFNZXh2M3hKU1VBbFFrN2JEYzRFejFQbTZoVWZNbXBHV3JxdUtDUitkaGpIeUV0VHN4TG54R1Fxb1llNC9EeGhWWkY4dzhzcDciLCJtYWMiOiJjZjI5MTc2MzE0NWNmZjIzZTY3NTA3ODlmYmJkN2FhODhmZDA0NjBmMzVlMjgyNzY0ODUzMDNhMDg0OTliZjUyIiwidGFnIjoiIn0="},"responseTime":1716369318.054497,"responseStatus":302,"responseDuration":342.6859378814697,"memoryUsage":25165824,"middleware":["web","locale","auth:web"],"databaseQueries":[{"query":"SELECT * FROM `users` WHERE `id` = 7 LIMIT 1","duration":0.53,"connection":"mysql","time":1716369317.981883,"trace":[{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/fruitcake\/laravel-cors\/src\/HandleCors.php","line":38,"isVendor":true},{"call":"Fruitcake\\Cors\\HandleCors->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Http\/Middleware\/TrustProxies.php","line":39,"isVendor":true},{"call":"Illuminate\\Http\\Middleware\\TrustProxies->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/itsgoingd\/clockwork\/Clockwork\/Support\/Laravel\/ClockworkMiddleware.php","line":24,"isVendor":true},{"call":"Clockwork\\Support\\Laravel\\ClockworkMiddleware->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":103,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->then()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Http\/Kernel.php","line":142,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->sendRequestThroughRouter()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Http\/Kernel.php","line":111,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/public\/index.php","line":51,"isVendor":false}],"model":"App\\Models\\User","tags":[]},{"query":"SELECT count(*) as aggregate FROM `router` WHERE `slug` = 'viem-bo-tren-mi-mat-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri' and (`alanguage` = 'vi')","duration":0.57,"connection":"mysql","time":1716369317.995313,"trace":[{"call":"Illuminate\\Http\\Request->__call()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":98,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Middleware\/SubstituteBindings.php","line":50,"isVendor":true}],"model":null,"tags":[]},{"query":"SELECT `id`, `title`, `slug`, `lft` FROM `category_articles` WHERE `id` = '37' LIMIT 1","duration":1.81,"connection":"mysql","time":1716369317.996923,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Builder->first()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":193,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":"App\\Models\\CategoryArticle","tags":[]},{"query":"SELECT `id`, `title` FROM `category_articles` WHERE `alanguage` = 'vi' and `lft` <= 13 and `rgt` >= 13 ORDER BY `lft` ASC, `order` ASC","duration":0.48,"connection":"mysql","time":1716369317.999314,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Builder->get()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":194,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":"App\\Models\\CategoryArticle","tags":[]},{"query":"INSERT INTO `articles` (`title`, `slug`, `catalogue_id`, `image`, `description`, `content`, `catalogue`, `products`, `meta_title`, `meta_description`, `publish`, `userid_created`, `created_at`, `alanguage`) VALUES ('Viêm bờ trên mi mắt là gì? Nguyên nhân, triệu chứng và cách điều trị', 'viem-bo-tren-mi-mat-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri', '37', , '<p>Viêm bờ trên mi mắt là tình trạng viêm ở bờ trên của mép mí mắt. Chẩn đoán viêm bờ trên mi mắt là một chẩn đoán lâm sàng dựa trên sự kích ứng ở mép trên mi mắt, sưng kèm với vảy và bong tróc của lông mi.<\/p>', '<h2><strong>Tìm hiểu chung<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Viêm bờ trên mi mắt là gì?<\/strong><\/h3>\\r\\n\\r\\n<p>Viêm bờ trên mi mắt nghĩa là viêm ở bờ của mi mắt trên (phần tiếp xúc của lông mi và mí mắt trên). Cạnh của mí mắt chuyển sang màu đỏ hoặc sẫm màu, sưng lên và có vảy. Viêm bờ trên mi mắt thường ảnh hưởng đến cả hai mắt. Thường xảy ra khi tình trạng da vùng mắt bị kích ứng, khi bị nhiễm trùng hoặc khi tuyến dầu ở mi mắt bị tắc, hoặc tất cả các yếu tố trên xảy ra cùng một lúc.<\/p>\\r\\n\\r\\n<p>Viêm bờ trên mi mắt có thể cấp tính hoặc mạn tính, trong đó, viêm bờ mi mạn tính là dạng phổ biến hơn. Viêm bờ trên mi mắt cũng có thể phân bố theo vị trí, phía trước hoặc phía sau của mí mắt. Viêm bờ trên mi mắt thường xuất hiện với các triệu chứng tái phát có thể thay đổi theo thời gian. Việc điều trị chủ yếu bao gồm vệ sinh tốt và loại bỏ các tác nhân làm trầm trọng thêm triệu chứng của viêm bờ mi. Mục tiêu điều trị là làm giảm triệu chứng, và quan trọng hơn hết, hầu hết viêm bờ trên mi mắt là mạn tính và người bệnh cần duy trì chế độ vệ sinh tốt để ngăn ngừa tái phát.<\/p>\\r\\n\\r\\n<p>&nbsp;<\/p>\\r\\n\\r\\n<h2><strong>Triệu chứng<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Những dấu hiệu và triệu chứng của viêm bờ trên mi mắt<\/strong><\/h3>\\r\\n\\r\\n<p>Một số dấu hiệu và triệu chứng của viêm bờ trên mí mắt bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Sưng mí mắt và\/hoặc mí mắt nhờn.<\/li>\\r\\n\t<li>Mắt đỏ, khó chịu, ngứa hoặc rát ở mắt.<\/li>\\r\\n\t<li>Bong tróc lông mi, có thể khiến mí mắt dính vào nhau.<\/li>\\r\\n\t<li>Các vảy da tích tụ xung quanh mắt và mí mắt.<\/li>\\r\\n\t<li>Khô mắt hoặc chảy nước mắt quá nhiều.<\/li>\\r\\n\t<li>Mắt bị chớp liên tục.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p>Các dấu hiệu khác có thể có như:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Sợ ánh sáng (nhạy cảm ánh sáng);<\/li>\\r\\n\t<li>Nhìn mờ;<\/li>\\r\\n\t<li>Mất lông mi;<\/li>\\r\\n\t<li>Lông mi mọc ngược (hướng vào trong mắt).<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\">&nbsp;<\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><i>Viêm bờ trên mi mắt có thể có các triệu chứng như đỏ hoặc khó chịu ở mắt<\/i><\/p>\\r\\n\\r\\n<h3><strong>Biến chứng có thể gặp khi mắc bệnh viêm bờ trên mi mắt<\/strong><\/h3>\\r\\n\\r\\n<p>Các biến chứng có thể gặp khi mắc viêm bờ trên mí mắt bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li><strong>Lẹo: <\/strong>Vết sưng, đỏ, đau trên mí mắt do tuyến dầu bị tắc.<\/li>\\r\\n\t<li><strong>Chắp: <\/strong>Chắp là một khối cứng, không đau trên mí mắt do tuyến dầu bị tắc. Thông thường, chắp là tình trạng xảy ra khi lẹo không khỏi.<\/li>\\r\\n\t<li><strong>Khô mắt:<\/strong> Dầu và vảy có thể tích tụ và có thể khiến mắt bạn cảm thấy khô.<\/li>\\r\\n\t<li><strong>Tổn thương giác mạc: <\/strong>Trong trường hợp nghiêm trọng, viêm bờ mi có thể làm tổn thương giác mạc của bạn, xảy ra do sưng hoặc kích ứng ở mí mắt hoặc do lông mi mọc sai hướng.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<h3><strong>Khi nào cần gặp bác sĩ?<\/strong><\/h3>\\r\\n\\r\\n<p>Mặc dù hiếm khi đe dọa thị lực, nhưng viêm bờ trên mi mắt có thể dẫn đến sẹo mí mắt, chảy nước mắt, hình thành chắp lẹo và viêm kết mạc mãn tính. Sự phát triển của viêm giác mạc và loét giác mạc có thể dẫn đến mất thị lực. Do đó, mặc dù không phải tình trạng nguy hiểm, nhưng bạn nên đến gặp bác sĩ để được hướng dẫn cách chăm sóc mắt nếu có các triệu chứng của viêm bờ trên mi mắt.<\/p>\\r\\n\\r\\n<h2><strong>Nguyên nhân<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Nguyên nhân dẫn đến viêm bờ trên mi mắt<\/strong><\/h3>\\r\\n\\r\\n<p>Nguyên nhân dẫn đến viêm bờ trên mi mắt khác nhau tùy thuộc vào đó là quá trình cấp tính hay mãn tính, và phụ thuộc vào vị trí ở phía trước hay phía sau mí mắt. Các nguyên nhân gây viêm bờ trên mi mắt cấp tính thường do nhiễm trùng, có thể do vi khuẩn (thường là tụ cầu trùng) hoặc di virus như Herpes simplex hay Varicella zoster.<\/p>\\r\\n\\r\\n<p>Bên cạnh đó, nguyên nhân gây viêm bờ trên mi mắt phía trước thường bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li><strong>Trứng cá đỏ: <\/strong>Trứng cá đỏ gây viêm da vùng mặt, có thể bao gồm cả mí mắt trên.<\/li>\\r\\n\t<li><strong>Dị ứng: <\/strong>Dị ứng với dung dịch kính áp tròng, thuốc nhỏ mắt hoặc trang điểm có thể gây kích ứng.<\/li>\\r\\n\t<li><strong>Gàu: <\/strong>Viêm da dầu tiết bã, gàu có thể gây kích ứng mí mắt và gây viêm.<\/li>\\r\\n\t<li><strong>Khô mắt: <\/strong>Tình trạng khô mắt có thể làm thay đổi kháng khuẩn, dẫn đến nhiễm trùng.<\/li>\\r\\n\t<li><strong>Chấy hoặc ve: <\/strong>Chấy hoặc ve Demodex có thể chặn các nang và tuyến tại mi mắt.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p>Nguyên nhân dẫn đến viêm bờ mi sau bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Rối loạn chức năng tuyến Meibomian;<\/li>\\r\\n\t<li>Trứng cá đỏ;<\/li>\\r\\n\t<li>Gàu.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\">&nbsp;<\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><i>Viêm bờ trên mi mắt cấp tính có thể do nhiễm vi khuẩn như tụ cầu trùng<\/i><\/p>\\r\\n\\r\\n<h2><strong>Nguy cơ<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Những ai có nguy cơ mắc phải viêm bờ trên mi mắt?<\/strong><\/h3>\\r\\n\\r\\n<p>Viêm bờ trên mi mắt thường ảnh hưởng đến người lớn và trẻ em ở cả hai giới như nhau. Tuy nhiên, có một dạng viêm bờ mi, đó là viêm bờ mi do tụ cầu sẽ chủ yếu ảnh hưởng đến phụ nữ, chiếm đến khoảng 80% trường hợp.<\/p>\\r\\n\\r\\n<h3><strong>Yếu tố làm tăng nguy cơ mắc phải viêm bờ trên mi mắt<\/strong><\/h3>\\r\\n\\r\\n<p>Các yếu tố nguy cơ có thể làm tăng khả năng mắc viêm bờ trên mi mắt bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Đái tháo đường;<\/li>\\r\\n\t<li>Đeo kính áp tròng;<\/li>\\r\\n\t<li>Tiếp xúc với các chất kích thích như bụi và hóa chất;<\/li>\\r\\n\t<li>Làm việc hoặc sống ở môi trường khô ráo, bao gồm cả việc dành nhiều thời gian ngồi điều hoà (máy lạnh);<\/li>\\r\\n\t<li>Lượng vi khuẩn trên da nhiều;<\/li>\\r\\n\t<li>Không tẩy trang kỹ;<\/li>\\r\\n\t<li>Da dầu;<\/li>\\r\\n\t<li>Đang sử dụng một số loại thuốc như thuốc điều trị ung thư;<\/li>\\r\\n\t<li>Tiền mãn kinh, mãn kinh hoặc thay đổi nội tiết tố.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\">&nbsp;<\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><i>Mang kính áp tròng là một trong những yếu tố nguy cơ của viêm bờ trên mi mắt<\/i><\/p>\\r\\n\\r\\n<h2><strong>Phương Pháp Chẩn Đoán &amp; Điều Trị<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Phương pháp chẩn đoán và xét nghiệm viêm bờ trên mi mắt<\/strong><\/h3>\\r\\n\\r\\n<p>Chẩn đoán viêm bờ trên mi mắt là một chẩn đoán dựa trên lâm sàng, không có xét nghiệm cụ thể, đặc hiệu cho viêm bờ trên mi mắt. Bác sĩ có thể thực hiện các bước sau để chẩn đoán viêm bờ trên mi mắt, bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li><strong>Khai thác bệnh sử: <\/strong>Bao gồm hỏi về triệu chứng, tình trạng sức khỏe cũng như xác định các yếu tố nguy cơ của bạn.<\/li>\\r\\n\t<li><strong>Khám mí mắt: <\/strong>Xác định tình trạng sưng, đỏ hay có mủ ở mí mắt, giúp đánh giá mức độ nghiêm trọng của bệnh.<\/li>\\r\\n\t<li><strong>Lấy mẫu dịch tiết: <\/strong>Nhằm xét nghiệm vi khuẩn.<\/li>\\r\\n\t<li><strong>Khác: <\/strong>Bác sĩ có thể cho làm xét nghiệm nước mắt, kiểm tra lông mi hoặc thực hiện sinh thiết mí mắt nếu có nghi ngờ ung thư da.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<h3><strong>Điều trị viêm bờ trên mi mắt<\/strong><\/h3>\\r\\n\\r\\n<p>Viêm bờ trên mi mắt có thể được điều trị bằng cách tự chăm sóc tại nhà, phần này sẽ được đề cập ở chế độ sinh hoạt bên dưới.<\/p>\\r\\n\\r\\n<p>Ngoài ra, bác sĩ có thể kê đơn thuốc điều trị viêm bờ trên mi mắt của bạn, tuỳ thuộc vào nguyên nhân và mức độ nghiêm trọng của triệu chứng. Các điều trị có thể bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li><strong>Thuốc kháng sinh: <\/strong>Các loại thuốc mỡ kháng sinh có thể được kê đơn như erythromycin, bacitracin hoặc thuốc nhỏ mắt kháng sinh có thể giúp điều trị các tình trạng nhiễm trùng do vi khuẩn. Trong một số trường hợp, bác sĩ có thể kê đơn kháng sinh uống, chẳng hạn như doxycycline hoặc azithromycin.<\/li>\\r\\n\t<li><strong>Thuốc kháng viêm: <\/strong>Các loại thuốc nhỏ mắt hoặc kem chứa steroid có thể được sử dụng để giúp giảm viêm.<\/li>\\r\\n\t<li><strong>Thuốc điều hoà miễn dịch: <\/strong>Trong một số trường, hợp, bác sĩ sẽ bổ sung thêm một loại thuốc điều hòa miễn dịch, như thuốc nhỏ mắt cyclosporine được chứng minh có hiệu quả trong viêm bờ mi phía sau.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\">&nbsp;<\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><i>Bác sĩ có thể các loại thuốc nhỏ mắt có chứa kháng sinh, kháng viêm để giúp điều trị triệu chứng của viêm bờ trên mi mắt<\/i><\/p>\\r\\n\\r\\n<h2><strong>Chế Độ Sinh Hoạt &amp; Phòng Ngừa<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Những thói quen sinh hoạt giúp hạn chế diễn tiến của viêm bờ trên mi mắt<\/strong><\/h3>\\r\\n\\r\\n<p><i>Chế độ sinh hoạt:<\/i><\/p>\\r\\n\\r\\n<p>Bạn có thể hạn chế diễn tiến của viêm bờ trên mi mắt bằng các cách vệ sinh mi mắt bị viêm như sau:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Rửa tay với xà phòng và nước.<\/li>\\r\\n\t<li>Trộn nước ấm với loại nước rửa nhẹ nhàng, ví dụ như dầu gội cho trẻ em.<\/li>\\r\\n\t<li>Nhúng một miếng vải sạch, mềm hoặc tăm bông vào hỗn hợp.<\/li>\\r\\n\t<li>Đắp miếng vải vào mắt (nhắm mắt trước khi đắp) trong vài phút để làm bong lớp vỏ. Điều này cũng giúp cho tuyến dầu không bị tắc nghẽn.<\/li>\\r\\n\t<li>Chà xát nhẹ nhàng miếng vải hoặc tăm bông qua lại, tại bờ mi (vị trí lông mi tiếp xúc với mí mắt).<\/li>\\r\\n\t<li>Rửa mắt lại bằng nước sạch.<\/li>\\r\\n\t<li>Lặp lại các bước này trên mắt còn lại với miếng vải hoặc tăm bông mới.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p><i>Chế độ dinh dưỡng:<\/i><\/p>\\r\\n\\r\\n<p>Một số nghiên cứu đã phát hiện ra rằng, việc bổ sung omega-3 (có trong cá hoặc dầu hạt lanh) có thể giúp các tuyến ở mắt hoạt động tốt hơn. Ăn các loại rau lá xanh và tránh các thực phẩm giàu chất béo cũng có thể hữu ích.<\/p>\\r\\n\\r\\n<h3><strong>Phòng ngừa viêm bờ trên mi mắt<\/strong><\/h3>\\r\\n\\r\\n<p>Để ngăn ngừa cũng như hạn chế diễn tiến của viêm bờ trên mi mắt, bạn nên làm sạch mí mắt của mình 2 lần\/ngày (nếu có triệu chứng), và chuyển sang mỗi ngày một lần khi các triệu chứng đã cải thiện. Tiếp tục làm sạch theo hướng dẫn ở phần thói quen sinh hoạt, dù cho đã không còn triệu chứng.<\/p>\\r\\n\\r\\n<p>Bạn không nên đeo kính áp tròng, đặc biệt khi đang có các triệu chứng của viêm bờ trên mi mắt. Không trang điểm ở phần mắt, đặc biệt là chải mascara khi bạn có các triệu chứng của viêm mi mắt.<\/p>\\r\\n\\r\\n<p>Bên cạnh đó, một số việc bạn có thể làm để ngăn ngừa viêm bờ trên mi mắt bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Giữ tay, mặt và da đầu sạch sẽ.<\/li>\\r\\n\t<li>Không dùng tay chạm vào mắt hay mặt của bạn, sử dụng khăn giấy sạch nếu bạn muốn chạm vào mặt.<\/li>\\r\\n\t<li>Tẩy trang sạch mỗi ngày trước khi đi ngủ.<\/li>\\r\\n\t<li>Sử dụng nước mắt nhân tạo dưới hướng dẫn của bác sĩ nếu bạn bị khô mắt.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<h3><strong>Các câu hỏi thường gặp về viêm bờ trên mi mắt<\/strong><\/h3>\\r\\n\\r\\n<p><strong>Vệ sinh kém có thể gây viêm bờ trên mi mắt không?<\/strong><\/p>\\r\\n\\r\\n<p>Đó có thể là một yếu tố gây viêm bờ trên mi mắt nếu bạn vệ sinh kém. Tuy nhiên, không thể nói những người vệ sinh kém mới bị viêm bờ trên mi mắt, hay những người bị viêm bờ trên mi mắt là người vệ sinh kém. Đây chỉ là một yếu tố nguy cơ, về phần nguyên nhân, có nhiều nguyên nhân khác nhau có thể gây viêm bờ trên mi mắt. Tuy nhiên, hãy vệ sinh mắt của bạn theo hướng dẫn đến có thể ngăn ngừa cũng như hạn chế diễn tiến của viêm bờ trên mi mắt.<\/p>\\r\\n\\r\\n<p><strong>Tôi có được trang điểm nếu bị viêm bờ trên mi mắt không?<\/strong><\/p>\\r\\n\\r\\n<p>Câu trả lời là không, vì có thể việc kích ứng do trang điểm có thể là nguyên nhân, hoặc làm nặng thêm tình trạng viêm bờ trên mi mắt của bạn. Đặc biệt không nên sử dụng kính áp tròng hay mascara khi bạn đang bị viêm bờ trên mi mắt.<\/p>\\r\\n\\r\\n<p><strong>Viêm bờ trên mi mắt có nguy hiểm không?<\/strong><\/p>\\r\\n\\r\\n<p>Viêm bờ trên mi mắt thông thường không phải là một tình trạng nguy hiểm và hiếm khi gây đe dọa thị lực. Tuy nhiên, viêm bờ trên mi mắt có thể dẫn đến các biến chứng liên quan, ví dụ như viêm loét giác mạc. Sự phát triển của viêm loét giác mạc có thể dẫn đến mất thị lực.<\/p>', '[37,36]', 'NULL', , , '0', 7, '2024-05-22 16:15:18', 'vi')","duration":28.36,"connection":"mysql","time":1716369318.001584,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Model::__callStatic()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":219,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":"App\\Models\\Article","tags":[]},{"query":"INSERT INTO `catalogues_relationships` (`catalogueid`, `created_at`, `module`, `moduleid`) VALUES (37, '2024-05-22 16:15:18', 'articles', 66), (36, '2024-05-22 16:15:18', 'articles', 66)","duration":11.88,"connection":"mysql","time":1716369318.030621,"trace":[{"call":"Illuminate\\Database\\Query\\Builder->insert()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php","line":31,"isVendor":false},{"call":"App\\Components\\Helper->catalogue_relation_ship()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":237,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false}],"model":null,"tags":[]},{"query":"INSERT INTO `router` (`moduleid`, `module`, `slug`, `created_at`, `alanguage`) VALUES (66, 'articles', 'viem-bo-tren-mi-mat-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri', '2024-05-22 16:15:18', 'vi')","duration":1.22,"connection":"mysql","time":1716369318.042965,"trace":[{"call":"Illuminate\\Database\\Query\\Builder->insert()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":246,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":null,"tags":[]},{"query":"SELECT `keyword`, `type`, `id` FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'articles')","duration":1.74,"connection":"mysql","time":1716369318.0451171,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Builder->get()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/backend_global_helper.php","line":306,"isVendor":false},{"call":"fieldsInsert()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":249,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false}],"model":"App\\Models\\ConfigColum","tags":[]}],"databaseQueriesCount":8,"databaseSlowQueries":0,"databaseSelects":5,"databaseInserts":3,"databaseUpdates":0,"databaseDeletes":0,"databaseOthers":0,"databaseDuration":46.59,"cacheQueries":[],"cacheReads":0,"cacheHits":0,"cacheWrites":0,"cacheDeletes":0,"cacheTime":null,"modelsActions":[],"modelsRetrieved":{"App\\Models\\User":1,"App\\Models\\CategoryArticle":3},"modelsCreated":[],"modelsUpdated":[],"modelsDeleted":[],"redisCommands":[],"queueJobs":[],"timelineData":[{"description":"Controller","start":1716369317.942674,"end":1716369318.054393,"duration":111.71913146972656,"color":null,"data":null}],"log":[{"message":"Optional parameter $request declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 357","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716369317.956958,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]},{"message":"Optional parameter $taxes_type declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 527","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716369317.957328,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]},{"message":"Optional parameter $taxes_import declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 527","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716369317.95751,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]},{"message":"Optional parameter $taxes_export declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 527","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716369317.957699,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]}],"events":[],"routes":[],"notifications":[],"emailsData":[],"viewsData":[],"userData":[],"subrequests":[],"xdebug":[],"commandName":null,"commandArguments":[],"commandArgumentsDefaults":[],"commandOptions":[],"commandOptionsDefaults":[],"commandExitCode":null,"commandOutput":null,"jobName":null,"jobDescription":null,"jobStatus":null,"jobPayload":[],"jobQueue":null,"jobConnection":null,"jobOptions":[],"testName":null,"testStatus":null,"testStatusMessage":null,"testAsserts":[],"clientMetrics":[],"webVitals":[],"parent":null,"updateToken":"66a842bc"}