{"id":"1716433849-9844-28050723","version":1,"type":"request","time":1716433849.854619,"method":"POST","url":"https:\/\/daicatloc.nhathuocdaicatloc.vn\/tp-admin\/articles\/store","uri":"\/tp-admin\/articles\/store","headers":{"host":["daicatloc.nhathuocdaicatloc.vn"],"priority":["u=0, i"],"cookie":["authImagesManager=%7B%22domain%22%3Anull%2C%22email%22%3A%22admin%40gmail.com%22%2C%22permission%22%3A%5B%22all%22%2C%22upload%22%2C%22delete%22%2C%22rename%22%2C%22create_dirs%22%2C%22delete_dirs%22%2C%22rename_dirs%22%5D%2C%22folder_upload%22%3A%22all%22%7D; remember_web_59ba36addc2b2f9401580f014c7f58ea4e30989d=eyJpdiI6IjNkL0tZUVVWZnczQ0JObTl6TUJKblE9PSIsInZhbHVlIjoiRjNUaGw0cWhJSG9OaFRvUUhaK1dKSlZDOVc0YmlSRVRRZU5GS2N2c3k1TFovN2pJbXVPeXUzT1EwOTNmWnhiUzhsZ3YxYUdGcUVENXpKUU5CbUQ3Vi9KMTR0cUl1SXl6cnBEM2lQTngreDJIbm50TmEvQnBsb253bmZHUWdkQVVpK3oxK3F1aUtNOExOSTVXYW5ZM2NWZHNVMjVWSm1LZjRJVnVVNGFBOFRKVzlCclhycE9kWFpxTGg5dWMwZ1kwOE5UUFlWTjRtSjV4NGxuVjduSFI3anAwME5XNVFua0hFeXhRV2FYTlArOD0iLCJtYWMiOiI1ZTc0YTY3NmZkYzE3ZTg1N2Q2N2RjOWE2MDViODcyOTRlMDJkMDhiMWU1MjJkYmEyYWE0MDFhOTJmYTU2ZWMzIiwidGFnIjoiIn0%3D; wishlist=%5B%223%22%5D; ckCsrfToken=LOvLK6ye9eOJUT2H3KdIaTloG5Ci4XGYK27atjWO; XSRF-TOKEN=eyJpdiI6Ik53WXdhUk16S0k5eUswbVpNK1JRVHc9PSIsInZhbHVlIjoiR3hqSHhUNzdnK3pXOHQzUlNJNUNtRXdOeUpPZlhkU3laSm4wUDRKR2hGMDRUWkFGUWlNRWt6Sm9ZL2NVY3p3aHo2Ri9HYWpKN1d6eHI5VkNwUVpBaUNMYWMvK200djdRRFQ3VitQY2FLWGpROW9kRUlUTVJMTFR6WHpkc3p6RksiLCJtYWMiOiJiNTRmZTMyNzI1MzE2ZjY3Njg4NWEwYzk2Nzk3YWIyN2NiOGI0M2I0NTY0ZGVlYWQ4OWMxZTE0N2QzMDI2YzE3IiwidGFnIjoiIn0%3D; daicatloc_session=eyJpdiI6IkJPd2xqRDY3MDVrZDNvUXdrZ25RMnc9PSIsInZhbHVlIjoidFZuRTNJeVViTzIzM3E0SHB4U0JNRDZkQ2c4NCtqZGlhSERUQnE3QWRPOEkyeWdGMjhCU01xUGtaNWxRaUxxa1BDMGRWUkR5WXdzaXZvMithdUx5TG5sWDN4bHc2YUNQUHovV1k3djh3S2pWQmpnNHBlamQvc1h3VldYNVk3ZEsiLCJtYWMiOiI3Y2IyZjUzOTA0YWM2YWJjNWUzOGM1NzgwMDRkYzdkMjg4NjU3MmYwMTY3ZjliN2QwYWIxOTk0NjgwOGFlYjQ3IiwidGFnIjoiIn0%3D"],"accept-language":["vi,vi-VN;q=0.9,fr-FR;q=0.8,fr;q=0.7,en-US;q=0.6,en;q=0.5,zh-CN;q=0.4,zh;q=0.3"],"accept-encoding":["gzip, deflate, br, zstd"],"referer":["https:\/\/daicatloc.nhathuocdaicatloc.vn\/tp-admin\/articles\/create"],"sec-fetch-dest":["document"],"sec-fetch-user":["?1"],"sec-fetch-mode":["navigate"],"sec-fetch-site":["same-origin"],"accept":["text\/html,application\/xhtml+xml,application\/xml;q=0.9,image\/avif,image\/webp,image\/apng,*\/*;q=0.8,application\/signed-exchange;v=b3;q=0.7"],"user-agent":["Mozilla\/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit\/537.36 (KHTML, like Gecko) Chrome\/124.0.0.0 Safari\/537.36"],"content-type":["multipart\/form-data; boundary=----WebKitFormBoundaryAhK2wA7fvDRnAAzL"],"origin":["https:\/\/daicatloc.nhathuocdaicatloc.vn"],"upgrade-insecure-requests":["1"],"sec-ch-ua-platform":["\"Windows\""],"sec-ch-ua-mobile":["?0"],"sec-ch-ua":["\"Chromium\";v=\"124\", \"Google Chrome\";v=\"124\", \"Not-A.Brand\";v=\"99\""],"cache-control":["max-age=0"],"content-length":["18087"]},"controller":"App\\Http\\Controllers\\article\\backend\\ArticleController@store","getData":[],"postData":{"_token":"KxovS0eXt88LlycVQvJzKK3I8YKSM229Jj0EwLHx","title":"Giun sán là gì? Nguyên nhân, triệu chứng và cách điều trị","slug":"giun-san-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri","description":"<p>Bệnh giun sán (Helminthiasis) là một vấn đề sức khỏe nghiêm trọng với tỷ lệ mắc bệnh và tử vong ngày càng tăng ở các nước kém và đang phát triển. Tuy nhiên, bệnh cũng có thể gặp ở các nước phát triển. Mắc giun sán hiện vẫn chưa được chẩn đoán ở nhiều người bệnh, dẫn đến việc người bệnh phải đối diện với nhiều biến chứng khác nhau.<\/p>\r\n","content":"<blockquote>\r\n<p>Bệnh giun sán (Helminthiasis) là một vấn đề sức khỏe nghiêm trọng với tỷ lệ mắc bệnh và tử vong ngày càng tăng ở các nước kém và đang phát triển. Tuy nhiên, bệnh cũng có thể gặp ở các nước phát triển. Mắc giun sán hiện vẫn chưa được chẩn đoán ở nhiều người bệnh, dẫn đến việc người bệnh phải đối diện với nhiều biến chứng khác nhau.<\/p>\r\n<\/blockquote>\r\n\r\n<h2><strong>Tìm hiểu chung<\/strong><\/h2>\r\n\r\n<h3><strong>Giun sán là gì?<\/strong><\/h3>\r\n\r\n<p>Giun sán là những ký sinh trùng có thể lây nhiễm sang người qua nhiều con đường khác nhau. Có hai loại giun sán chính gây bệnh ở người bao gồm giun tròn và giun dẹp.<\/p>\r\n\r\n<p>Giun tròn gây bệnh ở người có thể bao gồm giun truyền qua đất (gồm giun đũa, giun tóc và giun móc), hay giun chỉ gây bệnh giun chỉ bạch huyết. Trong đó, nhiễm giun truyền qua đất hiện đang là một trong những bệnh nhiễm trùng phổ biến nhất trên thế giới và chủ yếu ảnh hưởng đến các khu vực kinh tế kém phát triển. Giun truyền qua đất sẽ xâm nhập vào cơ thể con người từ đất bị ô nhiễm có chứa trứng giun như giun đũa và giun tóc. Một số loại khác có thể xâm nhập trực tiếp vào da như ấu trùng giun móc.<\/p>\r\n\r\n<p>Ngành giun dẹp gây bệnh ở người có thể bao gồm các loại sán, chẳng hạn như sán lá hoặc sán dây. Trong đó, bệnh sán máng (Schistosomiasis) là nhiễm trùng sán lá quan trọng nhất, bệnh có thể lây nhiễm qua bơi lội hoặc tiếp xúc với nước bẩn. Đối với sán dây, hai nhóm bệnh ở người do nhiễm sán dây là bệnh sán dây và bệnh nhiễm ấu trùng sán dây. Các loại sán dây gây bệnh ở người gồm sán dây lợn, sán dây bò, sán dây châu Á, sán dây cá, sán dây lùn. Bệnh do nhiễm ấu trùng sán dây có thể kể đến là nhiễm ấu trùng sán dây lợn.<\/p>\r\n\r\n<p style=\"text-align: center;\"><img alt=\"\" src=\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-1.jpg\" style=\"width: 800px; height: 450px;\" \/><\/p>\r\n\r\n<p style=\"text-align: center;\"><img alt=\"\" src=\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-2.jpg\" style=\"width: 800px; height: 450px;\" \/><\/p>\r\n\r\n<p style=\"text-align: center;\"><img alt=\"\" src=\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-3.jpg\" style=\"width: 800px; height: 450px;\" \/><\/p>\r\n\r\n<h2><strong>Triệu chứng<\/strong><\/h2>\r\n\r\n<h3><strong>Những dấu hiệu và triệu chứng của nhiễm giun sán<\/strong><\/h3>\r\n\r\n<p>Trong hầu hết các trường hợp, biểu hiện lâm sàng của nhiễm giun sán tuỳ thuộc và mức độ nhiễm, ví dụ như một số người bệnh bị nhiễm nhẹ không triệu chứng, cho đến bị nhiễm nặng dẫn đến nhiều biến chứng khác nhau.<\/p>\r\n\r\n<p>Các triệu chứng của nhiễm giun sán rất đa dạng, tùy thuộc vào từng loại khác nhau:<\/p>\r\n\r\n<ul>\r\n\t<li>Nếu bạn thấy những con giun nhỏ, màu trắng, lẫn trong phân và bạn cảm thấy ngứa nhiều quanh hậu môn vào ban đêm, có thể đây là triệu chứng của nhiễm giun kim.<\/li>\r\n\t<li>Các triệu chứng có thể gặp khi nhiễm giun đũa bao gồm ho, khò khè, đau bụng, nôn mửa, tiêu chảy, mệt mỏi hoặc sụt cân.<\/li>\r\n\t<li>Nhiễm giun móc có thể gặp các dấu hiệu như phát ban ngứa, đau bụng, tiêu chảy, sụt cân, mệt mỏi, thiếu máu.<\/li>\r\n\t<li>Nhiễm trùng giun lươn có thể không có triệu chứng cho đến các triệu chứng như đau bụng, đầy hơi, ợ nóng, tiêu chảy, táo bón, ho khan, viêm da.<\/li>\r\n\t<li>Nhiễm giun xoắn có thể gặp các triệu chứng đường tiêu hoá như buồn nôn, nôn, tiêu chảy hoặc mệt mỏi, sốt, nhức đầu, đau cơ và khớp.<\/li>\r\n\t<li>Nhiễm giun tóc có thể gặp các triệu chứng bao gồm tiêu chảy có lẫn nhầy máu, trẻ còi cọc chậm tăng trưởng, sa trực tràng.<\/li>\r\n\t<li>Các triệu chứng của nhiễm sán dây hoặc ấu trùng sán dây có thể gồm buồn nôn, mệt mỏi, chán ăn, đau bụng, tiêu chảy, chóng mặt, sụt cân, nhức đầu, co giật.<\/li>\r\n\t<li>Bệnh sán máng có thể dẫn đến các triệu chứng gồm đau bụng, tiêu chảy, tiểu ra máu hoặc nhiễm trùng mạn tính gây thiếu máu, chậm phát triển, tổn thương cơ quan.<\/li>\r\n\t<li>Giun chỉ gây ra bệnh giun chỉ bạch huyết có thể gặp triệu chứng như phù chân.<\/li>\r\n<\/ul>\r\n\r\n<h3><strong>Biến chứng có thể gặp khi mắc bệnh giun sán<\/strong><\/h3>\r\n\r\n<p>Nhiễm giun sán không điều trị có thể dẫn đến nhiều biến chứng khác nhau, bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Nhiễm giun đũa trưởng thành có thể làm tắc ruột dẫn đến tắc ruột non, xoắn ruột hoặc lồng ruột. Đặc biệt ở trẻ em có thể có các biến chứng do giun xâm nhập các lỗ dẫn đến viêm ruột thừa, viêm túi mật, viêm tụy. Giun đũa di chuyển có thể làm tắc ống mật và làm thay đổi hệ vi sinh đường ruột. Biến chứng khác là chảy máu niêm mạc từ đường tiêu hoá trên hoặc viêm toàn thân dẫn đến thiếu máu.<\/li>\r\n\t<li>Giun tóc nằm ở niêm mạc ruột có thể gây ra các tổn thương xuất huyết, viêm đại tràng hoặc gây thiếu máu nặng ở phụ nữ mang thai.<\/li>\r\n\t<li>Nhiễm sán máng có thể dẫn đến biến chứng do sán máng trong gan và bàng quang, dẫn đến xơ hóa đường tĩnh mạch cửa hoặc liên quan đến tân sinh tại bàng quang.<\/li>\r\n\t<li>Nhiễm giun chỉ có thể gây tắc nghẽn bạch huyết dẫn đến phù chân voi.<\/li>\r\n\t<li>Nhiễm ấu trùng sán dây lợn có thể gây các biến chứng đến hệ thần kinh trung ương.<\/li>\r\n\t<li>Giun móc cắm răng vào lớp niêm mạc và dưới niêm, từ đó dẫn đến chảy máu kéo dài và mất máu đáng kể. Giun móc có thể gây thiếu máu đáng kể, đặc biệt ở trẻ em và phụ nữ mang thai. Cùng với bệnh sán máng, tình trạng này có thể làm tăng nguy cơ sinh non, tỷ lệ mắc bệnh và tử vong ở bà mẹ.<\/li>\r\n\t<li>Sán dây cá gây thiếu hụt vitamin B12 thông qua việc cản trở hấp thu qua đường ruột.<\/li>\r\n<\/ul>\r\n\r\n<p style=\"text-align: center;\"><img alt=\"\" src=\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-4.jpg\" style=\"width: 800px; height: 450px;\" \/><\/p>\r\n\r\n<p style=\"text-align: center;\"><i>Ấu trùng giun sán có thể di chuyển dưới da gây nổi ban ngứa có hình dạng giun sán<\/i><\/p>\r\n\r\n<h3><strong>Khi nào cần gặp bác sĩ?<\/strong><\/h3>\r\n\r\n<p>Bạn nên đến gặp bác sĩ khi bắt gặp các triệu chứng nghi ngờ nhiễm giun sán. Các triệu chứng nhìn chung có thể bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Thấy giun hoặc trứng giun trong phân của bạn.<\/li>\r\n\t<li>Nổi mẩn đỏ, ngứa có hình dạng giun trên da.<\/li>\r\n\t<li>Cảm giác mệt mỏi, tiêu chảy hoặc đau bụng kéo dài hơn 2 tuần.<\/li>\r\n\t<li>Giảm cân mà không rõ lý do.<\/li>\r\n<\/ul>\r\n\r\n<h2><strong>Nguyên nhân<\/strong><\/h2>\r\n\r\n<h3><strong>Nguyên nhân dẫn đến nhiễm giun sán<\/strong><\/h3>\r\n\r\n<p>Nguyên nhân dẫn đến bệnh giun sán là do nhiễm phải tác nhân gây bệnh thông qua các con đường khác nhau. Trong đó:<\/p>\r\n\r\n<ul>\r\n\t<li><i>Giun đũa (A. lumbricoides) và giun tóc (T. trichiura): <\/i>Được lây truyền qua đường phân miệng. Trong đó, giun đũa trưởng thành có hình trụ dài và ấu trùng giun đũa có thể di chuyển vào tuần hoàn phổi, nhưng giun tóc thì không.<\/li>\r\n\t<li><i>Giun móc (A. duodenale và N. americanus): <\/i>Lây truyền trực tiếp qua da và đi vào phổi, đi qua các mao mạch phổi, xâm nhập vào phế nang rồi đến ruột qua đường thanh quản.<\/li>\r\n\t<li><i>Giun lươn (S. stercoralis): <\/i>Có thể lây nhiễm qua da và đường miệng.<\/li>\r\n\t<li><i>Bệnh sán máng: <\/i>Nhiễm trùng sán máng (do các loại sán lá) thường lây truyền qua tiếp xúc với ốc nước ngọt trong khi bơi hoặc tắm rửa. Bệnh sán máng gây viêm mạn tính tạo ra các gốc oxy tự do, có thể dẫn đến các đột biến khác nhau và gây ra ung thư bàng quang hay xơ hoá đường tĩnh mạch cửa.<\/li>\r\n\t<li><i>Sán dây:<\/i> Bệnh nhiễm sán dây thường là do ăn phải các loại thịt lợn (sán dây lợn), thịt bò (sán dây bò), cá nước ngọt (sán dây cá) nhiễm bệnh chưa được nấu chín. Nhiễm ấu trùng sán dây lợn có thể xảy ra khi bạn ăn phải thực phẩm hoặc nước bị nhiễm trứng sán.<\/li>\r\n<\/ul>\r\n\r\n<p style=\"text-align: center;\"><img alt=\"\" src=\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-5.jpg\" style=\"width: 800px; height: 450px;\" \/><\/p>\r\n\r\n<p style=\"text-align: center;\"><i>Bạn có thể bị nhiễm sán dây nếu ăn phải thịt nhiễm bệnh chưa được nấu chín<\/i><\/p>\r\n\r\n<h2><strong>Nguy cơ<\/strong><\/h2>\r\n\r\n<h3><strong>Những ai có nguy cơ mắc phải giun sán?<\/strong><\/h3>\r\n\r\n<p>Mặc dù ai cũng có nguy cơ mắc phải giun sán. Tuy nhiên, các bệnh nhiễm ký sinh trùng đường ruột thường gây bệnh tật và tử vong đặc biệt ở các đối tượng là trẻ em.<\/p>\r\n\r\n<h3><strong>Yếu tố làm tăng nguy cơ mắc phải giun sán<\/strong><\/h3>\r\n\r\n<p>Các yếu tố nguy cơ chính của bệnh giun sán bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Khu vực nông thôn;<\/li>\r\n\t<li>Tình trạng kinh tế xã hội thấp;<\/li>\r\n\t<li>Vệ sinh kém;<\/li>\r\n\t<li>Thiếu nước sạch;<\/li>\r\n\t<li>Vệ sinh cá nhân kém;<\/li>\r\n\t<li>Thiếu cắt tỉa móng tay;<\/li>\r\n\t<li>Điều kiện sống đông đúc;<\/li>\r\n\t<li>Thiếu giáo dục;<\/li>\r\n\t<li>Thiếu khả năng tiếp cận dịch vụ chăm sóc sức khoẻ và nhà ở không đủ điều kiện.<\/li>\r\n<\/ul>\r\n\r\n<p>Trong đó, vệ sinh kém của người mẹ hoặc của người chăm sóc cũng là một trong những yếu tố nguy cơ quan trọng nhất gây nhiễm giun sán truyền qua đất ở trẻ mẫu giáo.<\/p>\r\n\r\n<p style=\"text-align: center;\"><img alt=\"\" src=\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-6.jpg\" style=\"width: 800px; height: 450px;\" \/><\/p>\r\n\r\n<p style=\"text-align: center;\"><i>Vệ sinh cá nhân kém là một trong những yếu tố nguy cơ nhiễm giun sán<\/i><\/p>\r\n\r\n<h2><strong>Phương Pháp Chẩn Đoán &amp; Điều Trị<\/strong><\/h2>\r\n\r\n<h3><strong>Phương pháp chẩn đoán và xét nghiệm giun sán<\/strong><\/h3>\r\n\r\n<p>Nếu bác sĩ nghi ngờ bạn nhiễm giun sán, họ có thể đề nghị các xét nghiệm khác nhau để chẩn đoán chính xác loại giun sán mà bạn mắc phải. Các xét nghiệm có thể bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Soi phân;<\/li>\r\n\t<li>Nội soi tiêu hóa trên và dưới;<\/li>\r\n\t<li>Xét nghiệm máu;<\/li>\r\n\t<li>Chụp X-quang, siêu âm hoặc các xét nghiệm hình ảnh học khác.<\/li>\r\n<\/ul>\r\n\r\n<h3><strong>Điều trị giun sán<\/strong><\/h3>\r\n\r\n<p><strong>Nội khoa<\/strong><\/p>\r\n\r\n<p>Điều trị nhiễm giun sán có thể bao gồm điều trị đặc hiệu như các loại thuốc giúp diệt giun sán. Bên cạnh đó, các lựa chọn thuốc bổ sung có thể bao gồm bổ sung sắt nếu có thiếu máu thiếu sắt, kháng sinh nếu có nhiễm trùng. Các thuốc chống động kinh, thuốc giảm đau có thể được dùng trong trường hợp bệnh nang sán thần kinh.<\/p>\r\n\r\n<p><strong>Ngoại khoa<\/strong><\/p>\r\n\r\n<p>Phẫu thuật có thể được chỉ định đối với các trường hợp bệnh nang sán. Trong trường hợp bệnh giun chỉ bạch huyết, phẫu thuật cũng có thể được chỉ định. Bên cạnh đó, phẫu thuật giúp giải quyết các biến chứng như tắc ruột, lồng ruột hay xoắn ruột.<\/p>\r\n\r\n<h2><strong>Chế Độ Sinh Hoạt &amp; Phòng Ngừa<\/strong><\/h2>\r\n\r\n<h3><strong>Những thói quen sinh hoạt giúp hạn chế diễn tiến của giun sán<\/strong><\/h3>\r\n\r\n<p>Để hạn chế diễn tiến của nhiễm giun sán, điều quan trọng là bạn cần được điều trị sớm để tránh các biến chứng của bệnh, bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Tuân thủ liệu trình điều trị để đạt được hiệu quả tốt nhất.<\/li>\r\n\t<li>Sau điều trị, thực hiện việc giữ gìn vệ sinh đúng cách để tránh mắc bệnh trở lại.<\/li>\r\n\t<li>Tự theo dõi các triệu chứng cũng như tái khám định kỳ để có thể phát hiện sớm giun sán (nếu có) và điều trị kịp thời.<\/li>\r\n\t<li>Hỏi bác sĩ về cách giữ gìn vệ sinh đúng cách để có thể ngăn ngừa nhiễm giun sán.<\/li>\r\n<\/ul>\r\n\r\n<h3><strong>Phòng ngừa giun sán<\/strong><\/h3>\r\n\r\n<p>Giữ gìn vệ sinh đúng cách là một trong những biện pháp quan trọng nhất để ngăn ngừa nhiễm giun sán. Các việc bạn có thể làm để ngăn ngừa nhiễm giun sán bao gồm:<\/p>\r\n\r\n<ul>\r\n\t<li>Vệ sinh cá nhân tốt như rửa tay thường xuyên, trước khi ăn, sau khi đi vệ sinh.<\/li>\r\n\t<li>Làm sạch trái cây, rau quả cũng như các thực phẩm trước khi ăn.<\/li>\r\n\t<li>Tránh đi chân đất ngoài trời, tránh tiếp xúc đất hay nguồn nước bị ô nhiễm.<\/li>\r\n\t<li>Điều trị cho vật nuôi nếu chúng bị nhiễm giun sán.<\/li>\r\n\t<li>Không ăn thịt sống hoặc chưa được nấu chín kỹ.<\/li>\r\n\t<li>Bạn nên chú ý khi đi du lịch đến các khu vực có lưu hành bệnh, ví dụ như tránh tiếp xúc với nước ngọt ở vùng lưu hành bệnh giun sán.<\/li>\r\n<\/ul>\r\n\r\n<p style=\"text-align: center;\"><img alt=\"\" src=\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-7.jpg\" style=\"width: 800px; height: 450px;\" \/><\/p>\r\n\r\n<p style=\"text-align: center;\"><i>Rửa tay sạch là một trong những biện pháp ngăn ngừa nhiễm giun sán<\/i><\/p>\r\n\r\n<h3><strong>Các câu hỏi thường gặp về giun sán<\/strong><\/h3>\r\n\r\n<p><strong>Làm thế nào để tôi có thể ngăn ngừa bệnh giun sán?<\/strong><\/p>\r\n\r\n<p>Nhiễm giun sán hoàn toàn có thể ngăn ngừa được nếu bạn giữ gìn vệ sinh tốt. Bao gồm rửa tay thường xuyên, làm sạch thực phẩm, không ăn thịt cá chưa được nấu chín, hạn chế tiếp xúc với đất và nước ngọt (đặc biệt là khu vực có lưu hành bệnh).<\/p>\r\n\r\n<p><strong>Tôi có cần phải phẫu thuật nếu bị giun sán không?<\/strong><\/p>\r\n\r\n<p>Trong trường hợp bạn bị nang sán do nhiễm ấu trùng sán dây hoặc gặp các biến chứng của nhiễm giun đũa như tắc ruột, lồng ruột, xoắn ruột, bạn cần được phẫu thuật để điều trị các tình trạng này.<\/p>\r\n\r\n<p><strong>Việt Nam có phải là khu vực lưu hành bệnh giun sán không?<\/strong><\/p>\r\n\r\n<p>Bệnh giun sán phổ biến ở hầu hết các nước châu Á, trong đó có Việt Nam. Bệnh cũng được tìm thấy ở khu vực châu Phi và châu Mỹ Latinh.<\/p>\r\n\r\n<p><strong>Bệnh giun truyền qua đất có phổ biến không?<\/strong><\/p>\r\n\r\n<p>Nhiễm giun truyền qua đất là một trong những bệnh nhiễm trùng phổ biến nhất trên toàn thế giới. Với tỷ lệ mắc ước tính trên toàn cầu là khoảng 1,5 tỷ người, chiếm 24% dân số thế giới.<\/p>\r\n","meta_title":"","meta_description":"","catalogue_id":"42","image_old":"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-1.jpg","publish":"0"},"requestData":null,"sessionData":{"_token":"KxovS0eXt88LlycVQvJzKK3I8YKSM229Jj0EwLHx","login_web_59ba36addc2b2f9401580f014c7f58ea4e30989d":7,"_previous":{"__type__":"array","url":"https:\/\/daicatloc.nhathuocdaicatloc.vn\/tp-admin\/articles\/create"},"_flash":{"__type__":"array","old":{"__type__":"array","0":"success"},"new":{"__type__":"array"}},"success":"Thêm mới bài viết thành công"},"authenticatedUser":{"id":7,"username":"admin@gmail.com","email":"admin@gmail.com","name":"ADMIN TP"},"cookies":{"authImagesManager":"{\"domain\":null,\"email\":\"admin@gmail.com\",\"permission\":[\"all\",\"upload\",\"delete\",\"rename\",\"create_dirs\",\"delete_dirs\",\"rename_dirs\"],\"folder_upload\":\"all\"}","remember_web_59ba36addc2b2f9401580f014c7f58ea4e30989d":"eyJpdiI6IjNkL0tZUVVWZnczQ0JObTl6TUJKblE9PSIsInZhbHVlIjoiRjNUaGw0cWhJSG9OaFRvUUhaK1dKSlZDOVc0YmlSRVRRZU5GS2N2c3k1TFovN2pJbXVPeXUzT1EwOTNmWnhiUzhsZ3YxYUdGcUVENXpKUU5CbUQ3Vi9KMTR0cUl1SXl6cnBEM2lQTngreDJIbm50TmEvQnBsb253bmZHUWdkQVVpK3oxK3F1aUtNOExOSTVXYW5ZM2NWZHNVMjVWSm1LZjRJVnVVNGFBOFRKVzlCclhycE9kWFpxTGg5dWMwZ1kwOE5UUFlWTjRtSjV4NGxuVjduSFI3anAwME5XNVFua0hFeXhRV2FYTlArOD0iLCJtYWMiOiI1ZTc0YTY3NmZkYzE3ZTg1N2Q2N2RjOWE2MDViODcyOTRlMDJkMDhiMWU1MjJkYmEyYWE0MDFhOTJmYTU2ZWMzIiwidGFnIjoiIn0=","wishlist":"[\"3\"]","ckCsrfToken":"LOvLK6ye9eOJUT2H3KdIaTloG5Ci4XGYK27atjWO","XSRF-TOKEN":"eyJpdiI6Ik53WXdhUk16S0k5eUswbVpNK1JRVHc9PSIsInZhbHVlIjoiR3hqSHhUNzdnK3pXOHQzUlNJNUNtRXdOeUpPZlhkU3laSm4wUDRKR2hGMDRUWkFGUWlNRWt6Sm9ZL2NVY3p3aHo2Ri9HYWpKN1d6eHI5VkNwUVpBaUNMYWMvK200djdRRFQ3VitQY2FLWGpROW9kRUlUTVJMTFR6WHpkc3p6RksiLCJtYWMiOiJiNTRmZTMyNzI1MzE2ZjY3Njg4NWEwYzk2Nzk3YWIyN2NiOGI0M2I0NTY0ZGVlYWQ4OWMxZTE0N2QzMDI2YzE3IiwidGFnIjoiIn0=","daicatloc_session":"eyJpdiI6IkJPd2xqRDY3MDVrZDNvUXdrZ25RMnc9PSIsInZhbHVlIjoidFZuRTNJeVViTzIzM3E0SHB4U0JNRDZkQ2c4NCtqZGlhSERUQnE3QWRPOEkyeWdGMjhCU01xUGtaNWxRaUxxa1BDMGRWUkR5WXdzaXZvMithdUx5TG5sWDN4bHc2YUNQUHovV1k3djh3S2pWQmpnNHBlamQvc1h3VldYNVk3ZEsiLCJtYWMiOiI3Y2IyZjUzOTA0YWM2YWJjNWUzOGM1NzgwMDRkYzdkMjg4NjU3MmYwMTY3ZjliN2QwYWIxOTk0NjgwOGFlYjQ3IiwidGFnIjoiIn0="},"responseTime":1716433850.169175,"responseStatus":302,"responseDuration":314.5558834075928,"memoryUsage":25165824,"middleware":["web","locale","auth:web"],"databaseQueries":[{"query":"SELECT * FROM `users` WHERE `id` = 7 LIMIT 1","duration":0.61,"connection":"mysql","time":1716433850.1355698,"trace":[{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/fruitcake\/laravel-cors\/src\/HandleCors.php","line":38,"isVendor":true},{"call":"Fruitcake\\Cors\\HandleCors->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Http\/Middleware\/TrustProxies.php","line":39,"isVendor":true},{"call":"Illuminate\\Http\\Middleware\\TrustProxies->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/itsgoingd\/clockwork\/Clockwork\/Support\/Laravel\/ClockworkMiddleware.php","line":24,"isVendor":true},{"call":"Clockwork\\Support\\Laravel\\ClockworkMiddleware->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":103,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->then()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Http\/Kernel.php","line":142,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->sendRequestThroughRouter()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Http\/Kernel.php","line":111,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/public\/index.php","line":51,"isVendor":false}],"model":"App\\Models\\User","tags":[]},{"query":"SELECT count(*) as aggregate FROM `router` WHERE `slug` = 'giun-san-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri' and (`alanguage` = 'vi')","duration":0.72,"connection":"mysql","time":1716433850.150476,"trace":[{"call":"Illuminate\\Http\\Request->__call()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":98,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Middleware\/SubstituteBindings.php","line":50,"isVendor":true}],"model":null,"tags":[]},{"query":"SELECT `id`, `title`, `slug`, `lft` FROM `category_articles` WHERE `id` = '42' LIMIT 1","duration":0.36,"connection":"mysql","time":1716433850.152221,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Builder->first()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":193,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":"App\\Models\\CategoryArticle","tags":[]},{"query":"SELECT `id`, `title` FROM `category_articles` WHERE `alanguage` = 'vi' and `lft` <= 9 and `rgt` >= 9 ORDER BY `lft` ASC, `order` ASC","duration":0.4,"connection":"mysql","time":1716433850.153101,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Builder->get()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":194,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":"App\\Models\\CategoryArticle","tags":[]},{"query":"INSERT INTO `articles` (`title`, `slug`, `catalogue_id`, `image`, `description`, `content`, `catalogue`, `products`, `meta_title`, `meta_description`, `publish`, `userid_created`, `created_at`, `alanguage`) VALUES ('Giun sán là gì? Nguyên nhân, triệu chứng và cách điều trị', 'giun-san-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri', '42', '\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-1.jpg', '<p>Bệnh giun sán (Helminthiasis) là một vấn đề sức khỏe nghiêm trọng với tỷ lệ mắc bệnh và tử vong ngày càng tăng ở các nước kém và đang phát triển. Tuy nhiên, bệnh cũng có thể gặp ở các nước phát triển. Mắc giun sán hiện vẫn chưa được chẩn đoán ở nhiều người bệnh, dẫn đến việc người bệnh phải đối diện với nhiều biến chứng khác nhau.<\/p>', '<blockquote>\\r\\n<p>Bệnh giun sán (Helminthiasis) là một vấn đề sức khỏe nghiêm trọng với tỷ lệ mắc bệnh và tử vong ngày càng tăng ở các nước kém và đang phát triển. Tuy nhiên, bệnh cũng có thể gặp ở các nước phát triển. Mắc giun sán hiện vẫn chưa được chẩn đoán ở nhiều người bệnh, dẫn đến việc người bệnh phải đối diện với nhiều biến chứng khác nhau.<\/p>\\r\\n<\/blockquote>\\r\\n\\r\\n<h2><strong>Tìm hiểu chung<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Giun sán là gì?<\/strong><\/h3>\\r\\n\\r\\n<p>Giun sán là những ký sinh trùng có thể lây nhiễm sang người qua nhiều con đường khác nhau. Có hai loại giun sán chính gây bệnh ở người bao gồm giun tròn và giun dẹp.<\/p>\\r\\n\\r\\n<p>Giun tròn gây bệnh ở người có thể bao gồm giun truyền qua đất (gồm giun đũa, giun tóc và giun móc), hay giun chỉ gây bệnh giun chỉ bạch huyết. Trong đó, nhiễm giun truyền qua đất hiện đang là một trong những bệnh nhiễm trùng phổ biến nhất trên thế giới và chủ yếu ảnh hưởng đến các khu vực kinh tế kém phát triển. Giun truyền qua đất sẽ xâm nhập vào cơ thể con người từ đất bị ô nhiễm có chứa trứng giun như giun đũa và giun tóc. Một số loại khác có thể xâm nhập trực tiếp vào da như ấu trùng giun móc.<\/p>\\r\\n\\r\\n<p>Ngành giun dẹp gây bệnh ở người có thể bao gồm các loại sán, chẳng hạn như sán lá hoặc sán dây. Trong đó, bệnh sán máng (Schistosomiasis) là nhiễm trùng sán lá quan trọng nhất, bệnh có thể lây nhiễm qua bơi lội hoặc tiếp xúc với nước bẩn. Đối với sán dây, hai nhóm bệnh ở người do nhiễm sán dây là bệnh sán dây và bệnh nhiễm ấu trùng sán dây. Các loại sán dây gây bệnh ở người gồm sán dây lợn, sán dây bò, sán dây châu Á, sán dây cá, sán dây lùn. Bệnh do nhiễm ấu trùng sán dây có thể kể đến là nhiễm ấu trùng sán dây lợn.<\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><img alt=\\\"\\\" src=\\\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-1.jpg\\\" style=\\\"width: 800px; height: 450px;\\\" \/><\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><img alt=\\\"\\\" src=\\\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-2.jpg\\\" style=\\\"width: 800px; height: 450px;\\\" \/><\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><img alt=\\\"\\\" src=\\\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-3.jpg\\\" style=\\\"width: 800px; height: 450px;\\\" \/><\/p>\\r\\n\\r\\n<h2><strong>Triệu chứng<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Những dấu hiệu và triệu chứng của nhiễm giun sán<\/strong><\/h3>\\r\\n\\r\\n<p>Trong hầu hết các trường hợp, biểu hiện lâm sàng của nhiễm giun sán tuỳ thuộc và mức độ nhiễm, ví dụ như một số người bệnh bị nhiễm nhẹ không triệu chứng, cho đến bị nhiễm nặng dẫn đến nhiều biến chứng khác nhau.<\/p>\\r\\n\\r\\n<p>Các triệu chứng của nhiễm giun sán rất đa dạng, tùy thuộc vào từng loại khác nhau:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Nếu bạn thấy những con giun nhỏ, màu trắng, lẫn trong phân và bạn cảm thấy ngứa nhiều quanh hậu môn vào ban đêm, có thể đây là triệu chứng của nhiễm giun kim.<\/li>\\r\\n\t<li>Các triệu chứng có thể gặp khi nhiễm giun đũa bao gồm ho, khò khè, đau bụng, nôn mửa, tiêu chảy, mệt mỏi hoặc sụt cân.<\/li>\\r\\n\t<li>Nhiễm giun móc có thể gặp các dấu hiệu như phát ban ngứa, đau bụng, tiêu chảy, sụt cân, mệt mỏi, thiếu máu.<\/li>\\r\\n\t<li>Nhiễm trùng giun lươn có thể không có triệu chứng cho đến các triệu chứng như đau bụng, đầy hơi, ợ nóng, tiêu chảy, táo bón, ho khan, viêm da.<\/li>\\r\\n\t<li>Nhiễm giun xoắn có thể gặp các triệu chứng đường tiêu hoá như buồn nôn, nôn, tiêu chảy hoặc mệt mỏi, sốt, nhức đầu, đau cơ và khớp.<\/li>\\r\\n\t<li>Nhiễm giun tóc có thể gặp các triệu chứng bao gồm tiêu chảy có lẫn nhầy máu, trẻ còi cọc chậm tăng trưởng, sa trực tràng.<\/li>\\r\\n\t<li>Các triệu chứng của nhiễm sán dây hoặc ấu trùng sán dây có thể gồm buồn nôn, mệt mỏi, chán ăn, đau bụng, tiêu chảy, chóng mặt, sụt cân, nhức đầu, co giật.<\/li>\\r\\n\t<li>Bệnh sán máng có thể dẫn đến các triệu chứng gồm đau bụng, tiêu chảy, tiểu ra máu hoặc nhiễm trùng mạn tính gây thiếu máu, chậm phát triển, tổn thương cơ quan.<\/li>\\r\\n\t<li>Giun chỉ gây ra bệnh giun chỉ bạch huyết có thể gặp triệu chứng như phù chân.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<h3><strong>Biến chứng có thể gặp khi mắc bệnh giun sán<\/strong><\/h3>\\r\\n\\r\\n<p>Nhiễm giun sán không điều trị có thể dẫn đến nhiều biến chứng khác nhau, bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Nhiễm giun đũa trưởng thành có thể làm tắc ruột dẫn đến tắc ruột non, xoắn ruột hoặc lồng ruột. Đặc biệt ở trẻ em có thể có các biến chứng do giun xâm nhập các lỗ dẫn đến viêm ruột thừa, viêm túi mật, viêm tụy. Giun đũa di chuyển có thể làm tắc ống mật và làm thay đổi hệ vi sinh đường ruột. Biến chứng khác là chảy máu niêm mạc từ đường tiêu hoá trên hoặc viêm toàn thân dẫn đến thiếu máu.<\/li>\\r\\n\t<li>Giun tóc nằm ở niêm mạc ruột có thể gây ra các tổn thương xuất huyết, viêm đại tràng hoặc gây thiếu máu nặng ở phụ nữ mang thai.<\/li>\\r\\n\t<li>Nhiễm sán máng có thể dẫn đến biến chứng do sán máng trong gan và bàng quang, dẫn đến xơ hóa đường tĩnh mạch cửa hoặc liên quan đến tân sinh tại bàng quang.<\/li>\\r\\n\t<li>Nhiễm giun chỉ có thể gây tắc nghẽn bạch huyết dẫn đến phù chân voi.<\/li>\\r\\n\t<li>Nhiễm ấu trùng sán dây lợn có thể gây các biến chứng đến hệ thần kinh trung ương.<\/li>\\r\\n\t<li>Giun móc cắm răng vào lớp niêm mạc và dưới niêm, từ đó dẫn đến chảy máu kéo dài và mất máu đáng kể. Giun móc có thể gây thiếu máu đáng kể, đặc biệt ở trẻ em và phụ nữ mang thai. Cùng với bệnh sán máng, tình trạng này có thể làm tăng nguy cơ sinh non, tỷ lệ mắc bệnh và tử vong ở bà mẹ.<\/li>\\r\\n\t<li>Sán dây cá gây thiếu hụt vitamin B12 thông qua việc cản trở hấp thu qua đường ruột.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><img alt=\\\"\\\" src=\\\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-4.jpg\\\" style=\\\"width: 800px; height: 450px;\\\" \/><\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><i>Ấu trùng giun sán có thể di chuyển dưới da gây nổi ban ngứa có hình dạng giun sán<\/i><\/p>\\r\\n\\r\\n<h3><strong>Khi nào cần gặp bác sĩ?<\/strong><\/h3>\\r\\n\\r\\n<p>Bạn nên đến gặp bác sĩ khi bắt gặp các triệu chứng nghi ngờ nhiễm giun sán. Các triệu chứng nhìn chung có thể bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Thấy giun hoặc trứng giun trong phân của bạn.<\/li>\\r\\n\t<li>Nổi mẩn đỏ, ngứa có hình dạng giun trên da.<\/li>\\r\\n\t<li>Cảm giác mệt mỏi, tiêu chảy hoặc đau bụng kéo dài hơn 2 tuần.<\/li>\\r\\n\t<li>Giảm cân mà không rõ lý do.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<h2><strong>Nguyên nhân<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Nguyên nhân dẫn đến nhiễm giun sán<\/strong><\/h3>\\r\\n\\r\\n<p>Nguyên nhân dẫn đến bệnh giun sán là do nhiễm phải tác nhân gây bệnh thông qua các con đường khác nhau. Trong đó:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li><i>Giun đũa (A. lumbricoides) và giun tóc (T. trichiura): <\/i>Được lây truyền qua đường phân miệng. Trong đó, giun đũa trưởng thành có hình trụ dài và ấu trùng giun đũa có thể di chuyển vào tuần hoàn phổi, nhưng giun tóc thì không.<\/li>\\r\\n\t<li><i>Giun móc (A. duodenale và N. americanus): <\/i>Lây truyền trực tiếp qua da và đi vào phổi, đi qua các mao mạch phổi, xâm nhập vào phế nang rồi đến ruột qua đường thanh quản.<\/li>\\r\\n\t<li><i>Giun lươn (S. stercoralis): <\/i>Có thể lây nhiễm qua da và đường miệng.<\/li>\\r\\n\t<li><i>Bệnh sán máng: <\/i>Nhiễm trùng sán máng (do các loại sán lá) thường lây truyền qua tiếp xúc với ốc nước ngọt trong khi bơi hoặc tắm rửa. Bệnh sán máng gây viêm mạn tính tạo ra các gốc oxy tự do, có thể dẫn đến các đột biến khác nhau và gây ra ung thư bàng quang hay xơ hoá đường tĩnh mạch cửa.<\/li>\\r\\n\t<li><i>Sán dây:<\/i> Bệnh nhiễm sán dây thường là do ăn phải các loại thịt lợn (sán dây lợn), thịt bò (sán dây bò), cá nước ngọt (sán dây cá) nhiễm bệnh chưa được nấu chín. Nhiễm ấu trùng sán dây lợn có thể xảy ra khi bạn ăn phải thực phẩm hoặc nước bị nhiễm trứng sán.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><img alt=\\\"\\\" src=\\\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-5.jpg\\\" style=\\\"width: 800px; height: 450px;\\\" \/><\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><i>Bạn có thể bị nhiễm sán dây nếu ăn phải thịt nhiễm bệnh chưa được nấu chín<\/i><\/p>\\r\\n\\r\\n<h2><strong>Nguy cơ<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Những ai có nguy cơ mắc phải giun sán?<\/strong><\/h3>\\r\\n\\r\\n<p>Mặc dù ai cũng có nguy cơ mắc phải giun sán. Tuy nhiên, các bệnh nhiễm ký sinh trùng đường ruột thường gây bệnh tật và tử vong đặc biệt ở các đối tượng là trẻ em.<\/p>\\r\\n\\r\\n<h3><strong>Yếu tố làm tăng nguy cơ mắc phải giun sán<\/strong><\/h3>\\r\\n\\r\\n<p>Các yếu tố nguy cơ chính của bệnh giun sán bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Khu vực nông thôn;<\/li>\\r\\n\t<li>Tình trạng kinh tế xã hội thấp;<\/li>\\r\\n\t<li>Vệ sinh kém;<\/li>\\r\\n\t<li>Thiếu nước sạch;<\/li>\\r\\n\t<li>Vệ sinh cá nhân kém;<\/li>\\r\\n\t<li>Thiếu cắt tỉa móng tay;<\/li>\\r\\n\t<li>Điều kiện sống đông đúc;<\/li>\\r\\n\t<li>Thiếu giáo dục;<\/li>\\r\\n\t<li>Thiếu khả năng tiếp cận dịch vụ chăm sóc sức khoẻ và nhà ở không đủ điều kiện.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p>Trong đó, vệ sinh kém của người mẹ hoặc của người chăm sóc cũng là một trong những yếu tố nguy cơ quan trọng nhất gây nhiễm giun sán truyền qua đất ở trẻ mẫu giáo.<\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><img alt=\\\"\\\" src=\\\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-6.jpg\\\" style=\\\"width: 800px; height: 450px;\\\" \/><\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><i>Vệ sinh cá nhân kém là một trong những yếu tố nguy cơ nhiễm giun sán<\/i><\/p>\\r\\n\\r\\n<h2><strong>Phương Pháp Chẩn Đoán &amp; Điều Trị<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Phương pháp chẩn đoán và xét nghiệm giun sán<\/strong><\/h3>\\r\\n\\r\\n<p>Nếu bác sĩ nghi ngờ bạn nhiễm giun sán, họ có thể đề nghị các xét nghiệm khác nhau để chẩn đoán chính xác loại giun sán mà bạn mắc phải. Các xét nghiệm có thể bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Soi phân;<\/li>\\r\\n\t<li>Nội soi tiêu hóa trên và dưới;<\/li>\\r\\n\t<li>Xét nghiệm máu;<\/li>\\r\\n\t<li>Chụp X-quang, siêu âm hoặc các xét nghiệm hình ảnh học khác.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<h3><strong>Điều trị giun sán<\/strong><\/h3>\\r\\n\\r\\n<p><strong>Nội khoa<\/strong><\/p>\\r\\n\\r\\n<p>Điều trị nhiễm giun sán có thể bao gồm điều trị đặc hiệu như các loại thuốc giúp diệt giun sán. Bên cạnh đó, các lựa chọn thuốc bổ sung có thể bao gồm bổ sung sắt nếu có thiếu máu thiếu sắt, kháng sinh nếu có nhiễm trùng. Các thuốc chống động kinh, thuốc giảm đau có thể được dùng trong trường hợp bệnh nang sán thần kinh.<\/p>\\r\\n\\r\\n<p><strong>Ngoại khoa<\/strong><\/p>\\r\\n\\r\\n<p>Phẫu thuật có thể được chỉ định đối với các trường hợp bệnh nang sán. Trong trường hợp bệnh giun chỉ bạch huyết, phẫu thuật cũng có thể được chỉ định. Bên cạnh đó, phẫu thuật giúp giải quyết các biến chứng như tắc ruột, lồng ruột hay xoắn ruột.<\/p>\\r\\n\\r\\n<h2><strong>Chế Độ Sinh Hoạt &amp; Phòng Ngừa<\/strong><\/h2>\\r\\n\\r\\n<h3><strong>Những thói quen sinh hoạt giúp hạn chế diễn tiến của giun sán<\/strong><\/h3>\\r\\n\\r\\n<p>Để hạn chế diễn tiến của nhiễm giun sán, điều quan trọng là bạn cần được điều trị sớm để tránh các biến chứng của bệnh, bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Tuân thủ liệu trình điều trị để đạt được hiệu quả tốt nhất.<\/li>\\r\\n\t<li>Sau điều trị, thực hiện việc giữ gìn vệ sinh đúng cách để tránh mắc bệnh trở lại.<\/li>\\r\\n\t<li>Tự theo dõi các triệu chứng cũng như tái khám định kỳ để có thể phát hiện sớm giun sán (nếu có) và điều trị kịp thời.<\/li>\\r\\n\t<li>Hỏi bác sĩ về cách giữ gìn vệ sinh đúng cách để có thể ngăn ngừa nhiễm giun sán.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<h3><strong>Phòng ngừa giun sán<\/strong><\/h3>\\r\\n\\r\\n<p>Giữ gìn vệ sinh đúng cách là một trong những biện pháp quan trọng nhất để ngăn ngừa nhiễm giun sán. Các việc bạn có thể làm để ngăn ngừa nhiễm giun sán bao gồm:<\/p>\\r\\n\\r\\n<ul>\\r\\n\t<li>Vệ sinh cá nhân tốt như rửa tay thường xuyên, trước khi ăn, sau khi đi vệ sinh.<\/li>\\r\\n\t<li>Làm sạch trái cây, rau quả cũng như các thực phẩm trước khi ăn.<\/li>\\r\\n\t<li>Tránh đi chân đất ngoài trời, tránh tiếp xúc đất hay nguồn nước bị ô nhiễm.<\/li>\\r\\n\t<li>Điều trị cho vật nuôi nếu chúng bị nhiễm giun sán.<\/li>\\r\\n\t<li>Không ăn thịt sống hoặc chưa được nấu chín kỹ.<\/li>\\r\\n\t<li>Bạn nên chú ý khi đi du lịch đến các khu vực có lưu hành bệnh, ví dụ như tránh tiếp xúc với nước ngọt ở vùng lưu hành bệnh giun sán.<\/li>\\r\\n<\/ul>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><img alt=\\\"\\\" src=\\\"\/upload\/images\/danh-muc-benh\/benh-theo-doi-tuong\/benh-tre-em\/giun-san-7.jpg\\\" style=\\\"width: 800px; height: 450px;\\\" \/><\/p>\\r\\n\\r\\n<p style=\\\"text-align: center;\\\"><i>Rửa tay sạch là một trong những biện pháp ngăn ngừa nhiễm giun sán<\/i><\/p>\\r\\n\\r\\n<h3><strong>Các câu hỏi thường gặp về giun sán<\/strong><\/h3>\\r\\n\\r\\n<p><strong>Làm thế nào để tôi có thể ngăn ngừa bệnh giun sán?<\/strong><\/p>\\r\\n\\r\\n<p>Nhiễm giun sán hoàn toàn có thể ngăn ngừa được nếu bạn giữ gìn vệ sinh tốt. Bao gồm rửa tay thường xuyên, làm sạch thực phẩm, không ăn thịt cá chưa được nấu chín, hạn chế tiếp xúc với đất và nước ngọt (đặc biệt là khu vực có lưu hành bệnh).<\/p>\\r\\n\\r\\n<p><strong>Tôi có cần phải phẫu thuật nếu bị giun sán không?<\/strong><\/p>\\r\\n\\r\\n<p>Trong trường hợp bạn bị nang sán do nhiễm ấu trùng sán dây hoặc gặp các biến chứng của nhiễm giun đũa như tắc ruột, lồng ruột, xoắn ruột, bạn cần được phẫu thuật để điều trị các tình trạng này.<\/p>\\r\\n\\r\\n<p><strong>Việt Nam có phải là khu vực lưu hành bệnh giun sán không?<\/strong><\/p>\\r\\n\\r\\n<p>Bệnh giun sán phổ biến ở hầu hết các nước châu Á, trong đó có Việt Nam. Bệnh cũng được tìm thấy ở khu vực châu Phi và châu Mỹ Latinh.<\/p>\\r\\n\\r\\n<p><strong>Bệnh giun truyền qua đất có phổ biến không?<\/strong><\/p>\\r\\n\\r\\n<p>Nhiễm giun truyền qua đất là một trong những bệnh nhiễm trùng phổ biến nhất trên toàn thế giới. Với tỷ lệ mắc ước tính trên toàn cầu là khoảng 1,5 tỷ người, chiếm 24% dân số thế giới.<\/p>', '[42,38]', 'NULL', , , '0', 7, '2024-05-23 10:10:50', 'vi')","duration":2.45,"connection":"mysql","time":1716433850.1553,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Model::__callStatic()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":219,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":"App\\Models\\Article","tags":[]},{"query":"INSERT INTO `catalogues_relationships` (`catalogueid`, `created_at`, `module`, `moduleid`) VALUES (42, '2024-05-23 10:10:50', 'articles', 81), (38, '2024-05-23 10:10:50', 'articles', 81)","duration":0.71,"connection":"mysql","time":1716433850.158176,"trace":[{"call":"Illuminate\\Database\\Query\\Builder->insert()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php","line":31,"isVendor":false},{"call":"App\\Components\\Helper->catalogue_relation_ship()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":237,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false}],"model":null,"tags":[]},{"query":"INSERT INTO `router` (`moduleid`, `module`, `slug`, `created_at`, `alanguage`) VALUES (81, 'articles', 'giun-san-la-gi-nguyen-nhan-trieu-chung-va-cach-dieu-tri', '2024-05-23 10:10:50', 'vi')","duration":0.91,"connection":"mysql","time":1716433850.159412,"trace":[{"call":"Illuminate\\Database\\Query\\Builder->insert()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":246,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false},{"call":"App\\Http\\Middleware\\Locale->handle()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":167,"isVendor":true}],"model":null,"tags":[]},{"query":"SELECT `keyword`, `type`, `id` FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'articles')","duration":0.51,"connection":"mysql","time":1716433850.161383,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Builder->get()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/backend_global_helper.php","line":306,"isVendor":false},{"call":"fieldsInsert()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":249,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->submit()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":108,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->store()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Routing\/Router.php","line":721,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Pipeline\/Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Middleware\/Locale.php","line":39,"isVendor":false}],"model":"App\\Models\\ConfigColum","tags":[]}],"databaseQueriesCount":8,"databaseSlowQueries":0,"databaseSelects":5,"databaseInserts":3,"databaseUpdates":0,"databaseDeletes":0,"databaseOthers":0,"databaseDuration":6.67,"cacheQueries":[],"cacheReads":0,"cacheHits":0,"cacheWrites":0,"cacheDeletes":0,"cacheTime":null,"modelsActions":[],"modelsRetrieved":{"App\\Models\\User":1,"App\\Models\\CategoryArticle":3},"modelsCreated":[],"modelsUpdated":[],"modelsDeleted":[],"redisCommands":[],"queueJobs":[],"timelineData":[{"description":"Controller","start":1716433850.092323,"end":1716433850.169061,"duration":76.73788070678711,"color":null,"data":null}],"log":[{"message":"Optional parameter $request declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 357","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716433850.106556,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]},{"message":"Optional parameter $taxes_type declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 527","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716433850.107135,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]},{"message":"Optional parameter $taxes_import declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 527","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716433850.10733,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]},{"message":"Optional parameter $taxes_export declared before required parameter $id is implicitly treated as a required parameter in \/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Components\/Helper.php on line 527","exception":null,"context":{"__type__":"array"},"level":"warning","time":1716433850.107523,"trace":[{"call":"Illuminate\\Foundation\\Bootstrap\\HandleExceptions->handleError()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"include()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":571,"isVendor":true},{"call":"Composer\\Autoload\\includeFile()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/composer\/ClassLoader.php","line":428,"isVendor":true},{"call":"Composer\\Autoload\\ClassLoader->loadClass()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/app\/Http\/Controllers\/article\/backend\/ArticleController.php","line":27,"isVendor":false},{"call":"App\\Http\\Controllers\\article\\backend\\ArticleController->__construct()","file":null,"line":null,"isVendor":false},{"call":"ReflectionClass->newInstanceArgs()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":917,"isVendor":true},{"call":"Illuminate\\Container\\Container->build()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":758,"isVendor":true},{"call":"Illuminate\\Container\\Container->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":851,"isVendor":true},{"call":"Illuminate\\Foundation\\Application->resolve()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Container\/Container.php","line":694,"isVendor":true},{"call":"Illuminate\\Container\\Container->make()","file":"\/home\/catdailoc\/domains\/daicatloc.nhathuocdaicatloc.vn\/public_html\/vendor\/laravel\/framework\/src\/Illuminate\/Foundation\/Application.php","line":836,"isVendor":true}]}],"events":[],"routes":[],"notifications":[],"emailsData":[],"viewsData":[],"userData":[],"subrequests":[],"xdebug":[],"commandName":null,"commandArguments":[],"commandArgumentsDefaults":[],"commandOptions":[],"commandOptionsDefaults":[],"commandExitCode":null,"commandOutput":null,"jobName":null,"jobDescription":null,"jobStatus":null,"jobPayload":[],"jobQueue":null,"jobConnection":null,"jobOptions":[],"testName":null,"testStatus":null,"testStatusMessage":null,"testAsserts":[],"clientMetrics":[],"webVitals":[],"parent":null,"updateToken":"46dc697c"}