app/Http/Controllers/product/frontend/CategoryController.php

    public function index(Request $request, $slug = "", $id = 0)
    {
        $segments = request()->segments();
        $slug = end($segments);
        $sort = '';
        if (!empty($_GET['sort'])) {
            $sort = $_GET['sort'];
        }
        $detail = CategoryProduct::where(['alanguage' => config('app.locale'), 'slug' => $slug, 'publish' => 0])->with(['children', 'brands_relationships', 'attributes_relationships'])->first();
---
SELECT * FROM `category_products` WHERE (`alanguage` = 'vi' and `slug` = 'cham-soc-sac-dep' and `publish` = 0) LIMIT 1

        // }
        //end
        // breadcrumb
        $breadcrumb = CategoryProduct::select('title', 'slug')->where('alanguage', config('app.locale'))->where('lft', '<=', $detail->lft)->where('rgt', '>=', $detail->lft)->orderBy('lft', 'ASC')->orderBy('order', 'ASC')->get();
---
SELECT `title`, `slug` FROM `category_products` WHERE `alanguage` = 'vi' and `lft` <= 59 and `rgt` >= 59 ORDER BY `lft` ASC, `order` ASC

    public function autocompleteOnline(Request $request)
    {
        $keyword = $request->keyword;
        if (!empty($keyword)) {
            $data =  Product::select('products.id', 'products.title', 'products.image')->where(['alanguage' => config('app.locale'), 'publish' => 0]);
            $data = $data->where(function ($query) use ($keyword) {
                $query->where('title', 'like', '%' . $keyword . '%')
                    ->orWhere('code', 'like', '%' . $keyword . '%');
            });
            $data =  $data->orderBy('order', 'asc');
            $data =  $data->orderBy('id', 'desc');
            $data =  $data->limit(20)->get();
---
SELECT `products`.`id`, `products`.`title`, `products`.`image` FROM `products` WHERE (`alanguage` = 'vi' and `publish` = 0) and (`title` like '%dầu gội%' or `code` like '%dầu gội%') ORDER BY `order` ASC, `id` DESC LIMIT 20