app/Http/Controllers/product/frontend/ProductController.php

    public function index(Request $request, $slug = "", $id = 0)
    {
        // Session::forget('cart');
        $segments = request()->segments();
        $slug = end($segments);
        $detail = Product::where(['alanguage' => config('app.locale'), 'slug' => $slug, 'publish' => 0])
            ->with(['fields', 'brands', 'product_versions', 'deals', 'brand'])
            ->with(['product_stocks'])
            ->first();
        $fields = [];
        if (!empty($detail->fields) && count($detail->fields) > 0) {
            foreach ($detail->fields as $item) {
                $fields[$item->meta_key] = !empty($item->meta_value) ? $item->meta_value : '';
            }
        }
        if (!isset($detail)) {
            return redirect()->route('homepage.index');
        }
        //comment
        $comment_view =  $this->comment->comment(array('id' => $detail->id, 'sort' => 'id'), 'products');
        //end
        //lấy danh mục cha
        $detailCatalogue = $detail->detailCategoryProduct;
        //breadcrumb
        $breadcrumb = [];
        if (!empty($detailCatalogue)) {
            $breadcrumb = CategoryProduct::select('title', 'slug')->where('alanguage', config('app.locale'))->where('lft', '<=', $detailCatalogue->lft)->where('rgt', '>=', $detailCatalogue->lft)->orderBy('lft', 'ASC')->orderBy('order', 'ASC')->get();
        }
        //lấy brands
        $brand = Brand::select('id', 'title', 'slug')->whereIn('id', $detail->brands->pluck('brand_id'))->first();
---
SELECT * FROM `product_stocks` WHERE `product_stocks`.`product_id` in (5) ORDER BY `id` DESC
SELECT * FROM `product_versions` WHERE `product_versions`.`product_id` in (5)
SELECT * FROM `products` WHERE (`alanguage` = 'vi' and `slug` = 'vien-uong-c-500mg-nature-s-bounty-bo-sung-vitamin-c-tang-cuong-suc-de-khang-100-vien-1' and `publish` = 0) LIMIT 1
SELECT `title`, `slug` FROM `category_products` WHERE `alanguage` = 'vi' and `lft` <= 68 and `rgt` >= 68 ORDER BY `lft` ASC, `order` ASC
SELECT `id`, `title`, `slug` FROM `brands` WHERE `id` in (76) LIMIT 1

            ->limit(520)->get(); */


        $policyProduct = \App\Models\CategorySlide::select('title', 'id')->where(['alanguage' => config('app.locale'), 'keyword' => 'policyProduct'])->with('slides')->first();
---
SELECT `title`, `id` FROM `category_slides` WHERE (`alanguage` = 'vi' and `keyword` = 'policyProduct') LIMIT 1