app/Http/Controllers/customer/backend/CustomerController.php

SELECT * FROM `customers` ORDER BY `score` DESC LIMIT 20 offset 0
SELECT * FROM `orders` WHERE `orders`.`customerid` in (18, 23, 24, 25, 26, 27, 28, 29)
SELECT count(*) as aggregate FROM `customers`
---
    public function index(Request $request)
    {
        $module = $this->table;
        $data = Customer::orderBy('score', 'desc');
        if (is($request->order)) {
            if ($request->order == 1) {
                $data = $data->whereHas('orders');
            } else {
                $data = $data->doesntHave('orders');
            }
        } else {
            $data = $data->with('orders');
        }
        if (is($request->keyword)) {
            $data =  $data->Where('name', 'like', '%' . $request->keyword . '%')
                ->orWhere('phone', 'like', '%' . $request->keyword . '%')
                ->orWhere('email', 'like', '%' . $request->keyword . '%');
        }
        if (is($request->catalogueid)) {
            $data =  $data->Where('catalogue_id', $request->catalogueid);
        }
        $data = $data->paginate(env('APP_paginate'));

SELECT `id`, `title` FROM `customer_categories` ORDER BY `id` DESC
---
        if (is($request->catalogueid)) {
            $data->appends(['catalogueid' => $request->catalogueid]);
        }
        $dataCategory = CustomerCategory::select('id', 'title')->orderBy('id', 'desc')->get();