app/Http/Controllers/article/backend/ArticleController.php

SELECT * FROM `tags_relationships` WHERE `tags_relationships`.`module_id` = 90 and `tags_relationships`.`module_id` IS not NULL and `module` = 'articles'
---
        }
        $data =  $data->select('articles.id', 'articles.image', 'articles.title', 'articles.slug', 'articles.catalogue_id', 'articles.userid_created', 'articles.created_at', 'articles.publish', 'articles.order', 'articles.ishome', 'articles.highlight', 'articles.isaside', 'articles.isfooter');
        $data =  $data->groupBy('catalogues_relationships.moduleid');
        $data =  $data->paginate(env('APP_paginate'));

SELECT `id`, `title` FROM `tags` WHERE `module` = 'articles' and `alanguage` = 'vi' ORDER BY `order` ASC, `id` DESC
SELECT `id`, `title` FROM `products` WHERE `alanguage` = 'vi' ORDER BY `order` ASC, `id` DESC
SELECT * FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'articles')
---
    public function create()
    {
        $dropdown = getFunctions();
        $module = $this->table;
        $htmlCatalogue = $this->Nestedsetbie->dropdown([], config('app.locale'));
        //tags
        $getTags = [];
        if (old('tags')) {
            $getTags = old('tags');
        }
        // $tags = relationships('\App\Models\Tag', $getTags);
        //end tag
        $tags = Tag::select('id', 'title')->where('module', 'articles')->where('alanguage', config('app.locale'))->orderBy('order', 'asc')->orderBy('id', 'desc')->get();
        $products = dropdown(\App\Models\Product::select('id', 'title')->where('alanguage', config('app.locale'))->orderBy('order', 'asc')->orderBy('id', 'desc')->get(), 'Chọn sản phẩm', 'id', 'title');
        $field = \App\Models\ConfigColum::where(['trash' => 0, 'publish' => 0, 'module' => $module])->get();