app/Http/Controllers/article/backend/CategoryController.php

SELECT * FROM `users` WHERE `users`.`id` in (1, 7)
SELECT `id`, `title`, `slug`, `userid_created`, `created_at`, `publish`, `order`, `ishome`, `highlight`, `isaside`, `isfooter`, `lft`, `rgt`, `level` FROM `category_articles` WHERE `alanguage` = 'vi' ORDER BY `lft` ASC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `category_articles` WHERE `alanguage` = 'vi'
SELECT `title`, `type` FROM `configis` WHERE (`module` = 'category_articles' and `active` = 1)
---
    public function index(Request $request)
    {
        $module = $this->table;
        $data =  CategoryArticle::where('alanguage', config('app.locale'))->with('user')->with('listArticle')->orderBy('lft', 'ASC');
        $keyword = $request->keyword;
        $type = $request->type;
        if (!empty($keyword)) {
            $data =  $data->where($this->table . '.title', 'like', '%' . $keyword . '%');
        }
        if (!empty($type)) {
            $data =  $data->where($this->table . '.' . $type,  1);
        }
        $data =  $data->select('id', 'title', 'slug', 'userid_created', 'created_at', 'publish', 'order', 'ishome', 'highlight', 'isaside', 'isfooter', 'lft', 'rgt', 'level', 'ishot');
        $data =  $data->paginate(env('APP_paginate'));
        if (is($keyword)) {
            $data->appends(['keyword' => $keyword]);
        }
        if (is($type)) {
            $data->appends(['type' => $type]);
        }
        $configIs = \App\Models\Configis::select('title', 'type')->where(['module' => $this->table, 'active' => 1])->get();

SELECT * FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'category_articles')
---
    public function create()
    {
        $module = $this->table;
        $htmlCatalogue = $this->nestedsetbie->dropdown([], config('app.locale'));
        $field = \App\Models\ConfigColum::where(['trash' => 0, 'publish' => 0, 'module' => $module])->get();

INSERT INTO `category_articles` (`title`, `slug`, `description`, `image_json`, `parentid`, `image`, `banner`, `meta_title`, `meta_description`, `publish`, `userid_created`, `created_at`, `alanguage`) VALUES ('Tim mạch', 'tim-mach', , '', '40', , , , , '0', 7, '2024-05-23 17:23:13', 'vi')
---
    public function submit($request = [], $action = '', $id = 0, $arrayImg = [])
    {
        if ($action == 'create') {
            $time = 'created_at';
            $user = 'userid_created';
        } else {
            $time = 'updated_at';
            $user = 'userid_updated';
        }
        $_data = [
            'title' => $request['title'],
            'slug' => $request['slug'],
            'description' => $request['description'],
            'image_json' =>  !empty($request['album']) ? json_encode($request['album']) : '',
            'parentid' => !empty($request['parentid']) ? $request['parentid'] : 0,
            'image' =>  $arrayImg['image_url'],
            'banner' => $arrayImg['banner_url'],
            'meta_title' => $request['meta_title'],
            'meta_description' => $request['meta_description'],
            'publish' => $request['publish'],
            $user => Auth::user()->id,
            $time => Carbon::now(),
            'alanguage' => config('app.locale'),
        ];
        if ($action == 'create') {
            $id = CategoryArticle::insertGetId($_data);

INSERT INTO `router` (`moduleid`, `module`, `slug`, `created_at`, `alanguage`) VALUES (60, 'category_articles', 'tim-mach', '2024-05-23 17:23:13', 'vi')
---
                $this->Polylang->insert($this->table, $request['language'], $id);
            }
            //thêm router
            DB::table('router')->insert([
                'moduleid' => $id,
                'module' => $this->table,
                'slug' => $request['slug'],
                'created_at' => Carbon::now(),
                'alanguage' => config('app.locale'),
            ]);