app/Http/Controllers/cart/CartController.php

    public function index()
    {
        $dropdown = getFunctions();
        $cartController = Session::get('cart');
        $coupon = Session::get('coupon');
        //page: giỏ hàng
        $page = Page::where(['alanguage' => config('app.locale'), 'page' => 'cart_index'])->select('meta_title', 'meta_description', 'image', 'title')->first();
---
SELECT `meta_title`, `meta_description`, `image`, `title` FROM `pages` WHERE (`alanguage` = 'vi' and `page` = 'cart_index') LIMIT 1

    public function checkout()
    {
        $customer_id = !empty(Auth::guard('customer')->user()) ? Auth::guard('customer')->user()->id : 0;
        $addressCustomer = [];
        if ($customer_id) {
            $addressCustomer = \App\Models\CustomerAddress::where(['publish' => 1, 'customer_id' => $customer_id])->first();
---
SELECT * FROM `customer_addresses` WHERE (`publish` = 1 and `customer_id` = 29) LIMIT 1

            }
        }
        $getCity = \App\Models\VNCity::orderBy('name', 'asc')->get();
        $getDistrict = \App\Models\VNDistrict::where('ProvinceID', $city_id)->orderBy('name', 'asc')->get();
        $getWard = \App\Models\VNWard::where('DistrictID', $district_id)->orderBy('name', 'asc')->get();
---
SELECT * FROM `vn_district` WHERE `ProvinceID` = '227' ORDER BY `name` ASC
SELECT * FROM `vn_ward` WHERE `DistrictID` = '1893' ORDER BY `name` ASC

        $getFeeShip = getFeeShip($city_id, $district_id);
        // Session::forget('coupon');
        // Session::save();
        $detail = Page::find(4);
        //get "Phương thức thanh toán"
        $payments = \App\Models\orderConfig::select('id', 'title', 'description', 'image', 'keyword')->where('publish', 0)->orderBy('order', 'asc')->orderBy('id', 'desc')->get();
        //page: giỏ hàng
        $page = Page::where(['alanguage' => config('app.locale'), 'page' => 'cart_checkout'])->select('meta_title', 'meta_description', 'image', 'title')->first();
---
SELECT * FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1
SELECT `meta_title`, `meta_description`, `image`, `title` FROM `pages` WHERE (`alanguage` = 'vi' and `page` = 'cart_checkout') LIMIT 1

    public function success($id)
    {
        if (empty($id)) {
            return redirect()->route('homepage.index')->with('error', trans('index.OrderDoesNotExist'));
        }
        $detail = Order::with('city_name')->with('district_name')->with('ward_name')->find($id);
        if (!isset($detail)) {
            return redirect()->route('homepage.index')->with('error', trans('index.OrderDoesNotExist'));
        }

        //page: đặt hàng thành công
        $page = Page::where(['page' => 'cart_success', 'alanguage' => config('app.locale')])->select('meta_title', 'meta_description', 'image', 'title')->first();
---
SELECT * FROM `orders` WHERE `orders`.`id` = '9' LIMIT 1
SELECT `meta_title`, `meta_description`, `image`, `title` FROM `pages` WHERE (`page` = 'cart_success' and `alanguage` = 'vi') LIMIT 1