app/Http/Controllers/user/backend/RolesController.php

    public function index()
    {
        //Cập nhập lại session login
        $user = \App\Models\User::where(["id" => Auth::user()->id])->first();
        $temp_permission = [];
        $roles = $user->roles;
        foreach ($roles as $k => $v) {
            $permissions = $v->permissions;
            foreach ($permissions as $v2) {
                if ($v2['parent_id'] == 22) {
                    $temp_permission[] = $v2['key_code'];
                }
            }
        }
        setcookie('authImagesManager', json_encode(array(
            'domain' => env('APP_URL_UPLOAD'),
            'email' => $user->email,
            'permission' => $temp_permission,
            'folder_upload' => ($user->id * 168) * 168 + 168,
        )), time() + (86400 * 30), '/');
        //end
        $data =  Role::latest()->paginate(20);
---
SELECT * FROM `users` WHERE (`id` = 1) LIMIT 1
SELECT * FROM `roles` ORDER BY `created_at` DESC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `roles`