app/Http/Controllers/product/backend/CategoryController.php

SELECT * FROM `users` WHERE `users`.`id` in (7)
SELECT `id`, `slug`, `title`, `ishome`, `highlight`, `isaside`, `isfooter`, `isnew`, `isHeader`, `order`, `publish`, `lft`, `rgt`, `level`, `created_at`, `userid_created`, `parentid` FROM `category_products` WHERE `alanguage` = 'vi' ORDER BY `lft` ASC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `category_products` WHERE `alanguage` = 'vi'
SELECT `title`, `type` FROM `configis` WHERE (`module` = 'category_products' and `active` = 1)
---
    public function index(Request $request)
    {

        $module = $this->table;
        $data = CategoryProduct::select('id', 'slug', 'title', 'ishome', 'highlight', 'isaside', 'isfooter', 'isnew', 'isHeader', 'order', 'publish', 'lft', 'rgt', 'level', 'created_at', 'userid_created', 'parentid')->with('user')->with('countProduct')->where('alanguage', config('app.locale'))->orderBy('lft', 'ASC');
        $keyword = $request->keyword;
        $type = $request->type;
        if (!empty($keyword)) {
            $data = $data->where($this->table . '.title', 'like', '%' . $keyword . '%');
        }
        if (!empty($type)) {
            $data = $data->where($this->table . '.' . $type, 1);
        }
        $data = $data->paginate(env('APP_paginate'));
        if (is($type)) {
            $data->appends(['type' => $type]);
        }
        if (is($keyword)) {
            $data->appends(['keyword' => $keyword]);
        }
        $configIs = \App\Models\Configis::select('title', 'type')->where(['module' => $this->table, 'active' => 1])->get();