app/Http/Controllers/product/backend/ProductController.php

SELECT `id`, `title` FROM `brands` WHERE `alanguage` = 'vi' ORDER BY `order` ASC, `id` DESC
SELECT `id`, `title` FROM `tags` WHERE `module` = 'products' and `alanguage` = 'vi' ORDER BY `order` ASC, `id` DESC
SELECT * FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'products')
SELECT `title`, `type` FROM `configis` WHERE (`module` = 'products' and `active` = 1)
---
            $data->appends(['catalogueid' => $catalogue_id]);
        }
        $catalogues = $this->Nestedsetbie->dropdown([], config('app.locale'));
        $brands = \App\Models\Brand::select('id', 'title')->where('alanguage', config('app.locale'))->orderBy('order', 'asc')->orderBy('id', 'desc')->get();
        $tags = \App\Models\Tag::select('id', 'title')->where('module', 'products')->where('alanguage', config('app.locale'))->orderBy('order', 'asc')->orderBy('id', 'desc')->get();
        $field = \App\Models\ConfigColum::where(['trash' => 0, 'publish' => 0, 'module' => $this->table])->get();
        $configIs = \App\Models\Configis::select('title', 'type')->where(['module' => $this->table, 'active' => 1])->get();

SELECT * FROM `product_stocks` WHERE `product_stocks`.`product_id` in (8) and `type` = 'simple' ORDER BY `id` DESC
SELECT * FROM `product_versions` WHERE `product_versions`.`product_id` in (8)
SELECT * FROM `taxes_relationships` WHERE `taxes_relationships`.`product_id` in (8)
SELECT `id`, `title` FROM `category_attributes` WHERE `alanguage` = 'vi' and `ishome` = 0 ORDER BY `order` ASC, `id` DESC
---
    public function edit($id)
    {
        $module = $this->table;
        $detail = Product::where('alanguage', config('app.locale'))
            ->with(['product_versions' => function ($query) {
                $query->with(['product_stocks']);
            }])
            ->with(['product_versions'])
            ->with(['TaxesRelationships'])
            // ->with(['product_stock_histories' => function ($query) {
            //     $query->with(['user', 'product_versions', 'address'])->paginate(1);
            // }])
            ->with(['product_stocks' => function ($query) {
                $query->where('type', 'simple');
            }])
            ->find($id);

        if (!isset($detail)) {
            return redirect()->route('products.index')->with('error', "Sản phẩm không tồn tại");
        }
        // $product_stock_histories = \App\Models\ProductStockHistory::where('product_id', $detail->id)->with(['user', 'product_versions', 'address'])->paginate(1);
        $product_stocks = $detail->product_stocks->groupBy('product_version_id');
        $category_attribute = DB::table('category_attributes')
            ->select('id', 'title')
            ->where('alanguage', config('app.locale'))
            ->where('ishome', 0)
            ->orderBy('order', 'asc')
            ->orderBy('id', 'desc')
            ->get();

SELECT * FROM `attributes` WHERE `id` in ('16') ORDER BY `order` ASC, `id` DESC
---
                    $attribute_json[$key] = '';
                } else {
                    // $attribute_json[$key]['json'] = base64_encode(json_encode($value));
                    $attributes = DB::table('attributes')->orderBy('order', 'asc')->orderBy('id', 'desc')->whereIn('id', $value)->get();

SELECT `id`, `title`, `cityid`, `districtid`, `wardid` FROM `addresses` WHERE `alanguage` = 'vi' ORDER BY `active` DESC, `id` DESC
SELECT `id`, `title`, `value` FROM `taxes` WHERE `id` != 1
SELECT `id`, `title` FROM `tags` WHERE `module` = 'products' and `alanguage` = 'vi' ORDER BY `order` ASC, `id` DESC
SELECT * FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'products')
---
        } else {
            $getCatalogue = json_decode($detail->catalogue);
        }
        $address = \App\Models\Address::select('id', 'title', 'cityid', 'districtid', 'wardid')
            ->where('alanguage', config('app.locale'))
            ->with(['city_name', 'district_name', 'ward_name'])
            ->with(['stocks' => function ($query) use ($id) {
                $query->where('product_id', '=', $id)->where('type', '=', 'simple');
            }])
            ->orderBy('active', 'desc')
            ->orderBy('id', 'desc')
            ->get();
        $listTaxes = \App\Models\Tax::select('id', 'title', 'value')->where('id', '!=', 1)->get();
        $catalogues = $this->Nestedsetbie->dropdown([], config('app.locale'));
        $brands = $this->Brands->dropdown();
        $tags = \App\Models\Tag::select('id', 'title')->where('module', 'products')->where('alanguage', config('app.locale'))->orderBy('order', 'asc')->orderBy('id', 'desc')->get();
        $field = \App\Models\ConfigColum::where(['trash' => 0, 'publish' => 0, 'module' => $this->table])->get();

SELECT `id`, `title`, `slug`, `lft` FROM `category_products` WHERE `id` = '41' LIMIT 1
SELECT `id`, `title` FROM `category_products` WHERE `alanguage` = 'vi' and `lft` <= 17 and `rgt` >= 17 ORDER BY `lft` ASC, `order` ASC
---
    public function submit($request = [], $action = '', $id = 0, $image_url = '')
    {
        if ($action == 'create') {
            $time = 'created_at';
            $user = 'userid_created';
        } else {
            $time = 'updated_at';
            $user = 'userid_updated';
        }
        $type = $request['type'];
        //lấy danh mục phụ
        $catalogue = $request['catalogue'];
        $tmp_catalogue = [];
        if (isset($catalogue)) {
            foreach ($catalogue as $v) {
                if ($v != 0 && $v != $request['catalogueid']) { //check id != 0 và id != danh mục chính
                    $tmp_catalogue[] = $v;
                }
            }
        }
        //lấy danh mục cha (nếu có)
        $detail = CategoryProduct::select('id', 'title', 'slug', 'lft')->where('id', $request['catalogueid'])->first();
        $breadcrumb = CategoryProduct::select('id', 'title')->where('alanguage', config('app.locale'))->where('lft', '<=', $detail->lft)->where('rgt', '>=', $detail->lft)->orderBy('lft', 'ASC')->orderBy('order', 'ASC')->get();

DELETE FROM `router` WHERE (`moduleid` = '54' and `module` = 'products' and `alanguage` = 'vi')
DELETE FROM `catalogues_relationships` WHERE `moduleid` = '54' and `module` = 'products'
DELETE FROM `tags_relationships` WHERE `module_id` = '54' and `module` = 'products'
DELETE FROM `brands_relationships` WHERE `product_id` = '54'
DELETE FROM `attributes_relationships` WHERE `product_id` = '54'
DELETE FROM `config_postmetas` WHERE (`module_id` = '54' and `module` = 'products')
---
            /*xóa khi cập nhập*/
            if ($action == 'update') {
                /*xóa router*/
                DB::table('router')->where(['moduleid' => $id, 'module' => $this->table, 'alanguage' => $alanguage])->delete();
                /*xóa catalogue_relationship*/
                DB::table('catalogues_relationships')->where('moduleid', $id)->where('module', $this->table)->delete();
                /*xóa tags_relationship*/
                DB::table('tags_relationships')->where('module_id', $id)->where('module', $this->table)->delete();
                /*xóa brands_relationship*/
                DB::table('brands_relationships')->where('product_id', $id)->delete();
                /*xóa attribute_relationship*/
                DB::table('attributes_relationships')->where('product_id', $id)->delete();
                /*xóa custom fields*/
                DB::table('config_postmetas')->where(['module_id' => $id, 'module' => $this->table])->delete();

DELETE FROM `taxes_relationships` WHERE `product_id` = '54'
---
                /*xoa product_stocks*/
                // \App\Models\ProductStock::where('product_id', $id)->delete();
                /*xoa taxes_relationships*/
                \App\Models\TaxesRelationships::where('product_id', $id)->delete();

INSERT INTO `router` (`moduleid`, `module`, `slug`, `created_at`, `alanguage`) VALUES ('54', 'products', 'gac-phau-thuat-10cm-x10cm-an-lanh-b-10-goi', '2024-05-27 10:28:36', 'vi')
---
                $this->Helper->insert_product_stocks($id);
            }
            //thêm router
            DB::table('router')->insert([
                'moduleid' => $id,
                'module' => $this->table,
                'slug' => $request['slug'],
                'created_at' => Carbon::now(),
                'alanguage' => $alanguage,
            ]);

SELECT `title`, `type` FROM `configis` WHERE (`module` = 'products' and `active` = 1)
---
        }
        $data = $data->groupBy('catalogues_relationships.moduleid');
        $data = $data->paginate(env('APP_paginate'));
        $configIs = \App\Models\Configis::select('title', 'type')->where(['module' => $this->table, 'active' => 1])->get();