app/Http/Controllers/article/frontend/ArticleController.php

SELECT * FROM `articles` WHERE (`slug` = 'sau-ngo-doc-thuc-pham-co-the-met-moi-nen-an-gi-de-nhanh-hoi-phuc' and `alanguage` = 'vi' and `publish` = 0) LIMIT 1
SELECT `title`, `slug` FROM `category_articles` WHERE `alanguage` = 'vi' and `lft` <= 73 and `rgt` >= 73 ORDER BY `lft` ASC, `order` ASC
SELECT `id`, `title`, `slug`, `image`, `description`, `articles`.`created_at` FROM `articles` inner join `catalogues_relationships` on `articles`.`id` = `catalogues_relationships`.`moduleid` WHERE `alanguage` = 'vi' and `catalogues_relationships`.`catalogueid` = 1 and `catalogues_relationships`.`moduleid` != 38 and `articles`.`publish` = 0 and `catalogues_relationships`.`module` = 'articles' GROUP BY `catalogues_relationships`.`moduleid` ORDER BY `order` ASC, `id` DESC LIMIT 20
UPDATE `articles` SET `viewed` = 7 WHERE `id` = 38
SELECT `id`, `slug`, `title` FROM `articles` WHERE `id` < 38 and `alanguage` = 'vi' and `catalogue_id` = 1 LIMIT 1
SELECT `id`, `slug`, `title` FROM `articles` WHERE `id` > 38 and `alanguage` = 'vi' and `catalogue_id` = 1 LIMIT 1
---
    public function index($slug = "")
    {
        $segments = request()->segments();
        $slug = end($segments);
        $detail = Article::select()
            ->where(['slug' => $slug, 'alanguage' => config('app.locale'), 'publish' => 0])
            ->with('catalogues')
            ->first();
        if (!isset($detail)) {
            return redirect()->route('homepage.index');
        }
        $catalogues = $detail->catalogues;
        // breadcrumb
        $breadcrumb = CategoryArticle::select('title', 'slug')->where('alanguage', config('app.locale'))->where('lft', '<=', $catalogues->lft)->where('rgt', '>=', $catalogues->lft)->orderBy('lft', 'ASC')->orderBy('order', 'ASC')->get();
        //bài viết liên quan
        $sameArticle =  Article::select('id', 'title', 'slug', 'image', 'description',  'articles.created_at')->where('alanguage', config('app.locale'))->where('catalogues_relationships.catalogueid', $catalogues->id)->where('catalogues_relationships.moduleid', '!=', $detail['id'])->where('articles.publish', 0)->orderBy('order', 'ASC')->orderBy('id', 'DESC');
        $sameArticle = $sameArticle->join('catalogues_relationships', 'articles.id', '=', 'catalogues_relationships.moduleid')->where('catalogues_relationships.module', '=', 'articles');
        $sameArticle =  $sameArticle->groupBy('catalogues_relationships.moduleid');
        $sameArticle =  $sameArticle->limit(5)->get();
        //cập nhập lượt xem
        DB::table('articles')->where('id', '=', $detail['id'])->update([
            'viewed' => $detail['viewed'] + 1,
        ]);
        //lấy comment
        $comment_view =  $this->comment->comment(array('id' => $detail->id, 'sort' => 'id'), 'articles');
        $previous = Article::select('id', 'slug', 'title')->where('id', '<', $detail->id)->where('alanguage', config('app.locale'))->where('catalogue_id', $detail->catalogue_id)->first();
        $next = Article::select('id', 'slug', 'title')->where('id', '>', $detail->id)->where('alanguage', config('app.locale'))->where('catalogue_id', $detail->catalogue_id)->first();