app/Http/Controllers/article/frontend/CategoryController.php

SELECT `id`, `slug`, `title`, `description`, `meta_description`, `meta_title`, `publish`, `lft`, `image`, `banner`, `ishome`, `highlight`, `isaside`, `isfooter`, `parentid` FROM `category_articles` WHERE `alanguage` = 'vi' and `publish` = 0 and `slug` = 'tin-tuc' LIMIT 1
SELECT `articles`.`title`, `articles`.`id`, `articles`.`slug`, `articles`.`image`, `articles`.`description`, `articles`.`catalogue_id`, `category_articles`.`title` as `titleC`, `category_articles`.`slug` as `slugC`, `catalogues_relationships`.`catalogueid`, `articles`.`created_at` FROM `catalogues_relationships` inner join `articles` on `articles`.`id` = `catalogues_relationships`.`moduleid` inner join `category_articles` on `category_articles`.`id` = `articles`.`catalogue_id` WHERE `module` = 'articles' and (`articles`.`publish` = 0) and `catalogues_relationships`.`catalogueid` in (1, 10, 34, 35) ORDER BY `articles`.`order` ASC, `articles`.`id` DESC LIMIT 36
SELECT `articles`.`title`, `articles`.`created_at`, `articles`.`id`, `articles`.`slug`, `articles`.`image`, `articles`.`description`, `articles`.`catalogue_id`, `category_articles`.`title` as `titleC`, `category_articles`.`slug` as `slugC` FROM `catalogues_relationships` inner join `articles` on `articles`.`id` = `catalogues_relationships`.`moduleid` inner join `category_articles` on `category_articles`.`id` = `articles`.`catalogue_id` WHERE (`catalogueid` = 33 and `module` = 'articles' and `articles`.`publish` = 0) ORDER BY `articles`.`id` DESC LIMIT 13 offset 0
SELECT count(*) as aggregate FROM `catalogues_relationships` inner join `articles` on `articles`.`id` = `catalogues_relationships`.`moduleid` inner join `category_articles` on `category_articles`.`id` = `articles`.`catalogue_id` WHERE (`catalogueid` = 33 and `module` = 'articles' and `articles`.`publish` = 0)
SELECT `title`, `slug` FROM `category_articles` WHERE `alanguage` = 'vi' and `lft` <= 68 and `rgt` >= 68 ORDER BY `lft` ASC, `order` ASC
---
    public function index($slug = "", Request $request)
    {
        $segments = request()->segments();
        $slug = end($segments);
        $detail = CategoryArticle::select('id', 'slug', 'title', 'description', 'meta_description', 'meta_title', 'publish', 'lft', 'image', 'banner', 'ishome', 'highlight', 'isaside', 'isfooter', 'parentid')
            ->with(['children'])
            ->where('alanguage', config('app.locale'))
            ->where('publish', 0)
            ->where('slug', $slug)
            ->first();
        if (!isset($detail)) {
            return redirect()->route('homepage.index');
        }
        $data = \App\Models\Catalogues_relationships::select('articles.title', 'articles.created_at', 'articles.id', 'articles.slug', 'articles.image', 'articles.description', 'articles.catalogue_id', 'category_articles.title as titleC', 'category_articles.slug as slugC')->where(['catalogueid' => $detail->id, 'module' => 'articles', 'articles.publish' => 0])
            ->join('articles', 'articles.id', '=', 'catalogues_relationships.moduleid')
            ->join('category_articles', 'category_articles.id', '=', 'articles.catalogue_id')
            // ->with('tagsArticle')
            ->orderBy('articles.id', 'desc')
            ->paginate($this->paginate);
        // breadcrumb
        $breadcrumb = CategoryArticle::select('title', 'slug')->where('alanguage', config('app.locale'))->where('lft', '<=', $detail->lft)->where('rgt', '>=', $detail->lft)->orderBy('lft', 'ASC')->orderBy('order', 'ASC')->get();

SELECT `id`, `title`, `description`, `image`, `slug`, `userid_created`, `created_at` FROM `articles` WHERE (`alanguage` = 'vi' and `publish` = 0) and `title` like '%sức khỏe%' ORDER BY `order` ASC, `id` DESC LIMIT 13 offset 0
SELECT count(*) as aggregate FROM `articles` WHERE (`alanguage` = 'vi' and `publish` = 0) and `title` like '%sức khỏe%'
---
    public function search(Request $request)
    {
        $keyword = $request->keyword;
        $month = $request->month;
        $sort = '';
        if (!empty($_GET['sort'])) {
            $sort = $_GET['sort'];
        }
        $data =  Article::select('id', 'title', 'description', 'image', 'slug', 'userid_created', 'created_at')->where(['alanguage' => config('app.locale'), 'publish' => 0])->with(['catalogues']);
        if (!empty($keyword)) {
            $data =  $data->where('title', 'like', '%' . $keyword . '%');
        }
        if (!empty($month)) {
            $data =  $data->whereMonth('created_at', $month);
        }
        $data =  $data->orderBy('order', 'asc')->orderBy('id', 'desc');
        $data =  $data->paginate($this->paginate);